const areas = [
    {
        "id": 110000,
        "name": "北京市",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 110100,
                "name": "市辖区",
                "pid": 110000,
                "level": 1,
                "children": [
                    {
                        "id": 110101,
                        "name": "东城区",
                        "pid": 110100,
                        "level": 2,
                        "text": "东城区",
                        "value": 110101
                    },
                    {
                        "id": 110102,
                        "name": "西城区",
                        "pid": 110100,
                        "level": 2,
                        "text": "西城区",
                        "value": 110102
                    },
                    {
                        "id": 110105,
                        "name": "朝阳区",
                        "pid": 110100,
                        "level": 2,
                        "text": "朝阳区",
                        "value": 110105
                    },
                    {
                        "id": 110106,
                        "name": "丰台区",
                        "pid": 110100,
                        "level": 2,
                        "text": "丰台区",
                        "value": 110106
                    },
                    {
                        "id": 110107,
                        "name": "石景山区",
                        "pid": 110100,
                        "level": 2,
                        "text": "石景山区",
                        "value": 110107
                    },
                    {
                        "id": 110108,
                        "name": "海淀区",
                        "pid": 110100,
                        "level": 2,
                        "text": "海淀区",
                        "value": 110108
                    },
                    {
                        "id": 110109,
                        "name": "门头沟区",
                        "pid": 110100,
                        "level": 2,
                        "text": "门头沟区",
                        "value": 110109
                    },
                    {
                        "id": 110111,
                        "name": "房山区",
                        "pid": 110100,
                        "level": 2,
                        "text": "房山区",
                        "value": 110111
                    },
                    {
                        "id": 110112,
                        "name": "通州区",
                        "pid": 110100,
                        "level": 2,
                        "text": "通州区",
                        "value": 110112
                    },
                    {
                        "id": 110113,
                        "name": "顺义区",
                        "pid": 110100,
                        "level": 2,
                        "text": "顺义区",
                        "value": 110113
                    },
                    {
                        "id": 110114,
                        "name": "昌平区",
                        "pid": 110100,
                        "level": 2,
                        "text": "昌平区",
                        "value": 110114
                    },
                    {
                        "id": 110115,
                        "name": "大兴区",
                        "pid": 110100,
                        "level": 2,
                        "text": "大兴区",
                        "value": 110115
                    },
                    {
                        "id": 110116,
                        "name": "怀柔区",
                        "pid": 110100,
                        "level": 2,
                        "text": "怀柔区",
                        "value": 110116
                    },
                    {
                        "id": 110117,
                        "name": "平谷区",
                        "pid": 110100,
                        "level": 2,
                        "text": "平谷区",
                        "value": 110117
                    },
                    {
                        "id": 110118,
                        "name": "密云区",
                        "pid": 110100,
                        "level": 2,
                        "text": "密云区",
                        "value": 110118
                    },
                    {
                        "id": 110119,
                        "name": "延庆区",
                        "pid": 110100,
                        "level": 2,
                        "text": "延庆区",
                        "value": 110119
                    }
                ],
                "text": "市辖区",
                "value": 110100
            }
        ],
        "text": "北京市",
        "value": 110000
    },
    {
        "id": 120000,
        "name": "天津市",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 120100,
                "name": "市辖区",
                "pid": 120000,
                "level": 1,
                "children": [
                    {
                        "id": 120101,
                        "name": "和平区",
                        "pid": 120100,
                        "level": 2,
                        "text": "和平区",
                        "value": 120101
                    },
                    {
                        "id": 120102,
                        "name": "河东区",
                        "pid": 120100,
                        "level": 2,
                        "text": "河东区",
                        "value": 120102
                    },
                    {
                        "id": 120103,
                        "name": "河西区",
                        "pid": 120100,
                        "level": 2,
                        "text": "河西区",
                        "value": 120103
                    },
                    {
                        "id": 120104,
                        "name": "南开区",
                        "pid": 120100,
                        "level": 2,
                        "text": "南开区",
                        "value": 120104
                    },
                    {
                        "id": 120105,
                        "name": "河北区",
                        "pid": 120100,
                        "level": 2,
                        "text": "河北区",
                        "value": 120105
                    },
                    {
                        "id": 120106,
                        "name": "红桥区",
                        "pid": 120100,
                        "level": 2,
                        "text": "红桥区",
                        "value": 120106
                    },
                    {
                        "id": 120110,
                        "name": "东丽区",
                        "pid": 120100,
                        "level": 2,
                        "text": "东丽区",
                        "value": 120110
                    },
                    {
                        "id": 120111,
                        "name": "西青区",
                        "pid": 120100,
                        "level": 2,
                        "text": "西青区",
                        "value": 120111
                    },
                    {
                        "id": 120112,
                        "name": "津南区",
                        "pid": 120100,
                        "level": 2,
                        "text": "津南区",
                        "value": 120112
                    },
                    {
                        "id": 120113,
                        "name": "北辰区",
                        "pid": 120100,
                        "level": 2,
                        "text": "北辰区",
                        "value": 120113
                    },
                    {
                        "id": 120114,
                        "name": "武清区",
                        "pid": 120100,
                        "level": 2,
                        "text": "武清区",
                        "value": 120114
                    },
                    {
                        "id": 120115,
                        "name": "宝坻区",
                        "pid": 120100,
                        "level": 2,
                        "text": "宝坻区",
                        "value": 120115
                    },
                    {
                        "id": 120116,
                        "name": "滨海新区",
                        "pid": 120100,
                        "level": 2,
                        "text": "滨海新区",
                        "value": 120116
                    },
                    {
                        "id": 120117,
                        "name": "宁河区",
                        "pid": 120100,
                        "level": 2,
                        "text": "宁河区",
                        "value": 120117
                    },
                    {
                        "id": 120118,
                        "name": "静海区",
                        "pid": 120100,
                        "level": 2,
                        "text": "静海区",
                        "value": 120118
                    },
                    {
                        "id": 120119,
                        "name": "蓟州区",
                        "pid": 120100,
                        "level": 2,
                        "text": "蓟州区",
                        "value": 120119
                    }
                ],
                "text": "市辖区",
                "value": 120100
            }
        ],
        "text": "天津市",
        "value": 120000
    },
    {
        "id": 130000,
        "name": "河北省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 130100,
                "name": "石家庄市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 130101,
                        "name": "市辖区",
                        "pid": 130100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 130101
                    },
                    {
                        "id": 130102,
                        "name": "长安区",
                        "pid": 130100,
                        "level": 2,
                        "text": "长安区",
                        "value": 130102
                    },
                    {
                        "id": 130104,
                        "name": "桥西区",
                        "pid": 130100,
                        "level": 2,
                        "text": "桥西区",
                        "value": 130104
                    },
                    {
                        "id": 130105,
                        "name": "新华区",
                        "pid": 130100,
                        "level": 2,
                        "text": "新华区",
                        "value": 130105
                    },
                    {
                        "id": 130107,
                        "name": "井陉矿区",
                        "pid": 130100,
                        "level": 2,
                        "text": "井陉矿区",
                        "value": 130107
                    },
                    {
                        "id": 130108,
                        "name": "裕华区",
                        "pid": 130100,
                        "level": 2,
                        "text": "裕华区",
                        "value": 130108
                    },
                    {
                        "id": 130109,
                        "name": "藁城区",
                        "pid": 130100,
                        "level": 2,
                        "text": "藁城区",
                        "value": 130109
                    },
                    {
                        "id": 130110,
                        "name": "鹿泉区",
                        "pid": 130100,
                        "level": 2,
                        "text": "鹿泉区",
                        "value": 130110
                    },
                    {
                        "id": 130111,
                        "name": "栾城区",
                        "pid": 130100,
                        "level": 2,
                        "text": "栾城区",
                        "value": 130111
                    },
                    {
                        "id": 130121,
                        "name": "井陉县",
                        "pid": 130100,
                        "level": 2,
                        "text": "井陉县",
                        "value": 130121
                    },
                    {
                        "id": 130123,
                        "name": "正定县",
                        "pid": 130100,
                        "level": 2,
                        "text": "正定县",
                        "value": 130123
                    },
                    {
                        "id": 130125,
                        "name": "行唐县",
                        "pid": 130100,
                        "level": 2,
                        "text": "行唐县",
                        "value": 130125
                    },
                    {
                        "id": 130126,
                        "name": "灵寿县",
                        "pid": 130100,
                        "level": 2,
                        "text": "灵寿县",
                        "value": 130126
                    },
                    {
                        "id": 130127,
                        "name": "高邑县",
                        "pid": 130100,
                        "level": 2,
                        "text": "高邑县",
                        "value": 130127
                    },
                    {
                        "id": 130128,
                        "name": "深泽县",
                        "pid": 130100,
                        "level": 2,
                        "text": "深泽县",
                        "value": 130128
                    },
                    {
                        "id": 130129,
                        "name": "赞皇县",
                        "pid": 130100,
                        "level": 2,
                        "text": "赞皇县",
                        "value": 130129
                    },
                    {
                        "id": 130130,
                        "name": "无极县",
                        "pid": 130100,
                        "level": 2,
                        "text": "无极县",
                        "value": 130130
                    },
                    {
                        "id": 130131,
                        "name": "平山县",
                        "pid": 130100,
                        "level": 2,
                        "text": "平山县",
                        "value": 130131
                    },
                    {
                        "id": 130132,
                        "name": "元氏县",
                        "pid": 130100,
                        "level": 2,
                        "text": "元氏县",
                        "value": 130132
                    },
                    {
                        "id": 130133,
                        "name": "赵县",
                        "pid": 130100,
                        "level": 2,
                        "text": "赵县",
                        "value": 130133
                    },
                    {
                        "id": 130183,
                        "name": "晋州市",
                        "pid": 130100,
                        "level": 2,
                        "text": "晋州市",
                        "value": 130183
                    },
                    {
                        "id": 130184,
                        "name": "新乐市",
                        "pid": 130100,
                        "level": 2,
                        "text": "新乐市",
                        "value": 130184
                    }
                ],
                "text": "石家庄市",
                "value": 130100
            },
            {
                "id": 130200,
                "name": "唐山市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 130201,
                        "name": "市辖区",
                        "pid": 130200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 130201
                    },
                    {
                        "id": 130202,
                        "name": "路南区",
                        "pid": 130200,
                        "level": 2,
                        "text": "路南区",
                        "value": 130202
                    },
                    {
                        "id": 130203,
                        "name": "路北区",
                        "pid": 130200,
                        "level": 2,
                        "text": "路北区",
                        "value": 130203
                    },
                    {
                        "id": 130204,
                        "name": "古冶区",
                        "pid": 130200,
                        "level": 2,
                        "text": "古冶区",
                        "value": 130204
                    },
                    {
                        "id": 130205,
                        "name": "开平区",
                        "pid": 130200,
                        "level": 2,
                        "text": "开平区",
                        "value": 130205
                    },
                    {
                        "id": 130207,
                        "name": "丰南区",
                        "pid": 130200,
                        "level": 2,
                        "text": "丰南区",
                        "value": 130207
                    },
                    {
                        "id": 130208,
                        "name": "丰润区",
                        "pid": 130200,
                        "level": 2,
                        "text": "丰润区",
                        "value": 130208
                    },
                    {
                        "id": 130209,
                        "name": "曹妃甸区",
                        "pid": 130200,
                        "level": 2,
                        "text": "曹妃甸区",
                        "value": 130209
                    },
                    {
                        "id": 130223,
                        "name": "滦县",
                        "pid": 130200,
                        "level": 2,
                        "text": "滦县",
                        "value": 130223
                    },
                    {
                        "id": 130224,
                        "name": "滦南县",
                        "pid": 130200,
                        "level": 2,
                        "text": "滦南县",
                        "value": 130224
                    },
                    {
                        "id": 130225,
                        "name": "乐亭县",
                        "pid": 130200,
                        "level": 2,
                        "text": "乐亭县",
                        "value": 130225
                    },
                    {
                        "id": 130227,
                        "name": "迁西县",
                        "pid": 130200,
                        "level": 2,
                        "text": "迁西县",
                        "value": 130227
                    },
                    {
                        "id": 130229,
                        "name": "玉田县",
                        "pid": 130200,
                        "level": 2,
                        "text": "玉田县",
                        "value": 130229
                    },
                    {
                        "id": 130281,
                        "name": "遵化市",
                        "pid": 130200,
                        "level": 2,
                        "text": "遵化市",
                        "value": 130281
                    },
                    {
                        "id": 130283,
                        "name": "迁安市",
                        "pid": 130200,
                        "level": 2,
                        "text": "迁安市",
                        "value": 130283
                    }
                ],
                "text": "唐山市",
                "value": 130200
            },
            {
                "id": 130300,
                "name": "秦皇岛市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 130301,
                        "name": "市辖区",
                        "pid": 130300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 130301
                    },
                    {
                        "id": 130302,
                        "name": "海港区",
                        "pid": 130300,
                        "level": 2,
                        "text": "海港区",
                        "value": 130302
                    },
                    {
                        "id": 130303,
                        "name": "山海关区",
                        "pid": 130300,
                        "level": 2,
                        "text": "山海关区",
                        "value": 130303
                    },
                    {
                        "id": 130304,
                        "name": "北戴河区",
                        "pid": 130300,
                        "level": 2,
                        "text": "北戴河区",
                        "value": 130304
                    },
                    {
                        "id": 130306,
                        "name": "抚宁区",
                        "pid": 130300,
                        "level": 2,
                        "text": "抚宁区",
                        "value": 130306
                    },
                    {
                        "id": 130321,
                        "name": "青龙满族自治县",
                        "pid": 130300,
                        "level": 2,
                        "text": "青龙满族自治县",
                        "value": 130321
                    },
                    {
                        "id": 130322,
                        "name": "昌黎县",
                        "pid": 130300,
                        "level": 2,
                        "text": "昌黎县",
                        "value": 130322
                    },
                    {
                        "id": 130324,
                        "name": "卢龙县",
                        "pid": 130300,
                        "level": 2,
                        "text": "卢龙县",
                        "value": 130324
                    }
                ],
                "text": "秦皇岛市",
                "value": 130300
            },
            {
                "id": 130400,
                "name": "邯郸市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 130401,
                        "name": "市辖区",
                        "pid": 130400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 130401
                    },
                    {
                        "id": 130402,
                        "name": "邯山区",
                        "pid": 130400,
                        "level": 2,
                        "text": "邯山区",
                        "value": 130402
                    },
                    {
                        "id": 130403,
                        "name": "丛台区",
                        "pid": 130400,
                        "level": 2,
                        "text": "丛台区",
                        "value": 130403
                    },
                    {
                        "id": 130404,
                        "name": "复兴区",
                        "pid": 130400,
                        "level": 2,
                        "text": "复兴区",
                        "value": 130404
                    },
                    {
                        "id": 130406,
                        "name": "峰峰矿区",
                        "pid": 130400,
                        "level": 2,
                        "text": "峰峰矿区",
                        "value": 130406
                    },
                    {
                        "id": 130421,
                        "name": "邯郸县",
                        "pid": 130400,
                        "level": 2,
                        "text": "邯郸县",
                        "value": 130421
                    },
                    {
                        "id": 130423,
                        "name": "临漳县",
                        "pid": 130400,
                        "level": 2,
                        "text": "临漳县",
                        "value": 130423
                    },
                    {
                        "id": 130424,
                        "name": "成安县",
                        "pid": 130400,
                        "level": 2,
                        "text": "成安县",
                        "value": 130424
                    },
                    {
                        "id": 130425,
                        "name": "大名县",
                        "pid": 130400,
                        "level": 2,
                        "text": "大名县",
                        "value": 130425
                    },
                    {
                        "id": 130426,
                        "name": "涉县",
                        "pid": 130400,
                        "level": 2,
                        "text": "涉县",
                        "value": 130426
                    },
                    {
                        "id": 130427,
                        "name": "磁县",
                        "pid": 130400,
                        "level": 2,
                        "text": "磁县",
                        "value": 130427
                    },
                    {
                        "id": 130428,
                        "name": "肥乡县",
                        "pid": 130400,
                        "level": 2,
                        "text": "肥乡县",
                        "value": 130428
                    },
                    {
                        "id": 130429,
                        "name": "永年县",
                        "pid": 130400,
                        "level": 2,
                        "text": "永年县",
                        "value": 130429
                    },
                    {
                        "id": 130430,
                        "name": "邱县",
                        "pid": 130400,
                        "level": 2,
                        "text": "邱县",
                        "value": 130430
                    },
                    {
                        "id": 130431,
                        "name": "鸡泽县",
                        "pid": 130400,
                        "level": 2,
                        "text": "鸡泽县",
                        "value": 130431
                    },
                    {
                        "id": 130432,
                        "name": "广平县",
                        "pid": 130400,
                        "level": 2,
                        "text": "广平县",
                        "value": 130432
                    },
                    {
                        "id": 130433,
                        "name": "馆陶县",
                        "pid": 130400,
                        "level": 2,
                        "text": "馆陶县",
                        "value": 130433
                    },
                    {
                        "id": 130434,
                        "name": "魏县",
                        "pid": 130400,
                        "level": 2,
                        "text": "魏县",
                        "value": 130434
                    },
                    {
                        "id": 130435,
                        "name": "曲周县",
                        "pid": 130400,
                        "level": 2,
                        "text": "曲周县",
                        "value": 130435
                    },
                    {
                        "id": 130481,
                        "name": "武安市",
                        "pid": 130400,
                        "level": 2,
                        "text": "武安市",
                        "value": 130481
                    }
                ],
                "text": "邯郸市",
                "value": 130400
            },
            {
                "id": 130500,
                "name": "邢台市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 130501,
                        "name": "市辖区",
                        "pid": 130500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 130501
                    },
                    {
                        "id": 130502,
                        "name": "桥东区",
                        "pid": 130500,
                        "level": 2,
                        "text": "桥东区",
                        "value": 130502
                    },
                    {
                        "id": 130503,
                        "name": "桥西区",
                        "pid": 130500,
                        "level": 2,
                        "text": "桥西区",
                        "value": 130503
                    },
                    {
                        "id": 130521,
                        "name": "邢台县",
                        "pid": 130500,
                        "level": 2,
                        "text": "邢台县",
                        "value": 130521
                    },
                    {
                        "id": 130522,
                        "name": "临城县",
                        "pid": 130500,
                        "level": 2,
                        "text": "临城县",
                        "value": 130522
                    },
                    {
                        "id": 130523,
                        "name": "内丘县",
                        "pid": 130500,
                        "level": 2,
                        "text": "内丘县",
                        "value": 130523
                    },
                    {
                        "id": 130524,
                        "name": "柏乡县",
                        "pid": 130500,
                        "level": 2,
                        "text": "柏乡县",
                        "value": 130524
                    },
                    {
                        "id": 130525,
                        "name": "隆尧县",
                        "pid": 130500,
                        "level": 2,
                        "text": "隆尧县",
                        "value": 130525
                    },
                    {
                        "id": 130526,
                        "name": "任县",
                        "pid": 130500,
                        "level": 2,
                        "text": "任县",
                        "value": 130526
                    },
                    {
                        "id": 130527,
                        "name": "南和县",
                        "pid": 130500,
                        "level": 2,
                        "text": "南和县",
                        "value": 130527
                    },
                    {
                        "id": 130528,
                        "name": "宁晋县",
                        "pid": 130500,
                        "level": 2,
                        "text": "宁晋县",
                        "value": 130528
                    },
                    {
                        "id": 130529,
                        "name": "巨鹿县",
                        "pid": 130500,
                        "level": 2,
                        "text": "巨鹿县",
                        "value": 130529
                    },
                    {
                        "id": 130530,
                        "name": "新河县",
                        "pid": 130500,
                        "level": 2,
                        "text": "新河县",
                        "value": 130530
                    },
                    {
                        "id": 130531,
                        "name": "广宗县",
                        "pid": 130500,
                        "level": 2,
                        "text": "广宗县",
                        "value": 130531
                    },
                    {
                        "id": 130532,
                        "name": "平乡县",
                        "pid": 130500,
                        "level": 2,
                        "text": "平乡县",
                        "value": 130532
                    },
                    {
                        "id": 130533,
                        "name": "威县",
                        "pid": 130500,
                        "level": 2,
                        "text": "威县",
                        "value": 130533
                    },
                    {
                        "id": 130534,
                        "name": "清河县",
                        "pid": 130500,
                        "level": 2,
                        "text": "清河县",
                        "value": 130534
                    },
                    {
                        "id": 130535,
                        "name": "临西县",
                        "pid": 130500,
                        "level": 2,
                        "text": "临西县",
                        "value": 130535
                    },
                    {
                        "id": 130581,
                        "name": "南宫市",
                        "pid": 130500,
                        "level": 2,
                        "text": "南宫市",
                        "value": 130581
                    },
                    {
                        "id": 130582,
                        "name": "沙河市",
                        "pid": 130500,
                        "level": 2,
                        "text": "沙河市",
                        "value": 130582
                    }
                ],
                "text": "邢台市",
                "value": 130500
            },
            {
                "id": 130600,
                "name": "保定市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 130601,
                        "name": "市辖区",
                        "pid": 130600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 130601
                    },
                    {
                        "id": 130602,
                        "name": "竞秀区",
                        "pid": 130600,
                        "level": 2,
                        "text": "竞秀区",
                        "value": 130602
                    },
                    {
                        "id": 130606,
                        "name": "莲池区",
                        "pid": 130600,
                        "level": 2,
                        "text": "莲池区",
                        "value": 130606
                    },
                    {
                        "id": 130607,
                        "name": "满城区",
                        "pid": 130600,
                        "level": 2,
                        "text": "满城区",
                        "value": 130607
                    },
                    {
                        "id": 130608,
                        "name": "清苑区",
                        "pid": 130600,
                        "level": 2,
                        "text": "清苑区",
                        "value": 130608
                    },
                    {
                        "id": 130609,
                        "name": "徐水区",
                        "pid": 130600,
                        "level": 2,
                        "text": "徐水区",
                        "value": 130609
                    },
                    {
                        "id": 130623,
                        "name": "涞水县",
                        "pid": 130600,
                        "level": 2,
                        "text": "涞水县",
                        "value": 130623
                    },
                    {
                        "id": 130624,
                        "name": "阜平县",
                        "pid": 130600,
                        "level": 2,
                        "text": "阜平县",
                        "value": 130624
                    },
                    {
                        "id": 130626,
                        "name": "定兴县",
                        "pid": 130600,
                        "level": 2,
                        "text": "定兴县",
                        "value": 130626
                    },
                    {
                        "id": 130627,
                        "name": "唐县",
                        "pid": 130600,
                        "level": 2,
                        "text": "唐县",
                        "value": 130627
                    },
                    {
                        "id": 130628,
                        "name": "高阳县",
                        "pid": 130600,
                        "level": 2,
                        "text": "高阳县",
                        "value": 130628
                    },
                    {
                        "id": 130629,
                        "name": "容城县",
                        "pid": 130600,
                        "level": 2,
                        "text": "容城县",
                        "value": 130629
                    },
                    {
                        "id": 130630,
                        "name": "涞源县",
                        "pid": 130600,
                        "level": 2,
                        "text": "涞源县",
                        "value": 130630
                    },
                    {
                        "id": 130631,
                        "name": "望都县",
                        "pid": 130600,
                        "level": 2,
                        "text": "望都县",
                        "value": 130631
                    },
                    {
                        "id": 130632,
                        "name": "安新县",
                        "pid": 130600,
                        "level": 2,
                        "text": "安新县",
                        "value": 130632
                    },
                    {
                        "id": 130633,
                        "name": "易县",
                        "pid": 130600,
                        "level": 2,
                        "text": "易县",
                        "value": 130633
                    },
                    {
                        "id": 130634,
                        "name": "曲阳县",
                        "pid": 130600,
                        "level": 2,
                        "text": "曲阳县",
                        "value": 130634
                    },
                    {
                        "id": 130635,
                        "name": "蠡县",
                        "pid": 130600,
                        "level": 2,
                        "text": "蠡县",
                        "value": 130635
                    },
                    {
                        "id": 130636,
                        "name": "顺平县",
                        "pid": 130600,
                        "level": 2,
                        "text": "顺平县",
                        "value": 130636
                    },
                    {
                        "id": 130637,
                        "name": "博野县",
                        "pid": 130600,
                        "level": 2,
                        "text": "博野县",
                        "value": 130637
                    },
                    {
                        "id": 130638,
                        "name": "雄县",
                        "pid": 130600,
                        "level": 2,
                        "text": "雄县",
                        "value": 130638
                    },
                    {
                        "id": 130681,
                        "name": "涿州市",
                        "pid": 130600,
                        "level": 2,
                        "text": "涿州市",
                        "value": 130681
                    },
                    {
                        "id": 130683,
                        "name": "安国市",
                        "pid": 130600,
                        "level": 2,
                        "text": "安国市",
                        "value": 130683
                    },
                    {
                        "id": 130684,
                        "name": "高碑店市",
                        "pid": 130600,
                        "level": 2,
                        "text": "高碑店市",
                        "value": 130684
                    }
                ],
                "text": "保定市",
                "value": 130600
            },
            {
                "id": 130700,
                "name": "张家口市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 130701,
                        "name": "市辖区",
                        "pid": 130700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 130701
                    },
                    {
                        "id": 130702,
                        "name": "桥东区",
                        "pid": 130700,
                        "level": 2,
                        "text": "桥东区",
                        "value": 130702
                    },
                    {
                        "id": 130703,
                        "name": "桥西区",
                        "pid": 130700,
                        "level": 2,
                        "text": "桥西区",
                        "value": 130703
                    },
                    {
                        "id": 130705,
                        "name": "宣化区",
                        "pid": 130700,
                        "level": 2,
                        "text": "宣化区",
                        "value": 130705
                    },
                    {
                        "id": 130706,
                        "name": "下花园区",
                        "pid": 130700,
                        "level": 2,
                        "text": "下花园区",
                        "value": 130706
                    },
                    {
                        "id": 130708,
                        "name": "万全区",
                        "pid": 130700,
                        "level": 2,
                        "text": "万全区",
                        "value": 130708
                    },
                    {
                        "id": 130709,
                        "name": "崇礼区",
                        "pid": 130700,
                        "level": 2,
                        "text": "崇礼区",
                        "value": 130709
                    },
                    {
                        "id": 130722,
                        "name": "张北县",
                        "pid": 130700,
                        "level": 2,
                        "text": "张北县",
                        "value": 130722
                    },
                    {
                        "id": 130723,
                        "name": "康保县",
                        "pid": 130700,
                        "level": 2,
                        "text": "康保县",
                        "value": 130723
                    },
                    {
                        "id": 130724,
                        "name": "沽源县",
                        "pid": 130700,
                        "level": 2,
                        "text": "沽源县",
                        "value": 130724
                    },
                    {
                        "id": 130725,
                        "name": "尚义县",
                        "pid": 130700,
                        "level": 2,
                        "text": "尚义县",
                        "value": 130725
                    },
                    {
                        "id": 130726,
                        "name": "蔚县",
                        "pid": 130700,
                        "level": 2,
                        "text": "蔚县",
                        "value": 130726
                    },
                    {
                        "id": 130727,
                        "name": "阳原县",
                        "pid": 130700,
                        "level": 2,
                        "text": "阳原县",
                        "value": 130727
                    },
                    {
                        "id": 130728,
                        "name": "怀安县",
                        "pid": 130700,
                        "level": 2,
                        "text": "怀安县",
                        "value": 130728
                    },
                    {
                        "id": 130730,
                        "name": "怀来县",
                        "pid": 130700,
                        "level": 2,
                        "text": "怀来县",
                        "value": 130730
                    },
                    {
                        "id": 130731,
                        "name": "涿鹿县",
                        "pid": 130700,
                        "level": 2,
                        "text": "涿鹿县",
                        "value": 130731
                    },
                    {
                        "id": 130732,
                        "name": "赤城县",
                        "pid": 130700,
                        "level": 2,
                        "text": "赤城县",
                        "value": 130732
                    }
                ],
                "text": "张家口市",
                "value": 130700
            },
            {
                "id": 130800,
                "name": "承德市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 130801,
                        "name": "市辖区",
                        "pid": 130800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 130801
                    },
                    {
                        "id": 130802,
                        "name": "双桥区",
                        "pid": 130800,
                        "level": 2,
                        "text": "双桥区",
                        "value": 130802
                    },
                    {
                        "id": 130803,
                        "name": "双滦区",
                        "pid": 130800,
                        "level": 2,
                        "text": "双滦区",
                        "value": 130803
                    },
                    {
                        "id": 130804,
                        "name": "鹰手营子矿区",
                        "pid": 130800,
                        "level": 2,
                        "text": "鹰手营子矿区",
                        "value": 130804
                    },
                    {
                        "id": 130821,
                        "name": "承德县",
                        "pid": 130800,
                        "level": 2,
                        "text": "承德县",
                        "value": 130821
                    },
                    {
                        "id": 130822,
                        "name": "兴隆县",
                        "pid": 130800,
                        "level": 2,
                        "text": "兴隆县",
                        "value": 130822
                    },
                    {
                        "id": 130823,
                        "name": "平泉县",
                        "pid": 130800,
                        "level": 2,
                        "text": "平泉县",
                        "value": 130823
                    },
                    {
                        "id": 130824,
                        "name": "滦平县",
                        "pid": 130800,
                        "level": 2,
                        "text": "滦平县",
                        "value": 130824
                    },
                    {
                        "id": 130825,
                        "name": "隆化县",
                        "pid": 130800,
                        "level": 2,
                        "text": "隆化县",
                        "value": 130825
                    },
                    {
                        "id": 130826,
                        "name": "丰宁满族自治县",
                        "pid": 130800,
                        "level": 2,
                        "text": "丰宁满族自治县",
                        "value": 130826
                    },
                    {
                        "id": 130827,
                        "name": "宽城满族自治县",
                        "pid": 130800,
                        "level": 2,
                        "text": "宽城满族自治县",
                        "value": 130827
                    },
                    {
                        "id": 130828,
                        "name": "围场满族蒙古族自治县",
                        "pid": 130800,
                        "level": 2,
                        "text": "围场满族蒙古族自治县",
                        "value": 130828
                    }
                ],
                "text": "承德市",
                "value": 130800
            },
            {
                "id": 130900,
                "name": "沧州市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 130901,
                        "name": "市辖区",
                        "pid": 130900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 130901
                    },
                    {
                        "id": 130902,
                        "name": "新华区",
                        "pid": 130900,
                        "level": 2,
                        "text": "新华区",
                        "value": 130902
                    },
                    {
                        "id": 130903,
                        "name": "运河区",
                        "pid": 130900,
                        "level": 2,
                        "text": "运河区",
                        "value": 130903
                    },
                    {
                        "id": 130921,
                        "name": "沧县",
                        "pid": 130900,
                        "level": 2,
                        "text": "沧县",
                        "value": 130921
                    },
                    {
                        "id": 130922,
                        "name": "青县",
                        "pid": 130900,
                        "level": 2,
                        "text": "青县",
                        "value": 130922
                    },
                    {
                        "id": 130923,
                        "name": "东光县",
                        "pid": 130900,
                        "level": 2,
                        "text": "东光县",
                        "value": 130923
                    },
                    {
                        "id": 130924,
                        "name": "海兴县",
                        "pid": 130900,
                        "level": 2,
                        "text": "海兴县",
                        "value": 130924
                    },
                    {
                        "id": 130925,
                        "name": "盐山县",
                        "pid": 130900,
                        "level": 2,
                        "text": "盐山县",
                        "value": 130925
                    },
                    {
                        "id": 130926,
                        "name": "肃宁县",
                        "pid": 130900,
                        "level": 2,
                        "text": "肃宁县",
                        "value": 130926
                    },
                    {
                        "id": 130927,
                        "name": "南皮县",
                        "pid": 130900,
                        "level": 2,
                        "text": "南皮县",
                        "value": 130927
                    },
                    {
                        "id": 130928,
                        "name": "吴桥县",
                        "pid": 130900,
                        "level": 2,
                        "text": "吴桥县",
                        "value": 130928
                    },
                    {
                        "id": 130929,
                        "name": "献县",
                        "pid": 130900,
                        "level": 2,
                        "text": "献县",
                        "value": 130929
                    },
                    {
                        "id": 130930,
                        "name": "孟村回族自治县",
                        "pid": 130900,
                        "level": 2,
                        "text": "孟村回族自治县",
                        "value": 130930
                    },
                    {
                        "id": 130981,
                        "name": "泊头市",
                        "pid": 130900,
                        "level": 2,
                        "text": "泊头市",
                        "value": 130981
                    },
                    {
                        "id": 130982,
                        "name": "任丘市",
                        "pid": 130900,
                        "level": 2,
                        "text": "任丘市",
                        "value": 130982
                    },
                    {
                        "id": 130983,
                        "name": "黄骅市",
                        "pid": 130900,
                        "level": 2,
                        "text": "黄骅市",
                        "value": 130983
                    },
                    {
                        "id": 130984,
                        "name": "河间市",
                        "pid": 130900,
                        "level": 2,
                        "text": "河间市",
                        "value": 130984
                    }
                ],
                "text": "沧州市",
                "value": 130900
            },
            {
                "id": 131000,
                "name": "廊坊市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 131001,
                        "name": "市辖区",
                        "pid": 131000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 131001
                    },
                    {
                        "id": 131002,
                        "name": "安次区",
                        "pid": 131000,
                        "level": 2,
                        "text": "安次区",
                        "value": 131002
                    },
                    {
                        "id": 131003,
                        "name": "广阳区",
                        "pid": 131000,
                        "level": 2,
                        "text": "广阳区",
                        "value": 131003
                    },
                    {
                        "id": 131022,
                        "name": "固安县",
                        "pid": 131000,
                        "level": 2,
                        "text": "固安县",
                        "value": 131022
                    },
                    {
                        "id": 131023,
                        "name": "永清县",
                        "pid": 131000,
                        "level": 2,
                        "text": "永清县",
                        "value": 131023
                    },
                    {
                        "id": 131024,
                        "name": "香河县",
                        "pid": 131000,
                        "level": 2,
                        "text": "香河县",
                        "value": 131024
                    },
                    {
                        "id": 131025,
                        "name": "大城县",
                        "pid": 131000,
                        "level": 2,
                        "text": "大城县",
                        "value": 131025
                    },
                    {
                        "id": 131026,
                        "name": "文安县",
                        "pid": 131000,
                        "level": 2,
                        "text": "文安县",
                        "value": 131026
                    },
                    {
                        "id": 131028,
                        "name": "大厂回族自治县",
                        "pid": 131000,
                        "level": 2,
                        "text": "大厂回族自治县",
                        "value": 131028
                    },
                    {
                        "id": 131081,
                        "name": "霸州市",
                        "pid": 131000,
                        "level": 2,
                        "text": "霸州市",
                        "value": 131081
                    },
                    {
                        "id": 131082,
                        "name": "三河市",
                        "pid": 131000,
                        "level": 2,
                        "text": "三河市",
                        "value": 131082
                    }
                ],
                "text": "廊坊市",
                "value": 131000
            },
            {
                "id": 131100,
                "name": "衡水市",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 131101,
                        "name": "市辖区",
                        "pid": 131100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 131101
                    },
                    {
                        "id": 131102,
                        "name": "桃城区",
                        "pid": 131100,
                        "level": 2,
                        "text": "桃城区",
                        "value": 131102
                    },
                    {
                        "id": 131103,
                        "name": "冀州区",
                        "pid": 131100,
                        "level": 2,
                        "text": "冀州区",
                        "value": 131103
                    },
                    {
                        "id": 131121,
                        "name": "枣强县",
                        "pid": 131100,
                        "level": 2,
                        "text": "枣强县",
                        "value": 131121
                    },
                    {
                        "id": 131122,
                        "name": "武邑县",
                        "pid": 131100,
                        "level": 2,
                        "text": "武邑县",
                        "value": 131122
                    },
                    {
                        "id": 131123,
                        "name": "武强县",
                        "pid": 131100,
                        "level": 2,
                        "text": "武强县",
                        "value": 131123
                    },
                    {
                        "id": 131124,
                        "name": "饶阳县",
                        "pid": 131100,
                        "level": 2,
                        "text": "饶阳县",
                        "value": 131124
                    },
                    {
                        "id": 131125,
                        "name": "安平县",
                        "pid": 131100,
                        "level": 2,
                        "text": "安平县",
                        "value": 131125
                    },
                    {
                        "id": 131126,
                        "name": "故城县",
                        "pid": 131100,
                        "level": 2,
                        "text": "故城县",
                        "value": 131126
                    },
                    {
                        "id": 131127,
                        "name": "景县",
                        "pid": 131100,
                        "level": 2,
                        "text": "景县",
                        "value": 131127
                    },
                    {
                        "id": 131128,
                        "name": "阜城县",
                        "pid": 131100,
                        "level": 2,
                        "text": "阜城县",
                        "value": 131128
                    },
                    {
                        "id": 131182,
                        "name": "深州市",
                        "pid": 131100,
                        "level": 2,
                        "text": "深州市",
                        "value": 131182
                    }
                ],
                "text": "衡水市",
                "value": 131100
            },
            {
                "id": 139000,
                "name": "省直辖县级行政区划",
                "pid": 130000,
                "level": 1,
                "children": [
                    {
                        "id": 139001,
                        "name": "定州市",
                        "pid": 139000,
                        "level": 2,
                        "text": "定州市",
                        "value": 139001
                    },
                    {
                        "id": 139002,
                        "name": "辛集市",
                        "pid": 139000,
                        "level": 2,
                        "text": "辛集市",
                        "value": 139002
                    }
                ],
                "text": "省直辖县级行政区划",
                "value": 139000
            }
        ],
        "text": "河北省",
        "value": 130000
    },
    {
        "id": 140000,
        "name": "山西省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 140100,
                "name": "太原市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 140101,
                        "name": "市辖区",
                        "pid": 140100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 140101
                    },
                    {
                        "id": 140105,
                        "name": "小店区",
                        "pid": 140100,
                        "level": 2,
                        "text": "小店区",
                        "value": 140105
                    },
                    {
                        "id": 140106,
                        "name": "迎泽区",
                        "pid": 140100,
                        "level": 2,
                        "text": "迎泽区",
                        "value": 140106
                    },
                    {
                        "id": 140107,
                        "name": "杏花岭区",
                        "pid": 140100,
                        "level": 2,
                        "text": "杏花岭区",
                        "value": 140107
                    },
                    {
                        "id": 140108,
                        "name": "尖草坪区",
                        "pid": 140100,
                        "level": 2,
                        "text": "尖草坪区",
                        "value": 140108
                    },
                    {
                        "id": 140109,
                        "name": "万柏林区",
                        "pid": 140100,
                        "level": 2,
                        "text": "万柏林区",
                        "value": 140109
                    },
                    {
                        "id": 140110,
                        "name": "晋源区",
                        "pid": 140100,
                        "level": 2,
                        "text": "晋源区",
                        "value": 140110
                    },
                    {
                        "id": 140121,
                        "name": "清徐县",
                        "pid": 140100,
                        "level": 2,
                        "text": "清徐县",
                        "value": 140121
                    },
                    {
                        "id": 140122,
                        "name": "阳曲县",
                        "pid": 140100,
                        "level": 2,
                        "text": "阳曲县",
                        "value": 140122
                    },
                    {
                        "id": 140123,
                        "name": "娄烦县",
                        "pid": 140100,
                        "level": 2,
                        "text": "娄烦县",
                        "value": 140123
                    },
                    {
                        "id": 140181,
                        "name": "古交市",
                        "pid": 140100,
                        "level": 2,
                        "text": "古交市",
                        "value": 140181
                    }
                ],
                "text": "太原市",
                "value": 140100
            },
            {
                "id": 140200,
                "name": "大同市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 140201,
                        "name": "市辖区",
                        "pid": 140200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 140201
                    },
                    {
                        "id": 140202,
                        "name": "城区",
                        "pid": 140200,
                        "level": 2,
                        "text": "城区",
                        "value": 140202
                    },
                    {
                        "id": 140203,
                        "name": "矿区",
                        "pid": 140200,
                        "level": 2,
                        "text": "矿区",
                        "value": 140203
                    },
                    {
                        "id": 140211,
                        "name": "南郊区",
                        "pid": 140200,
                        "level": 2,
                        "text": "南郊区",
                        "value": 140211
                    },
                    {
                        "id": 140212,
                        "name": "新荣区",
                        "pid": 140200,
                        "level": 2,
                        "text": "新荣区",
                        "value": 140212
                    },
                    {
                        "id": 140221,
                        "name": "阳高县",
                        "pid": 140200,
                        "level": 2,
                        "text": "阳高县",
                        "value": 140221
                    },
                    {
                        "id": 140222,
                        "name": "天镇县",
                        "pid": 140200,
                        "level": 2,
                        "text": "天镇县",
                        "value": 140222
                    },
                    {
                        "id": 140223,
                        "name": "广灵县",
                        "pid": 140200,
                        "level": 2,
                        "text": "广灵县",
                        "value": 140223
                    },
                    {
                        "id": 140224,
                        "name": "灵丘县",
                        "pid": 140200,
                        "level": 2,
                        "text": "灵丘县",
                        "value": 140224
                    },
                    {
                        "id": 140225,
                        "name": "浑源县",
                        "pid": 140200,
                        "level": 2,
                        "text": "浑源县",
                        "value": 140225
                    },
                    {
                        "id": 140226,
                        "name": "左云县",
                        "pid": 140200,
                        "level": 2,
                        "text": "左云县",
                        "value": 140226
                    },
                    {
                        "id": 140227,
                        "name": "大同县",
                        "pid": 140200,
                        "level": 2,
                        "text": "大同县",
                        "value": 140227
                    }
                ],
                "text": "大同市",
                "value": 140200
            },
            {
                "id": 140300,
                "name": "阳泉市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 140301,
                        "name": "市辖区",
                        "pid": 140300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 140301
                    },
                    {
                        "id": 140302,
                        "name": "城区",
                        "pid": 140300,
                        "level": 2,
                        "text": "城区",
                        "value": 140302
                    },
                    {
                        "id": 140303,
                        "name": "矿区",
                        "pid": 140300,
                        "level": 2,
                        "text": "矿区",
                        "value": 140303
                    },
                    {
                        "id": 140311,
                        "name": "郊区",
                        "pid": 140300,
                        "level": 2,
                        "text": "郊区",
                        "value": 140311
                    },
                    {
                        "id": 140321,
                        "name": "平定县",
                        "pid": 140300,
                        "level": 2,
                        "text": "平定县",
                        "value": 140321
                    },
                    {
                        "id": 140322,
                        "name": "盂县",
                        "pid": 140300,
                        "level": 2,
                        "text": "盂县",
                        "value": 140322
                    }
                ],
                "text": "阳泉市",
                "value": 140300
            },
            {
                "id": 140400,
                "name": "长治市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 140401,
                        "name": "市辖区",
                        "pid": 140400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 140401
                    },
                    {
                        "id": 140402,
                        "name": "城区",
                        "pid": 140400,
                        "level": 2,
                        "text": "城区",
                        "value": 140402
                    },
                    {
                        "id": 140411,
                        "name": "郊区",
                        "pid": 140400,
                        "level": 2,
                        "text": "郊区",
                        "value": 140411
                    },
                    {
                        "id": 140421,
                        "name": "长治县",
                        "pid": 140400,
                        "level": 2,
                        "text": "长治县",
                        "value": 140421
                    },
                    {
                        "id": 140423,
                        "name": "襄垣县",
                        "pid": 140400,
                        "level": 2,
                        "text": "襄垣县",
                        "value": 140423
                    },
                    {
                        "id": 140424,
                        "name": "屯留县",
                        "pid": 140400,
                        "level": 2,
                        "text": "屯留县",
                        "value": 140424
                    },
                    {
                        "id": 140425,
                        "name": "平顺县",
                        "pid": 140400,
                        "level": 2,
                        "text": "平顺县",
                        "value": 140425
                    },
                    {
                        "id": 140426,
                        "name": "黎城县",
                        "pid": 140400,
                        "level": 2,
                        "text": "黎城县",
                        "value": 140426
                    },
                    {
                        "id": 140427,
                        "name": "壶关县",
                        "pid": 140400,
                        "level": 2,
                        "text": "壶关县",
                        "value": 140427
                    },
                    {
                        "id": 140428,
                        "name": "长子县",
                        "pid": 140400,
                        "level": 2,
                        "text": "长子县",
                        "value": 140428
                    },
                    {
                        "id": 140429,
                        "name": "武乡县",
                        "pid": 140400,
                        "level": 2,
                        "text": "武乡县",
                        "value": 140429
                    },
                    {
                        "id": 140430,
                        "name": "沁县",
                        "pid": 140400,
                        "level": 2,
                        "text": "沁县",
                        "value": 140430
                    },
                    {
                        "id": 140431,
                        "name": "沁源县",
                        "pid": 140400,
                        "level": 2,
                        "text": "沁源县",
                        "value": 140431
                    },
                    {
                        "id": 140481,
                        "name": "潞城市",
                        "pid": 140400,
                        "level": 2,
                        "text": "潞城市",
                        "value": 140481
                    }
                ],
                "text": "长治市",
                "value": 140400
            },
            {
                "id": 140500,
                "name": "晋城市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 140501,
                        "name": "市辖区",
                        "pid": 140500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 140501
                    },
                    {
                        "id": 140502,
                        "name": "城区",
                        "pid": 140500,
                        "level": 2,
                        "text": "城区",
                        "value": 140502
                    },
                    {
                        "id": 140521,
                        "name": "沁水县",
                        "pid": 140500,
                        "level": 2,
                        "text": "沁水县",
                        "value": 140521
                    },
                    {
                        "id": 140522,
                        "name": "阳城县",
                        "pid": 140500,
                        "level": 2,
                        "text": "阳城县",
                        "value": 140522
                    },
                    {
                        "id": 140524,
                        "name": "陵川县",
                        "pid": 140500,
                        "level": 2,
                        "text": "陵川县",
                        "value": 140524
                    },
                    {
                        "id": 140525,
                        "name": "泽州县",
                        "pid": 140500,
                        "level": 2,
                        "text": "泽州县",
                        "value": 140525
                    },
                    {
                        "id": 140581,
                        "name": "高平市",
                        "pid": 140500,
                        "level": 2,
                        "text": "高平市",
                        "value": 140581
                    }
                ],
                "text": "晋城市",
                "value": 140500
            },
            {
                "id": 140600,
                "name": "朔州市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 140601,
                        "name": "市辖区",
                        "pid": 140600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 140601
                    },
                    {
                        "id": 140602,
                        "name": "朔城区",
                        "pid": 140600,
                        "level": 2,
                        "text": "朔城区",
                        "value": 140602
                    },
                    {
                        "id": 140603,
                        "name": "平鲁区",
                        "pid": 140600,
                        "level": 2,
                        "text": "平鲁区",
                        "value": 140603
                    },
                    {
                        "id": 140621,
                        "name": "山阴县",
                        "pid": 140600,
                        "level": 2,
                        "text": "山阴县",
                        "value": 140621
                    },
                    {
                        "id": 140622,
                        "name": "应县",
                        "pid": 140600,
                        "level": 2,
                        "text": "应县",
                        "value": 140622
                    },
                    {
                        "id": 140623,
                        "name": "右玉县",
                        "pid": 140600,
                        "level": 2,
                        "text": "右玉县",
                        "value": 140623
                    },
                    {
                        "id": 140624,
                        "name": "怀仁县",
                        "pid": 140600,
                        "level": 2,
                        "text": "怀仁县",
                        "value": 140624
                    }
                ],
                "text": "朔州市",
                "value": 140600
            },
            {
                "id": 140700,
                "name": "晋中市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 140701,
                        "name": "市辖区",
                        "pid": 140700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 140701
                    },
                    {
                        "id": 140702,
                        "name": "榆次区",
                        "pid": 140700,
                        "level": 2,
                        "text": "榆次区",
                        "value": 140702
                    },
                    {
                        "id": 140721,
                        "name": "榆社县",
                        "pid": 140700,
                        "level": 2,
                        "text": "榆社县",
                        "value": 140721
                    },
                    {
                        "id": 140722,
                        "name": "左权县",
                        "pid": 140700,
                        "level": 2,
                        "text": "左权县",
                        "value": 140722
                    },
                    {
                        "id": 140723,
                        "name": "和顺县",
                        "pid": 140700,
                        "level": 2,
                        "text": "和顺县",
                        "value": 140723
                    },
                    {
                        "id": 140724,
                        "name": "昔阳县",
                        "pid": 140700,
                        "level": 2,
                        "text": "昔阳县",
                        "value": 140724
                    },
                    {
                        "id": 140725,
                        "name": "寿阳县",
                        "pid": 140700,
                        "level": 2,
                        "text": "寿阳县",
                        "value": 140725
                    },
                    {
                        "id": 140726,
                        "name": "太谷县",
                        "pid": 140700,
                        "level": 2,
                        "text": "太谷县",
                        "value": 140726
                    },
                    {
                        "id": 140727,
                        "name": "祁县",
                        "pid": 140700,
                        "level": 2,
                        "text": "祁县",
                        "value": 140727
                    },
                    {
                        "id": 140728,
                        "name": "平遥县",
                        "pid": 140700,
                        "level": 2,
                        "text": "平遥县",
                        "value": 140728
                    },
                    {
                        "id": 140729,
                        "name": "灵石县",
                        "pid": 140700,
                        "level": 2,
                        "text": "灵石县",
                        "value": 140729
                    },
                    {
                        "id": 140781,
                        "name": "介休市",
                        "pid": 140700,
                        "level": 2,
                        "text": "介休市",
                        "value": 140781
                    }
                ],
                "text": "晋中市",
                "value": 140700
            },
            {
                "id": 140800,
                "name": "运城市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 140801,
                        "name": "市辖区",
                        "pid": 140800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 140801
                    },
                    {
                        "id": 140802,
                        "name": "盐湖区",
                        "pid": 140800,
                        "level": 2,
                        "text": "盐湖区",
                        "value": 140802
                    },
                    {
                        "id": 140821,
                        "name": "临猗县",
                        "pid": 140800,
                        "level": 2,
                        "text": "临猗县",
                        "value": 140821
                    },
                    {
                        "id": 140822,
                        "name": "万荣县",
                        "pid": 140800,
                        "level": 2,
                        "text": "万荣县",
                        "value": 140822
                    },
                    {
                        "id": 140823,
                        "name": "闻喜县",
                        "pid": 140800,
                        "level": 2,
                        "text": "闻喜县",
                        "value": 140823
                    },
                    {
                        "id": 140824,
                        "name": "稷山县",
                        "pid": 140800,
                        "level": 2,
                        "text": "稷山县",
                        "value": 140824
                    },
                    {
                        "id": 140825,
                        "name": "新绛县",
                        "pid": 140800,
                        "level": 2,
                        "text": "新绛县",
                        "value": 140825
                    },
                    {
                        "id": 140826,
                        "name": "绛县",
                        "pid": 140800,
                        "level": 2,
                        "text": "绛县",
                        "value": 140826
                    },
                    {
                        "id": 140827,
                        "name": "垣曲县",
                        "pid": 140800,
                        "level": 2,
                        "text": "垣曲县",
                        "value": 140827
                    },
                    {
                        "id": 140828,
                        "name": "夏县",
                        "pid": 140800,
                        "level": 2,
                        "text": "夏县",
                        "value": 140828
                    },
                    {
                        "id": 140829,
                        "name": "平陆县",
                        "pid": 140800,
                        "level": 2,
                        "text": "平陆县",
                        "value": 140829
                    },
                    {
                        "id": 140830,
                        "name": "芮城县",
                        "pid": 140800,
                        "level": 2,
                        "text": "芮城县",
                        "value": 140830
                    },
                    {
                        "id": 140881,
                        "name": "永济市",
                        "pid": 140800,
                        "level": 2,
                        "text": "永济市",
                        "value": 140881
                    },
                    {
                        "id": 140882,
                        "name": "河津市",
                        "pid": 140800,
                        "level": 2,
                        "text": "河津市",
                        "value": 140882
                    }
                ],
                "text": "运城市",
                "value": 140800
            },
            {
                "id": 140900,
                "name": "忻州市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 140901,
                        "name": "市辖区",
                        "pid": 140900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 140901
                    },
                    {
                        "id": 140902,
                        "name": "忻府区",
                        "pid": 140900,
                        "level": 2,
                        "text": "忻府区",
                        "value": 140902
                    },
                    {
                        "id": 140921,
                        "name": "定襄县",
                        "pid": 140900,
                        "level": 2,
                        "text": "定襄县",
                        "value": 140921
                    },
                    {
                        "id": 140922,
                        "name": "五台县",
                        "pid": 140900,
                        "level": 2,
                        "text": "五台县",
                        "value": 140922
                    },
                    {
                        "id": 140923,
                        "name": "代县",
                        "pid": 140900,
                        "level": 2,
                        "text": "代县",
                        "value": 140923
                    },
                    {
                        "id": 140924,
                        "name": "繁峙县",
                        "pid": 140900,
                        "level": 2,
                        "text": "繁峙县",
                        "value": 140924
                    },
                    {
                        "id": 140925,
                        "name": "宁武县",
                        "pid": 140900,
                        "level": 2,
                        "text": "宁武县",
                        "value": 140925
                    },
                    {
                        "id": 140926,
                        "name": "静乐县",
                        "pid": 140900,
                        "level": 2,
                        "text": "静乐县",
                        "value": 140926
                    },
                    {
                        "id": 140927,
                        "name": "神池县",
                        "pid": 140900,
                        "level": 2,
                        "text": "神池县",
                        "value": 140927
                    },
                    {
                        "id": 140928,
                        "name": "五寨县",
                        "pid": 140900,
                        "level": 2,
                        "text": "五寨县",
                        "value": 140928
                    },
                    {
                        "id": 140929,
                        "name": "岢岚县",
                        "pid": 140900,
                        "level": 2,
                        "text": "岢岚县",
                        "value": 140929
                    },
                    {
                        "id": 140930,
                        "name": "河曲县",
                        "pid": 140900,
                        "level": 2,
                        "text": "河曲县",
                        "value": 140930
                    },
                    {
                        "id": 140931,
                        "name": "保德县",
                        "pid": 140900,
                        "level": 2,
                        "text": "保德县",
                        "value": 140931
                    },
                    {
                        "id": 140932,
                        "name": "偏关县",
                        "pid": 140900,
                        "level": 2,
                        "text": "偏关县",
                        "value": 140932
                    },
                    {
                        "id": 140981,
                        "name": "原平市",
                        "pid": 140900,
                        "level": 2,
                        "text": "原平市",
                        "value": 140981
                    }
                ],
                "text": "忻州市",
                "value": 140900
            },
            {
                "id": 141000,
                "name": "临汾市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 141001,
                        "name": "市辖区",
                        "pid": 141000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 141001
                    },
                    {
                        "id": 141002,
                        "name": "尧都区",
                        "pid": 141000,
                        "level": 2,
                        "text": "尧都区",
                        "value": 141002
                    },
                    {
                        "id": 141021,
                        "name": "曲沃县",
                        "pid": 141000,
                        "level": 2,
                        "text": "曲沃县",
                        "value": 141021
                    },
                    {
                        "id": 141022,
                        "name": "翼城县",
                        "pid": 141000,
                        "level": 2,
                        "text": "翼城县",
                        "value": 141022
                    },
                    {
                        "id": 141023,
                        "name": "襄汾县",
                        "pid": 141000,
                        "level": 2,
                        "text": "襄汾县",
                        "value": 141023
                    },
                    {
                        "id": 141024,
                        "name": "洪洞县",
                        "pid": 141000,
                        "level": 2,
                        "text": "洪洞县",
                        "value": 141024
                    },
                    {
                        "id": 141025,
                        "name": "古县",
                        "pid": 141000,
                        "level": 2,
                        "text": "古县",
                        "value": 141025
                    },
                    {
                        "id": 141026,
                        "name": "安泽县",
                        "pid": 141000,
                        "level": 2,
                        "text": "安泽县",
                        "value": 141026
                    },
                    {
                        "id": 141027,
                        "name": "浮山县",
                        "pid": 141000,
                        "level": 2,
                        "text": "浮山县",
                        "value": 141027
                    },
                    {
                        "id": 141028,
                        "name": "吉县",
                        "pid": 141000,
                        "level": 2,
                        "text": "吉县",
                        "value": 141028
                    },
                    {
                        "id": 141029,
                        "name": "乡宁县",
                        "pid": 141000,
                        "level": 2,
                        "text": "乡宁县",
                        "value": 141029
                    },
                    {
                        "id": 141030,
                        "name": "大宁县",
                        "pid": 141000,
                        "level": 2,
                        "text": "大宁县",
                        "value": 141030
                    },
                    {
                        "id": 141031,
                        "name": "隰县",
                        "pid": 141000,
                        "level": 2,
                        "text": "隰县",
                        "value": 141031
                    },
                    {
                        "id": 141032,
                        "name": "永和县",
                        "pid": 141000,
                        "level": 2,
                        "text": "永和县",
                        "value": 141032
                    },
                    {
                        "id": 141033,
                        "name": "蒲县",
                        "pid": 141000,
                        "level": 2,
                        "text": "蒲县",
                        "value": 141033
                    },
                    {
                        "id": 141034,
                        "name": "汾西县",
                        "pid": 141000,
                        "level": 2,
                        "text": "汾西县",
                        "value": 141034
                    },
                    {
                        "id": 141081,
                        "name": "侯马市",
                        "pid": 141000,
                        "level": 2,
                        "text": "侯马市",
                        "value": 141081
                    },
                    {
                        "id": 141082,
                        "name": "霍州市",
                        "pid": 141000,
                        "level": 2,
                        "text": "霍州市",
                        "value": 141082
                    }
                ],
                "text": "临汾市",
                "value": 141000
            },
            {
                "id": 141100,
                "name": "吕梁市",
                "pid": 140000,
                "level": 1,
                "children": [
                    {
                        "id": 141101,
                        "name": "市辖区",
                        "pid": 141100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 141101
                    },
                    {
                        "id": 141102,
                        "name": "离石区",
                        "pid": 141100,
                        "level": 2,
                        "text": "离石区",
                        "value": 141102
                    },
                    {
                        "id": 141121,
                        "name": "文水县",
                        "pid": 141100,
                        "level": 2,
                        "text": "文水县",
                        "value": 141121
                    },
                    {
                        "id": 141122,
                        "name": "交城县",
                        "pid": 141100,
                        "level": 2,
                        "text": "交城县",
                        "value": 141122
                    },
                    {
                        "id": 141123,
                        "name": "兴县",
                        "pid": 141100,
                        "level": 2,
                        "text": "兴县",
                        "value": 141123
                    },
                    {
                        "id": 141124,
                        "name": "临县",
                        "pid": 141100,
                        "level": 2,
                        "text": "临县",
                        "value": 141124
                    },
                    {
                        "id": 141125,
                        "name": "柳林县",
                        "pid": 141100,
                        "level": 2,
                        "text": "柳林县",
                        "value": 141125
                    },
                    {
                        "id": 141126,
                        "name": "石楼县",
                        "pid": 141100,
                        "level": 2,
                        "text": "石楼县",
                        "value": 141126
                    },
                    {
                        "id": 141127,
                        "name": "岚县",
                        "pid": 141100,
                        "level": 2,
                        "text": "岚县",
                        "value": 141127
                    },
                    {
                        "id": 141128,
                        "name": "方山县",
                        "pid": 141100,
                        "level": 2,
                        "text": "方山县",
                        "value": 141128
                    },
                    {
                        "id": 141129,
                        "name": "中阳县",
                        "pid": 141100,
                        "level": 2,
                        "text": "中阳县",
                        "value": 141129
                    },
                    {
                        "id": 141130,
                        "name": "交口县",
                        "pid": 141100,
                        "level": 2,
                        "text": "交口县",
                        "value": 141130
                    },
                    {
                        "id": 141181,
                        "name": "孝义市",
                        "pid": 141100,
                        "level": 2,
                        "text": "孝义市",
                        "value": 141181
                    },
                    {
                        "id": 141182,
                        "name": "汾阳市",
                        "pid": 141100,
                        "level": 2,
                        "text": "汾阳市",
                        "value": 141182
                    }
                ],
                "text": "吕梁市",
                "value": 141100
            }
        ],
        "text": "山西省",
        "value": 140000
    },
    {
        "id": 150000,
        "name": "内蒙古自治区",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 150100,
                "name": "呼和浩特市",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 150101,
                        "name": "市辖区",
                        "pid": 150100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 150101
                    },
                    {
                        "id": 150102,
                        "name": "新城区",
                        "pid": 150100,
                        "level": 2,
                        "text": "新城区",
                        "value": 150102
                    },
                    {
                        "id": 150103,
                        "name": "回民区",
                        "pid": 150100,
                        "level": 2,
                        "text": "回民区",
                        "value": 150103
                    },
                    {
                        "id": 150104,
                        "name": "玉泉区",
                        "pid": 150100,
                        "level": 2,
                        "text": "玉泉区",
                        "value": 150104
                    },
                    {
                        "id": 150105,
                        "name": "赛罕区",
                        "pid": 150100,
                        "level": 2,
                        "text": "赛罕区",
                        "value": 150105
                    },
                    {
                        "id": 150121,
                        "name": "土默特左旗",
                        "pid": 150100,
                        "level": 2,
                        "text": "土默特左旗",
                        "value": 150121
                    },
                    {
                        "id": 150122,
                        "name": "托克托县",
                        "pid": 150100,
                        "level": 2,
                        "text": "托克托县",
                        "value": 150122
                    },
                    {
                        "id": 150123,
                        "name": "和林格尔县",
                        "pid": 150100,
                        "level": 2,
                        "text": "和林格尔县",
                        "value": 150123
                    },
                    {
                        "id": 150124,
                        "name": "清水河县",
                        "pid": 150100,
                        "level": 2,
                        "text": "清水河县",
                        "value": 150124
                    },
                    {
                        "id": 150125,
                        "name": "武川县",
                        "pid": 150100,
                        "level": 2,
                        "text": "武川县",
                        "value": 150125
                    }
                ],
                "text": "呼和浩特市",
                "value": 150100
            },
            {
                "id": 150200,
                "name": "包头市",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 150201,
                        "name": "市辖区",
                        "pid": 150200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 150201
                    },
                    {
                        "id": 150202,
                        "name": "东河区",
                        "pid": 150200,
                        "level": 2,
                        "text": "东河区",
                        "value": 150202
                    },
                    {
                        "id": 150203,
                        "name": "昆都仑区",
                        "pid": 150200,
                        "level": 2,
                        "text": "昆都仑区",
                        "value": 150203
                    },
                    {
                        "id": 150204,
                        "name": "青山区",
                        "pid": 150200,
                        "level": 2,
                        "text": "青山区",
                        "value": 150204
                    },
                    {
                        "id": 150205,
                        "name": "石拐区",
                        "pid": 150200,
                        "level": 2,
                        "text": "石拐区",
                        "value": 150205
                    },
                    {
                        "id": 150206,
                        "name": "白云鄂博矿区",
                        "pid": 150200,
                        "level": 2,
                        "text": "白云鄂博矿区",
                        "value": 150206
                    },
                    {
                        "id": 150207,
                        "name": "九原区",
                        "pid": 150200,
                        "level": 2,
                        "text": "九原区",
                        "value": 150207
                    },
                    {
                        "id": 150221,
                        "name": "土默特右旗",
                        "pid": 150200,
                        "level": 2,
                        "text": "土默特右旗",
                        "value": 150221
                    },
                    {
                        "id": 150222,
                        "name": "固阳县",
                        "pid": 150200,
                        "level": 2,
                        "text": "固阳县",
                        "value": 150222
                    },
                    {
                        "id": 150223,
                        "name": "达尔罕茂明安联合旗",
                        "pid": 150200,
                        "level": 2,
                        "text": "达尔罕茂明安联合旗",
                        "value": 150223
                    }
                ],
                "text": "包头市",
                "value": 150200
            },
            {
                "id": 150300,
                "name": "乌海市",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 150301,
                        "name": "市辖区",
                        "pid": 150300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 150301
                    },
                    {
                        "id": 150302,
                        "name": "海勃湾区",
                        "pid": 150300,
                        "level": 2,
                        "text": "海勃湾区",
                        "value": 150302
                    },
                    {
                        "id": 150303,
                        "name": "海南区",
                        "pid": 150300,
                        "level": 2,
                        "text": "海南区",
                        "value": 150303
                    },
                    {
                        "id": 150304,
                        "name": "乌达区",
                        "pid": 150300,
                        "level": 2,
                        "text": "乌达区",
                        "value": 150304
                    }
                ],
                "text": "乌海市",
                "value": 150300
            },
            {
                "id": 150400,
                "name": "赤峰市",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 150401,
                        "name": "市辖区",
                        "pid": 150400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 150401
                    },
                    {
                        "id": 150402,
                        "name": "红山区",
                        "pid": 150400,
                        "level": 2,
                        "text": "红山区",
                        "value": 150402
                    },
                    {
                        "id": 150403,
                        "name": "元宝山区",
                        "pid": 150400,
                        "level": 2,
                        "text": "元宝山区",
                        "value": 150403
                    },
                    {
                        "id": 150404,
                        "name": "松山区",
                        "pid": 150400,
                        "level": 2,
                        "text": "松山区",
                        "value": 150404
                    },
                    {
                        "id": 150421,
                        "name": "阿鲁科尔沁旗",
                        "pid": 150400,
                        "level": 2,
                        "text": "阿鲁科尔沁旗",
                        "value": 150421
                    },
                    {
                        "id": 150422,
                        "name": "巴林左旗",
                        "pid": 150400,
                        "level": 2,
                        "text": "巴林左旗",
                        "value": 150422
                    },
                    {
                        "id": 150423,
                        "name": "巴林右旗",
                        "pid": 150400,
                        "level": 2,
                        "text": "巴林右旗",
                        "value": 150423
                    },
                    {
                        "id": 150424,
                        "name": "林西县",
                        "pid": 150400,
                        "level": 2,
                        "text": "林西县",
                        "value": 150424
                    },
                    {
                        "id": 150425,
                        "name": "克什克腾旗",
                        "pid": 150400,
                        "level": 2,
                        "text": "克什克腾旗",
                        "value": 150425
                    },
                    {
                        "id": 150426,
                        "name": "翁牛特旗",
                        "pid": 150400,
                        "level": 2,
                        "text": "翁牛特旗",
                        "value": 150426
                    },
                    {
                        "id": 150428,
                        "name": "喀喇沁旗",
                        "pid": 150400,
                        "level": 2,
                        "text": "喀喇沁旗",
                        "value": 150428
                    },
                    {
                        "id": 150429,
                        "name": "宁城县",
                        "pid": 150400,
                        "level": 2,
                        "text": "宁城县",
                        "value": 150429
                    },
                    {
                        "id": 150430,
                        "name": "敖汉旗",
                        "pid": 150400,
                        "level": 2,
                        "text": "敖汉旗",
                        "value": 150430
                    }
                ],
                "text": "赤峰市",
                "value": 150400
            },
            {
                "id": 150500,
                "name": "通辽市",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 150501,
                        "name": "市辖区",
                        "pid": 150500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 150501
                    },
                    {
                        "id": 150502,
                        "name": "科尔沁区",
                        "pid": 150500,
                        "level": 2,
                        "text": "科尔沁区",
                        "value": 150502
                    },
                    {
                        "id": 150521,
                        "name": "科尔沁左翼中旗",
                        "pid": 150500,
                        "level": 2,
                        "text": "科尔沁左翼中旗",
                        "value": 150521
                    },
                    {
                        "id": 150522,
                        "name": "科尔沁左翼后旗",
                        "pid": 150500,
                        "level": 2,
                        "text": "科尔沁左翼后旗",
                        "value": 150522
                    },
                    {
                        "id": 150523,
                        "name": "开鲁县",
                        "pid": 150500,
                        "level": 2,
                        "text": "开鲁县",
                        "value": 150523
                    },
                    {
                        "id": 150524,
                        "name": "库伦旗",
                        "pid": 150500,
                        "level": 2,
                        "text": "库伦旗",
                        "value": 150524
                    },
                    {
                        "id": 150525,
                        "name": "奈曼旗",
                        "pid": 150500,
                        "level": 2,
                        "text": "奈曼旗",
                        "value": 150525
                    },
                    {
                        "id": 150526,
                        "name": "扎鲁特旗",
                        "pid": 150500,
                        "level": 2,
                        "text": "扎鲁特旗",
                        "value": 150526
                    },
                    {
                        "id": 150581,
                        "name": "霍林郭勒市",
                        "pid": 150500,
                        "level": 2,
                        "text": "霍林郭勒市",
                        "value": 150581
                    }
                ],
                "text": "通辽市",
                "value": 150500
            },
            {
                "id": 150600,
                "name": "鄂尔多斯市",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 150601,
                        "name": "市辖区",
                        "pid": 150600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 150601
                    },
                    {
                        "id": 150602,
                        "name": "东胜区",
                        "pid": 150600,
                        "level": 2,
                        "text": "东胜区",
                        "value": 150602
                    },
                    {
                        "id": 150603,
                        "name": "康巴什区",
                        "pid": 150600,
                        "level": 2,
                        "text": "康巴什区",
                        "value": 150603
                    },
                    {
                        "id": 150621,
                        "name": "达拉特旗",
                        "pid": 150600,
                        "level": 2,
                        "text": "达拉特旗",
                        "value": 150621
                    },
                    {
                        "id": 150622,
                        "name": "准格尔旗",
                        "pid": 150600,
                        "level": 2,
                        "text": "准格尔旗",
                        "value": 150622
                    },
                    {
                        "id": 150623,
                        "name": "鄂托克前旗",
                        "pid": 150600,
                        "level": 2,
                        "text": "鄂托克前旗",
                        "value": 150623
                    },
                    {
                        "id": 150624,
                        "name": "鄂托克旗",
                        "pid": 150600,
                        "level": 2,
                        "text": "鄂托克旗",
                        "value": 150624
                    },
                    {
                        "id": 150625,
                        "name": "杭锦旗",
                        "pid": 150600,
                        "level": 2,
                        "text": "杭锦旗",
                        "value": 150625
                    },
                    {
                        "id": 150626,
                        "name": "乌审旗",
                        "pid": 150600,
                        "level": 2,
                        "text": "乌审旗",
                        "value": 150626
                    },
                    {
                        "id": 150627,
                        "name": "伊金霍洛旗",
                        "pid": 150600,
                        "level": 2,
                        "text": "伊金霍洛旗",
                        "value": 150627
                    }
                ],
                "text": "鄂尔多斯市",
                "value": 150600
            },
            {
                "id": 150700,
                "name": "呼伦贝尔市",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 150701,
                        "name": "市辖区",
                        "pid": 150700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 150701
                    },
                    {
                        "id": 150702,
                        "name": "海拉尔区",
                        "pid": 150700,
                        "level": 2,
                        "text": "海拉尔区",
                        "value": 150702
                    },
                    {
                        "id": 150703,
                        "name": "扎赉诺尔区",
                        "pid": 150700,
                        "level": 2,
                        "text": "扎赉诺尔区",
                        "value": 150703
                    },
                    {
                        "id": 150721,
                        "name": "阿荣旗",
                        "pid": 150700,
                        "level": 2,
                        "text": "阿荣旗",
                        "value": 150721
                    },
                    {
                        "id": 150722,
                        "name": "莫力达瓦达斡尔族自治旗",
                        "pid": 150700,
                        "level": 2,
                        "text": "莫力达瓦达斡尔族自治旗",
                        "value": 150722
                    },
                    {
                        "id": 150723,
                        "name": "鄂伦春自治旗",
                        "pid": 150700,
                        "level": 2,
                        "text": "鄂伦春自治旗",
                        "value": 150723
                    },
                    {
                        "id": 150724,
                        "name": "鄂温克族自治旗",
                        "pid": 150700,
                        "level": 2,
                        "text": "鄂温克族自治旗",
                        "value": 150724
                    },
                    {
                        "id": 150725,
                        "name": "陈巴尔虎旗",
                        "pid": 150700,
                        "level": 2,
                        "text": "陈巴尔虎旗",
                        "value": 150725
                    },
                    {
                        "id": 150726,
                        "name": "新巴尔虎左旗",
                        "pid": 150700,
                        "level": 2,
                        "text": "新巴尔虎左旗",
                        "value": 150726
                    },
                    {
                        "id": 150727,
                        "name": "新巴尔虎右旗",
                        "pid": 150700,
                        "level": 2,
                        "text": "新巴尔虎右旗",
                        "value": 150727
                    },
                    {
                        "id": 150781,
                        "name": "满洲里市",
                        "pid": 150700,
                        "level": 2,
                        "text": "满洲里市",
                        "value": 150781
                    },
                    {
                        "id": 150782,
                        "name": "牙克石市",
                        "pid": 150700,
                        "level": 2,
                        "text": "牙克石市",
                        "value": 150782
                    },
                    {
                        "id": 150783,
                        "name": "扎兰屯市",
                        "pid": 150700,
                        "level": 2,
                        "text": "扎兰屯市",
                        "value": 150783
                    },
                    {
                        "id": 150784,
                        "name": "额尔古纳市",
                        "pid": 150700,
                        "level": 2,
                        "text": "额尔古纳市",
                        "value": 150784
                    },
                    {
                        "id": 150785,
                        "name": "根河市",
                        "pid": 150700,
                        "level": 2,
                        "text": "根河市",
                        "value": 150785
                    }
                ],
                "text": "呼伦贝尔市",
                "value": 150700
            },
            {
                "id": 150800,
                "name": "巴彦淖尔市",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 150801,
                        "name": "市辖区",
                        "pid": 150800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 150801
                    },
                    {
                        "id": 150802,
                        "name": "临河区",
                        "pid": 150800,
                        "level": 2,
                        "text": "临河区",
                        "value": 150802
                    },
                    {
                        "id": 150821,
                        "name": "五原县",
                        "pid": 150800,
                        "level": 2,
                        "text": "五原县",
                        "value": 150821
                    },
                    {
                        "id": 150822,
                        "name": "磴口县",
                        "pid": 150800,
                        "level": 2,
                        "text": "磴口县",
                        "value": 150822
                    },
                    {
                        "id": 150823,
                        "name": "乌拉特前旗",
                        "pid": 150800,
                        "level": 2,
                        "text": "乌拉特前旗",
                        "value": 150823
                    },
                    {
                        "id": 150824,
                        "name": "乌拉特中旗",
                        "pid": 150800,
                        "level": 2,
                        "text": "乌拉特中旗",
                        "value": 150824
                    },
                    {
                        "id": 150825,
                        "name": "乌拉特后旗",
                        "pid": 150800,
                        "level": 2,
                        "text": "乌拉特后旗",
                        "value": 150825
                    },
                    {
                        "id": 150826,
                        "name": "杭锦后旗",
                        "pid": 150800,
                        "level": 2,
                        "text": "杭锦后旗",
                        "value": 150826
                    }
                ],
                "text": "巴彦淖尔市",
                "value": 150800
            },
            {
                "id": 150900,
                "name": "乌兰察布市",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 150901,
                        "name": "市辖区",
                        "pid": 150900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 150901
                    },
                    {
                        "id": 150902,
                        "name": "集宁区",
                        "pid": 150900,
                        "level": 2,
                        "text": "集宁区",
                        "value": 150902
                    },
                    {
                        "id": 150921,
                        "name": "卓资县",
                        "pid": 150900,
                        "level": 2,
                        "text": "卓资县",
                        "value": 150921
                    },
                    {
                        "id": 150922,
                        "name": "化德县",
                        "pid": 150900,
                        "level": 2,
                        "text": "化德县",
                        "value": 150922
                    },
                    {
                        "id": 150923,
                        "name": "商都县",
                        "pid": 150900,
                        "level": 2,
                        "text": "商都县",
                        "value": 150923
                    },
                    {
                        "id": 150924,
                        "name": "兴和县",
                        "pid": 150900,
                        "level": 2,
                        "text": "兴和县",
                        "value": 150924
                    },
                    {
                        "id": 150925,
                        "name": "凉城县",
                        "pid": 150900,
                        "level": 2,
                        "text": "凉城县",
                        "value": 150925
                    },
                    {
                        "id": 150926,
                        "name": "察哈尔右翼前旗",
                        "pid": 150900,
                        "level": 2,
                        "text": "察哈尔右翼前旗",
                        "value": 150926
                    },
                    {
                        "id": 150927,
                        "name": "察哈尔右翼中旗",
                        "pid": 150900,
                        "level": 2,
                        "text": "察哈尔右翼中旗",
                        "value": 150927
                    },
                    {
                        "id": 150928,
                        "name": "察哈尔右翼后旗",
                        "pid": 150900,
                        "level": 2,
                        "text": "察哈尔右翼后旗",
                        "value": 150928
                    },
                    {
                        "id": 150929,
                        "name": "四子王旗",
                        "pid": 150900,
                        "level": 2,
                        "text": "四子王旗",
                        "value": 150929
                    },
                    {
                        "id": 150981,
                        "name": "丰镇市",
                        "pid": 150900,
                        "level": 2,
                        "text": "丰镇市",
                        "value": 150981
                    }
                ],
                "text": "乌兰察布市",
                "value": 150900
            },
            {
                "id": 152200,
                "name": "兴安盟",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 152201,
                        "name": "乌兰浩特市",
                        "pid": 152200,
                        "level": 2,
                        "text": "乌兰浩特市",
                        "value": 152201
                    },
                    {
                        "id": 152202,
                        "name": "阿尔山市",
                        "pid": 152200,
                        "level": 2,
                        "text": "阿尔山市",
                        "value": 152202
                    },
                    {
                        "id": 152221,
                        "name": "科尔沁右翼前旗",
                        "pid": 152200,
                        "level": 2,
                        "text": "科尔沁右翼前旗",
                        "value": 152221
                    },
                    {
                        "id": 152222,
                        "name": "科尔沁右翼中旗",
                        "pid": 152200,
                        "level": 2,
                        "text": "科尔沁右翼中旗",
                        "value": 152222
                    },
                    {
                        "id": 152223,
                        "name": "扎赉特旗",
                        "pid": 152200,
                        "level": 2,
                        "text": "扎赉特旗",
                        "value": 152223
                    },
                    {
                        "id": 152224,
                        "name": "突泉县",
                        "pid": 152200,
                        "level": 2,
                        "text": "突泉县",
                        "value": 152224
                    }
                ],
                "text": "兴安盟",
                "value": 152200
            },
            {
                "id": 152500,
                "name": "锡林郭勒盟",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 152501,
                        "name": "二连浩特市",
                        "pid": 152500,
                        "level": 2,
                        "text": "二连浩特市",
                        "value": 152501
                    },
                    {
                        "id": 152502,
                        "name": "锡林浩特市",
                        "pid": 152500,
                        "level": 2,
                        "text": "锡林浩特市",
                        "value": 152502
                    },
                    {
                        "id": 152522,
                        "name": "阿巴嘎旗",
                        "pid": 152500,
                        "level": 2,
                        "text": "阿巴嘎旗",
                        "value": 152522
                    },
                    {
                        "id": 152523,
                        "name": "苏尼特左旗",
                        "pid": 152500,
                        "level": 2,
                        "text": "苏尼特左旗",
                        "value": 152523
                    },
                    {
                        "id": 152524,
                        "name": "苏尼特右旗",
                        "pid": 152500,
                        "level": 2,
                        "text": "苏尼特右旗",
                        "value": 152524
                    },
                    {
                        "id": 152525,
                        "name": "东乌珠穆沁旗",
                        "pid": 152500,
                        "level": 2,
                        "text": "东乌珠穆沁旗",
                        "value": 152525
                    },
                    {
                        "id": 152526,
                        "name": "西乌珠穆沁旗",
                        "pid": 152500,
                        "level": 2,
                        "text": "西乌珠穆沁旗",
                        "value": 152526
                    },
                    {
                        "id": 152527,
                        "name": "太仆寺旗",
                        "pid": 152500,
                        "level": 2,
                        "text": "太仆寺旗",
                        "value": 152527
                    },
                    {
                        "id": 152528,
                        "name": "镶黄旗",
                        "pid": 152500,
                        "level": 2,
                        "text": "镶黄旗",
                        "value": 152528
                    },
                    {
                        "id": 152529,
                        "name": "正镶白旗",
                        "pid": 152500,
                        "level": 2,
                        "text": "正镶白旗",
                        "value": 152529
                    },
                    {
                        "id": 152530,
                        "name": "正蓝旗",
                        "pid": 152500,
                        "level": 2,
                        "text": "正蓝旗",
                        "value": 152530
                    },
                    {
                        "id": 152531,
                        "name": "多伦县",
                        "pid": 152500,
                        "level": 2,
                        "text": "多伦县",
                        "value": 152531
                    }
                ],
                "text": "锡林郭勒盟",
                "value": 152500
            },
            {
                "id": 152900,
                "name": "阿拉善盟",
                "pid": 150000,
                "level": 1,
                "children": [
                    {
                        "id": 152921,
                        "name": "阿拉善左旗",
                        "pid": 152900,
                        "level": 2,
                        "text": "阿拉善左旗",
                        "value": 152921
                    },
                    {
                        "id": 152922,
                        "name": "阿拉善右旗",
                        "pid": 152900,
                        "level": 2,
                        "text": "阿拉善右旗",
                        "value": 152922
                    },
                    {
                        "id": 152923,
                        "name": "额济纳旗",
                        "pid": 152900,
                        "level": 2,
                        "text": "额济纳旗",
                        "value": 152923
                    }
                ],
                "text": "阿拉善盟",
                "value": 152900
            }
        ],
        "text": "内蒙古自治区",
        "value": 150000
    },
    {
        "id": 210000,
        "name": "辽宁省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 210100,
                "name": "沈阳市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 210101,
                        "name": "市辖区",
                        "pid": 210100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 210101
                    },
                    {
                        "id": 210102,
                        "name": "和平区",
                        "pid": 210100,
                        "level": 2,
                        "text": "和平区",
                        "value": 210102
                    },
                    {
                        "id": 210103,
                        "name": "沈河区",
                        "pid": 210100,
                        "level": 2,
                        "text": "沈河区",
                        "value": 210103
                    },
                    {
                        "id": 210104,
                        "name": "大东区",
                        "pid": 210100,
                        "level": 2,
                        "text": "大东区",
                        "value": 210104
                    },
                    {
                        "id": 210105,
                        "name": "皇姑区",
                        "pid": 210100,
                        "level": 2,
                        "text": "皇姑区",
                        "value": 210105
                    },
                    {
                        "id": 210106,
                        "name": "铁西区",
                        "pid": 210100,
                        "level": 2,
                        "text": "铁西区",
                        "value": 210106
                    },
                    {
                        "id": 210111,
                        "name": "苏家屯区",
                        "pid": 210100,
                        "level": 2,
                        "text": "苏家屯区",
                        "value": 210111
                    },
                    {
                        "id": 210112,
                        "name": "浑南区",
                        "pid": 210100,
                        "level": 2,
                        "text": "浑南区",
                        "value": 210112
                    },
                    {
                        "id": 210113,
                        "name": "沈北新区",
                        "pid": 210100,
                        "level": 2,
                        "text": "沈北新区",
                        "value": 210113
                    },
                    {
                        "id": 210114,
                        "name": "于洪区",
                        "pid": 210100,
                        "level": 2,
                        "text": "于洪区",
                        "value": 210114
                    },
                    {
                        "id": 210115,
                        "name": "辽中区",
                        "pid": 210100,
                        "level": 2,
                        "text": "辽中区",
                        "value": 210115
                    },
                    {
                        "id": 210123,
                        "name": "康平县",
                        "pid": 210100,
                        "level": 2,
                        "text": "康平县",
                        "value": 210123
                    },
                    {
                        "id": 210124,
                        "name": "法库县",
                        "pid": 210100,
                        "level": 2,
                        "text": "法库县",
                        "value": 210124
                    },
                    {
                        "id": 210181,
                        "name": "新民市",
                        "pid": 210100,
                        "level": 2,
                        "text": "新民市",
                        "value": 210181
                    }
                ],
                "text": "沈阳市",
                "value": 210100
            },
            {
                "id": 210200,
                "name": "大连市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 210201,
                        "name": "市辖区",
                        "pid": 210200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 210201
                    },
                    {
                        "id": 210202,
                        "name": "中山区",
                        "pid": 210200,
                        "level": 2,
                        "text": "中山区",
                        "value": 210202
                    },
                    {
                        "id": 210203,
                        "name": "西岗区",
                        "pid": 210200,
                        "level": 2,
                        "text": "西岗区",
                        "value": 210203
                    },
                    {
                        "id": 210204,
                        "name": "沙河口区",
                        "pid": 210200,
                        "level": 2,
                        "text": "沙河口区",
                        "value": 210204
                    },
                    {
                        "id": 210211,
                        "name": "甘井子区",
                        "pid": 210200,
                        "level": 2,
                        "text": "甘井子区",
                        "value": 210211
                    },
                    {
                        "id": 210212,
                        "name": "旅顺口区",
                        "pid": 210200,
                        "level": 2,
                        "text": "旅顺口区",
                        "value": 210212
                    },
                    {
                        "id": 210213,
                        "name": "金州区",
                        "pid": 210200,
                        "level": 2,
                        "text": "金州区",
                        "value": 210213
                    },
                    {
                        "id": 210214,
                        "name": "普兰店区",
                        "pid": 210200,
                        "level": 2,
                        "text": "普兰店区",
                        "value": 210214
                    },
                    {
                        "id": 210224,
                        "name": "长海县",
                        "pid": 210200,
                        "level": 2,
                        "text": "长海县",
                        "value": 210224
                    },
                    {
                        "id": 210281,
                        "name": "瓦房店市",
                        "pid": 210200,
                        "level": 2,
                        "text": "瓦房店市",
                        "value": 210281
                    },
                    {
                        "id": 210283,
                        "name": "庄河市",
                        "pid": 210200,
                        "level": 2,
                        "text": "庄河市",
                        "value": 210283
                    }
                ],
                "text": "大连市",
                "value": 210200
            },
            {
                "id": 210300,
                "name": "鞍山市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 210301,
                        "name": "市辖区",
                        "pid": 210300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 210301
                    },
                    {
                        "id": 210302,
                        "name": "铁东区",
                        "pid": 210300,
                        "level": 2,
                        "text": "铁东区",
                        "value": 210302
                    },
                    {
                        "id": 210303,
                        "name": "铁西区",
                        "pid": 210300,
                        "level": 2,
                        "text": "铁西区",
                        "value": 210303
                    },
                    {
                        "id": 210304,
                        "name": "立山区",
                        "pid": 210300,
                        "level": 2,
                        "text": "立山区",
                        "value": 210304
                    },
                    {
                        "id": 210311,
                        "name": "千山区",
                        "pid": 210300,
                        "level": 2,
                        "text": "千山区",
                        "value": 210311
                    },
                    {
                        "id": 210321,
                        "name": "台安县",
                        "pid": 210300,
                        "level": 2,
                        "text": "台安县",
                        "value": 210321
                    },
                    {
                        "id": 210323,
                        "name": "岫岩满族自治县",
                        "pid": 210300,
                        "level": 2,
                        "text": "岫岩满族自治县",
                        "value": 210323
                    },
                    {
                        "id": 210381,
                        "name": "海城市",
                        "pid": 210300,
                        "level": 2,
                        "text": "海城市",
                        "value": 210381
                    }
                ],
                "text": "鞍山市",
                "value": 210300
            },
            {
                "id": 210400,
                "name": "抚顺市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 210401,
                        "name": "市辖区",
                        "pid": 210400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 210401
                    },
                    {
                        "id": 210402,
                        "name": "新抚区",
                        "pid": 210400,
                        "level": 2,
                        "text": "新抚区",
                        "value": 210402
                    },
                    {
                        "id": 210403,
                        "name": "东洲区",
                        "pid": 210400,
                        "level": 2,
                        "text": "东洲区",
                        "value": 210403
                    },
                    {
                        "id": 210404,
                        "name": "望花区",
                        "pid": 210400,
                        "level": 2,
                        "text": "望花区",
                        "value": 210404
                    },
                    {
                        "id": 210411,
                        "name": "顺城区",
                        "pid": 210400,
                        "level": 2,
                        "text": "顺城区",
                        "value": 210411
                    },
                    {
                        "id": 210421,
                        "name": "抚顺县",
                        "pid": 210400,
                        "level": 2,
                        "text": "抚顺县",
                        "value": 210421
                    },
                    {
                        "id": 210422,
                        "name": "新宾满族自治县",
                        "pid": 210400,
                        "level": 2,
                        "text": "新宾满族自治县",
                        "value": 210422
                    },
                    {
                        "id": 210423,
                        "name": "清原满族自治县",
                        "pid": 210400,
                        "level": 2,
                        "text": "清原满族自治县",
                        "value": 210423
                    }
                ],
                "text": "抚顺市",
                "value": 210400
            },
            {
                "id": 210500,
                "name": "本溪市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 210501,
                        "name": "市辖区",
                        "pid": 210500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 210501
                    },
                    {
                        "id": 210502,
                        "name": "平山区",
                        "pid": 210500,
                        "level": 2,
                        "text": "平山区",
                        "value": 210502
                    },
                    {
                        "id": 210503,
                        "name": "溪湖区",
                        "pid": 210500,
                        "level": 2,
                        "text": "溪湖区",
                        "value": 210503
                    },
                    {
                        "id": 210504,
                        "name": "明山区",
                        "pid": 210500,
                        "level": 2,
                        "text": "明山区",
                        "value": 210504
                    },
                    {
                        "id": 210505,
                        "name": "南芬区",
                        "pid": 210500,
                        "level": 2,
                        "text": "南芬区",
                        "value": 210505
                    },
                    {
                        "id": 210521,
                        "name": "本溪满族自治县",
                        "pid": 210500,
                        "level": 2,
                        "text": "本溪满族自治县",
                        "value": 210521
                    },
                    {
                        "id": 210522,
                        "name": "桓仁满族自治县",
                        "pid": 210500,
                        "level": 2,
                        "text": "桓仁满族自治县",
                        "value": 210522
                    }
                ],
                "text": "本溪市",
                "value": 210500
            },
            {
                "id": 210600,
                "name": "丹东市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 210601,
                        "name": "市辖区",
                        "pid": 210600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 210601
                    },
                    {
                        "id": 210602,
                        "name": "元宝区",
                        "pid": 210600,
                        "level": 2,
                        "text": "元宝区",
                        "value": 210602
                    },
                    {
                        "id": 210603,
                        "name": "振兴区",
                        "pid": 210600,
                        "level": 2,
                        "text": "振兴区",
                        "value": 210603
                    },
                    {
                        "id": 210604,
                        "name": "振安区",
                        "pid": 210600,
                        "level": 2,
                        "text": "振安区",
                        "value": 210604
                    },
                    {
                        "id": 210624,
                        "name": "宽甸满族自治县",
                        "pid": 210600,
                        "level": 2,
                        "text": "宽甸满族自治县",
                        "value": 210624
                    },
                    {
                        "id": 210681,
                        "name": "东港市",
                        "pid": 210600,
                        "level": 2,
                        "text": "东港市",
                        "value": 210681
                    },
                    {
                        "id": 210682,
                        "name": "凤城市",
                        "pid": 210600,
                        "level": 2,
                        "text": "凤城市",
                        "value": 210682
                    }
                ],
                "text": "丹东市",
                "value": 210600
            },
            {
                "id": 210700,
                "name": "锦州市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 210701,
                        "name": "市辖区",
                        "pid": 210700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 210701
                    },
                    {
                        "id": 210702,
                        "name": "古塔区",
                        "pid": 210700,
                        "level": 2,
                        "text": "古塔区",
                        "value": 210702
                    },
                    {
                        "id": 210703,
                        "name": "凌河区",
                        "pid": 210700,
                        "level": 2,
                        "text": "凌河区",
                        "value": 210703
                    },
                    {
                        "id": 210711,
                        "name": "太和区",
                        "pid": 210700,
                        "level": 2,
                        "text": "太和区",
                        "value": 210711
                    },
                    {
                        "id": 210726,
                        "name": "黑山县",
                        "pid": 210700,
                        "level": 2,
                        "text": "黑山县",
                        "value": 210726
                    },
                    {
                        "id": 210727,
                        "name": "义县",
                        "pid": 210700,
                        "level": 2,
                        "text": "义县",
                        "value": 210727
                    },
                    {
                        "id": 210781,
                        "name": "凌海市",
                        "pid": 210700,
                        "level": 2,
                        "text": "凌海市",
                        "value": 210781
                    },
                    {
                        "id": 210782,
                        "name": "北镇市",
                        "pid": 210700,
                        "level": 2,
                        "text": "北镇市",
                        "value": 210782
                    }
                ],
                "text": "锦州市",
                "value": 210700
            },
            {
                "id": 210800,
                "name": "营口市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 210801,
                        "name": "市辖区",
                        "pid": 210800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 210801
                    },
                    {
                        "id": 210802,
                        "name": "站前区",
                        "pid": 210800,
                        "level": 2,
                        "text": "站前区",
                        "value": 210802
                    },
                    {
                        "id": 210803,
                        "name": "西市区",
                        "pid": 210800,
                        "level": 2,
                        "text": "西市区",
                        "value": 210803
                    },
                    {
                        "id": 210804,
                        "name": "鲅鱼圈区",
                        "pid": 210800,
                        "level": 2,
                        "text": "鲅鱼圈区",
                        "value": 210804
                    },
                    {
                        "id": 210811,
                        "name": "老边区",
                        "pid": 210800,
                        "level": 2,
                        "text": "老边区",
                        "value": 210811
                    },
                    {
                        "id": 210881,
                        "name": "盖州市",
                        "pid": 210800,
                        "level": 2,
                        "text": "盖州市",
                        "value": 210881
                    },
                    {
                        "id": 210882,
                        "name": "大石桥市",
                        "pid": 210800,
                        "level": 2,
                        "text": "大石桥市",
                        "value": 210882
                    }
                ],
                "text": "营口市",
                "value": 210800
            },
            {
                "id": 210900,
                "name": "阜新市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 210901,
                        "name": "市辖区",
                        "pid": 210900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 210901
                    },
                    {
                        "id": 210902,
                        "name": "海州区",
                        "pid": 210900,
                        "level": 2,
                        "text": "海州区",
                        "value": 210902
                    },
                    {
                        "id": 210903,
                        "name": "新邱区",
                        "pid": 210900,
                        "level": 2,
                        "text": "新邱区",
                        "value": 210903
                    },
                    {
                        "id": 210904,
                        "name": "太平区",
                        "pid": 210900,
                        "level": 2,
                        "text": "太平区",
                        "value": 210904
                    },
                    {
                        "id": 210905,
                        "name": "清河门区",
                        "pid": 210900,
                        "level": 2,
                        "text": "清河门区",
                        "value": 210905
                    },
                    {
                        "id": 210911,
                        "name": "细河区",
                        "pid": 210900,
                        "level": 2,
                        "text": "细河区",
                        "value": 210911
                    },
                    {
                        "id": 210921,
                        "name": "阜新蒙古族自治县",
                        "pid": 210900,
                        "level": 2,
                        "text": "阜新蒙古族自治县",
                        "value": 210921
                    },
                    {
                        "id": 210922,
                        "name": "彰武县",
                        "pid": 210900,
                        "level": 2,
                        "text": "彰武县",
                        "value": 210922
                    }
                ],
                "text": "阜新市",
                "value": 210900
            },
            {
                "id": 211000,
                "name": "辽阳市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 211001,
                        "name": "市辖区",
                        "pid": 211000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 211001
                    },
                    {
                        "id": 211002,
                        "name": "白塔区",
                        "pid": 211000,
                        "level": 2,
                        "text": "白塔区",
                        "value": 211002
                    },
                    {
                        "id": 211003,
                        "name": "文圣区",
                        "pid": 211000,
                        "level": 2,
                        "text": "文圣区",
                        "value": 211003
                    },
                    {
                        "id": 211004,
                        "name": "宏伟区",
                        "pid": 211000,
                        "level": 2,
                        "text": "宏伟区",
                        "value": 211004
                    },
                    {
                        "id": 211005,
                        "name": "弓长岭区",
                        "pid": 211000,
                        "level": 2,
                        "text": "弓长岭区",
                        "value": 211005
                    },
                    {
                        "id": 211011,
                        "name": "太子河区",
                        "pid": 211000,
                        "level": 2,
                        "text": "太子河区",
                        "value": 211011
                    },
                    {
                        "id": 211021,
                        "name": "辽阳县",
                        "pid": 211000,
                        "level": 2,
                        "text": "辽阳县",
                        "value": 211021
                    },
                    {
                        "id": 211081,
                        "name": "灯塔市",
                        "pid": 211000,
                        "level": 2,
                        "text": "灯塔市",
                        "value": 211081
                    }
                ],
                "text": "辽阳市",
                "value": 211000
            },
            {
                "id": 211100,
                "name": "盘锦市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 211101,
                        "name": "市辖区",
                        "pid": 211100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 211101
                    },
                    {
                        "id": 211102,
                        "name": "双台子区",
                        "pid": 211100,
                        "level": 2,
                        "text": "双台子区",
                        "value": 211102
                    },
                    {
                        "id": 211103,
                        "name": "兴隆台区",
                        "pid": 211100,
                        "level": 2,
                        "text": "兴隆台区",
                        "value": 211103
                    },
                    {
                        "id": 211104,
                        "name": "大洼区",
                        "pid": 211100,
                        "level": 2,
                        "text": "大洼区",
                        "value": 211104
                    },
                    {
                        "id": 211122,
                        "name": "盘山县",
                        "pid": 211100,
                        "level": 2,
                        "text": "盘山县",
                        "value": 211122
                    }
                ],
                "text": "盘锦市",
                "value": 211100
            },
            {
                "id": 211200,
                "name": "铁岭市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 211201,
                        "name": "市辖区",
                        "pid": 211200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 211201
                    },
                    {
                        "id": 211202,
                        "name": "银州区",
                        "pid": 211200,
                        "level": 2,
                        "text": "银州区",
                        "value": 211202
                    },
                    {
                        "id": 211204,
                        "name": "清河区",
                        "pid": 211200,
                        "level": 2,
                        "text": "清河区",
                        "value": 211204
                    },
                    {
                        "id": 211221,
                        "name": "铁岭县",
                        "pid": 211200,
                        "level": 2,
                        "text": "铁岭县",
                        "value": 211221
                    },
                    {
                        "id": 211223,
                        "name": "西丰县",
                        "pid": 211200,
                        "level": 2,
                        "text": "西丰县",
                        "value": 211223
                    },
                    {
                        "id": 211224,
                        "name": "昌图县",
                        "pid": 211200,
                        "level": 2,
                        "text": "昌图县",
                        "value": 211224
                    },
                    {
                        "id": 211281,
                        "name": "调兵山市",
                        "pid": 211200,
                        "level": 2,
                        "text": "调兵山市",
                        "value": 211281
                    },
                    {
                        "id": 211282,
                        "name": "开原市",
                        "pid": 211200,
                        "level": 2,
                        "text": "开原市",
                        "value": 211282
                    }
                ],
                "text": "铁岭市",
                "value": 211200
            },
            {
                "id": 211300,
                "name": "朝阳市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 211301,
                        "name": "市辖区",
                        "pid": 211300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 211301
                    },
                    {
                        "id": 211302,
                        "name": "双塔区",
                        "pid": 211300,
                        "level": 2,
                        "text": "双塔区",
                        "value": 211302
                    },
                    {
                        "id": 211303,
                        "name": "龙城区",
                        "pid": 211300,
                        "level": 2,
                        "text": "龙城区",
                        "value": 211303
                    },
                    {
                        "id": 211321,
                        "name": "朝阳县",
                        "pid": 211300,
                        "level": 2,
                        "text": "朝阳县",
                        "value": 211321
                    },
                    {
                        "id": 211322,
                        "name": "建平县",
                        "pid": 211300,
                        "level": 2,
                        "text": "建平县",
                        "value": 211322
                    },
                    {
                        "id": 211324,
                        "name": "喀喇沁左翼蒙古族自治县",
                        "pid": 211300,
                        "level": 2,
                        "text": "喀喇沁左翼蒙古族自治县",
                        "value": 211324
                    },
                    {
                        "id": 211381,
                        "name": "北票市",
                        "pid": 211300,
                        "level": 2,
                        "text": "北票市",
                        "value": 211381
                    },
                    {
                        "id": 211382,
                        "name": "凌源市",
                        "pid": 211300,
                        "level": 2,
                        "text": "凌源市",
                        "value": 211382
                    }
                ],
                "text": "朝阳市",
                "value": 211300
            },
            {
                "id": 211400,
                "name": "葫芦岛市",
                "pid": 210000,
                "level": 1,
                "children": [
                    {
                        "id": 211401,
                        "name": "市辖区",
                        "pid": 211400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 211401
                    },
                    {
                        "id": 211402,
                        "name": "连山区",
                        "pid": 211400,
                        "level": 2,
                        "text": "连山区",
                        "value": 211402
                    },
                    {
                        "id": 211403,
                        "name": "龙港区",
                        "pid": 211400,
                        "level": 2,
                        "text": "龙港区",
                        "value": 211403
                    },
                    {
                        "id": 211404,
                        "name": "南票区",
                        "pid": 211400,
                        "level": 2,
                        "text": "南票区",
                        "value": 211404
                    },
                    {
                        "id": 211421,
                        "name": "绥中县",
                        "pid": 211400,
                        "level": 2,
                        "text": "绥中县",
                        "value": 211421
                    },
                    {
                        "id": 211422,
                        "name": "建昌县",
                        "pid": 211400,
                        "level": 2,
                        "text": "建昌县",
                        "value": 211422
                    },
                    {
                        "id": 211481,
                        "name": "兴城市",
                        "pid": 211400,
                        "level": 2,
                        "text": "兴城市",
                        "value": 211481
                    }
                ],
                "text": "葫芦岛市",
                "value": 211400
            }
        ],
        "text": "辽宁省",
        "value": 210000
    },
    {
        "id": 220000,
        "name": "吉林省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 220100,
                "name": "长春市",
                "pid": 220000,
                "level": 1,
                "children": [
                    {
                        "id": 220101,
                        "name": "市辖区",
                        "pid": 220100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 220101
                    },
                    {
                        "id": 220102,
                        "name": "南关区",
                        "pid": 220100,
                        "level": 2,
                        "text": "南关区",
                        "value": 220102
                    },
                    {
                        "id": 220103,
                        "name": "宽城区",
                        "pid": 220100,
                        "level": 2,
                        "text": "宽城区",
                        "value": 220103
                    },
                    {
                        "id": 220104,
                        "name": "朝阳区",
                        "pid": 220100,
                        "level": 2,
                        "text": "朝阳区",
                        "value": 220104
                    },
                    {
                        "id": 220105,
                        "name": "二道区",
                        "pid": 220100,
                        "level": 2,
                        "text": "二道区",
                        "value": 220105
                    },
                    {
                        "id": 220106,
                        "name": "绿园区",
                        "pid": 220100,
                        "level": 2,
                        "text": "绿园区",
                        "value": 220106
                    },
                    {
                        "id": 220112,
                        "name": "双阳区",
                        "pid": 220100,
                        "level": 2,
                        "text": "双阳区",
                        "value": 220112
                    },
                    {
                        "id": 220113,
                        "name": "九台区",
                        "pid": 220100,
                        "level": 2,
                        "text": "九台区",
                        "value": 220113
                    },
                    {
                        "id": 220122,
                        "name": "农安县",
                        "pid": 220100,
                        "level": 2,
                        "text": "农安县",
                        "value": 220122
                    },
                    {
                        "id": 220182,
                        "name": "榆树市",
                        "pid": 220100,
                        "level": 2,
                        "text": "榆树市",
                        "value": 220182
                    },
                    {
                        "id": 220183,
                        "name": "德惠市",
                        "pid": 220100,
                        "level": 2,
                        "text": "德惠市",
                        "value": 220183
                    }
                ],
                "text": "长春市",
                "value": 220100
            },
            {
                "id": 220200,
                "name": "吉林市",
                "pid": 220000,
                "level": 1,
                "children": [
                    {
                        "id": 220201,
                        "name": "市辖区",
                        "pid": 220200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 220201
                    },
                    {
                        "id": 220202,
                        "name": "昌邑区",
                        "pid": 220200,
                        "level": 2,
                        "text": "昌邑区",
                        "value": 220202
                    },
                    {
                        "id": 220203,
                        "name": "龙潭区",
                        "pid": 220200,
                        "level": 2,
                        "text": "龙潭区",
                        "value": 220203
                    },
                    {
                        "id": 220204,
                        "name": "船营区",
                        "pid": 220200,
                        "level": 2,
                        "text": "船营区",
                        "value": 220204
                    },
                    {
                        "id": 220211,
                        "name": "丰满区",
                        "pid": 220200,
                        "level": 2,
                        "text": "丰满区",
                        "value": 220211
                    },
                    {
                        "id": 220221,
                        "name": "永吉县",
                        "pid": 220200,
                        "level": 2,
                        "text": "永吉县",
                        "value": 220221
                    },
                    {
                        "id": 220281,
                        "name": "蛟河市",
                        "pid": 220200,
                        "level": 2,
                        "text": "蛟河市",
                        "value": 220281
                    },
                    {
                        "id": 220282,
                        "name": "桦甸市",
                        "pid": 220200,
                        "level": 2,
                        "text": "桦甸市",
                        "value": 220282
                    },
                    {
                        "id": 220283,
                        "name": "舒兰市",
                        "pid": 220200,
                        "level": 2,
                        "text": "舒兰市",
                        "value": 220283
                    },
                    {
                        "id": 220284,
                        "name": "磐石市",
                        "pid": 220200,
                        "level": 2,
                        "text": "磐石市",
                        "value": 220284
                    }
                ],
                "text": "吉林市",
                "value": 220200
            },
            {
                "id": 220300,
                "name": "四平市",
                "pid": 220000,
                "level": 1,
                "children": [
                    {
                        "id": 220301,
                        "name": "市辖区",
                        "pid": 220300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 220301
                    },
                    {
                        "id": 220302,
                        "name": "铁西区",
                        "pid": 220300,
                        "level": 2,
                        "text": "铁西区",
                        "value": 220302
                    },
                    {
                        "id": 220303,
                        "name": "铁东区",
                        "pid": 220300,
                        "level": 2,
                        "text": "铁东区",
                        "value": 220303
                    },
                    {
                        "id": 220322,
                        "name": "梨树县",
                        "pid": 220300,
                        "level": 2,
                        "text": "梨树县",
                        "value": 220322
                    },
                    {
                        "id": 220323,
                        "name": "伊通满族自治县",
                        "pid": 220300,
                        "level": 2,
                        "text": "伊通满族自治县",
                        "value": 220323
                    },
                    {
                        "id": 220381,
                        "name": "公主岭市",
                        "pid": 220300,
                        "level": 2,
                        "text": "公主岭市",
                        "value": 220381
                    },
                    {
                        "id": 220382,
                        "name": "双辽市",
                        "pid": 220300,
                        "level": 2,
                        "text": "双辽市",
                        "value": 220382
                    }
                ],
                "text": "四平市",
                "value": 220300
            },
            {
                "id": 220400,
                "name": "辽源市",
                "pid": 220000,
                "level": 1,
                "children": [
                    {
                        "id": 220401,
                        "name": "市辖区",
                        "pid": 220400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 220401
                    },
                    {
                        "id": 220402,
                        "name": "龙山区",
                        "pid": 220400,
                        "level": 2,
                        "text": "龙山区",
                        "value": 220402
                    },
                    {
                        "id": 220403,
                        "name": "西安区",
                        "pid": 220400,
                        "level": 2,
                        "text": "西安区",
                        "value": 220403
                    },
                    {
                        "id": 220421,
                        "name": "东丰县",
                        "pid": 220400,
                        "level": 2,
                        "text": "东丰县",
                        "value": 220421
                    },
                    {
                        "id": 220422,
                        "name": "东辽县",
                        "pid": 220400,
                        "level": 2,
                        "text": "东辽县",
                        "value": 220422
                    }
                ],
                "text": "辽源市",
                "value": 220400
            },
            {
                "id": 220500,
                "name": "通化市",
                "pid": 220000,
                "level": 1,
                "children": [
                    {
                        "id": 220501,
                        "name": "市辖区",
                        "pid": 220500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 220501
                    },
                    {
                        "id": 220502,
                        "name": "东昌区",
                        "pid": 220500,
                        "level": 2,
                        "text": "东昌区",
                        "value": 220502
                    },
                    {
                        "id": 220503,
                        "name": "二道江区",
                        "pid": 220500,
                        "level": 2,
                        "text": "二道江区",
                        "value": 220503
                    },
                    {
                        "id": 220521,
                        "name": "通化县",
                        "pid": 220500,
                        "level": 2,
                        "text": "通化县",
                        "value": 220521
                    },
                    {
                        "id": 220523,
                        "name": "辉南县",
                        "pid": 220500,
                        "level": 2,
                        "text": "辉南县",
                        "value": 220523
                    },
                    {
                        "id": 220524,
                        "name": "柳河县",
                        "pid": 220500,
                        "level": 2,
                        "text": "柳河县",
                        "value": 220524
                    },
                    {
                        "id": 220581,
                        "name": "梅河口市",
                        "pid": 220500,
                        "level": 2,
                        "text": "梅河口市",
                        "value": 220581
                    },
                    {
                        "id": 220582,
                        "name": "集安市",
                        "pid": 220500,
                        "level": 2,
                        "text": "集安市",
                        "value": 220582
                    }
                ],
                "text": "通化市",
                "value": 220500
            },
            {
                "id": 220600,
                "name": "白山市",
                "pid": 220000,
                "level": 1,
                "children": [
                    {
                        "id": 220601,
                        "name": "市辖区",
                        "pid": 220600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 220601
                    },
                    {
                        "id": 220602,
                        "name": "浑江区",
                        "pid": 220600,
                        "level": 2,
                        "text": "浑江区",
                        "value": 220602
                    },
                    {
                        "id": 220605,
                        "name": "江源区",
                        "pid": 220600,
                        "level": 2,
                        "text": "江源区",
                        "value": 220605
                    },
                    {
                        "id": 220621,
                        "name": "抚松县",
                        "pid": 220600,
                        "level": 2,
                        "text": "抚松县",
                        "value": 220621
                    },
                    {
                        "id": 220622,
                        "name": "靖宇县",
                        "pid": 220600,
                        "level": 2,
                        "text": "靖宇县",
                        "value": 220622
                    },
                    {
                        "id": 220623,
                        "name": "长白朝鲜族自治县",
                        "pid": 220600,
                        "level": 2,
                        "text": "长白朝鲜族自治县",
                        "value": 220623
                    },
                    {
                        "id": 220681,
                        "name": "临江市",
                        "pid": 220600,
                        "level": 2,
                        "text": "临江市",
                        "value": 220681
                    }
                ],
                "text": "白山市",
                "value": 220600
            },
            {
                "id": 220700,
                "name": "松原市",
                "pid": 220000,
                "level": 1,
                "children": [
                    {
                        "id": 220701,
                        "name": "市辖区",
                        "pid": 220700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 220701
                    },
                    {
                        "id": 220702,
                        "name": "宁江区",
                        "pid": 220700,
                        "level": 2,
                        "text": "宁江区",
                        "value": 220702
                    },
                    {
                        "id": 220721,
                        "name": "前郭尔罗斯蒙古族自治县",
                        "pid": 220700,
                        "level": 2,
                        "text": "前郭尔罗斯蒙古族自治县",
                        "value": 220721
                    },
                    {
                        "id": 220722,
                        "name": "长岭县",
                        "pid": 220700,
                        "level": 2,
                        "text": "长岭县",
                        "value": 220722
                    },
                    {
                        "id": 220723,
                        "name": "乾安县",
                        "pid": 220700,
                        "level": 2,
                        "text": "乾安县",
                        "value": 220723
                    },
                    {
                        "id": 220781,
                        "name": "扶余市",
                        "pid": 220700,
                        "level": 2,
                        "text": "扶余市",
                        "value": 220781
                    }
                ],
                "text": "松原市",
                "value": 220700
            },
            {
                "id": 220800,
                "name": "白城市",
                "pid": 220000,
                "level": 1,
                "children": [
                    {
                        "id": 220801,
                        "name": "市辖区",
                        "pid": 220800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 220801
                    },
                    {
                        "id": 220802,
                        "name": "洮北区",
                        "pid": 220800,
                        "level": 2,
                        "text": "洮北区",
                        "value": 220802
                    },
                    {
                        "id": 220821,
                        "name": "镇赉县",
                        "pid": 220800,
                        "level": 2,
                        "text": "镇赉县",
                        "value": 220821
                    },
                    {
                        "id": 220822,
                        "name": "通榆县",
                        "pid": 220800,
                        "level": 2,
                        "text": "通榆县",
                        "value": 220822
                    },
                    {
                        "id": 220881,
                        "name": "洮南市",
                        "pid": 220800,
                        "level": 2,
                        "text": "洮南市",
                        "value": 220881
                    },
                    {
                        "id": 220882,
                        "name": "大安市",
                        "pid": 220800,
                        "level": 2,
                        "text": "大安市",
                        "value": 220882
                    }
                ],
                "text": "白城市",
                "value": 220800
            },
            {
                "id": 222400,
                "name": "延边朝鲜族自治州",
                "pid": 220000,
                "level": 1,
                "children": [
                    {
                        "id": 222401,
                        "name": "延吉市",
                        "pid": 222400,
                        "level": 2,
                        "text": "延吉市",
                        "value": 222401
                    },
                    {
                        "id": 222402,
                        "name": "图们市",
                        "pid": 222400,
                        "level": 2,
                        "text": "图们市",
                        "value": 222402
                    },
                    {
                        "id": 222403,
                        "name": "敦化市",
                        "pid": 222400,
                        "level": 2,
                        "text": "敦化市",
                        "value": 222403
                    },
                    {
                        "id": 222404,
                        "name": "珲春市",
                        "pid": 222400,
                        "level": 2,
                        "text": "珲春市",
                        "value": 222404
                    },
                    {
                        "id": 222405,
                        "name": "龙井市",
                        "pid": 222400,
                        "level": 2,
                        "text": "龙井市",
                        "value": 222405
                    },
                    {
                        "id": 222406,
                        "name": "和龙市",
                        "pid": 222400,
                        "level": 2,
                        "text": "和龙市",
                        "value": 222406
                    },
                    {
                        "id": 222424,
                        "name": "汪清县",
                        "pid": 222400,
                        "level": 2,
                        "text": "汪清县",
                        "value": 222424
                    },
                    {
                        "id": 222426,
                        "name": "安图县",
                        "pid": 222400,
                        "level": 2,
                        "text": "安图县",
                        "value": 222426
                    }
                ],
                "text": "延边朝鲜族自治州",
                "value": 222400
            }
        ],
        "text": "吉林省",
        "value": 220000
    },
    {
        "id": 230000,
        "name": "黑龙江省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 230100,
                "name": "哈尔滨市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 230101,
                        "name": "市辖区",
                        "pid": 230100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 230101
                    },
                    {
                        "id": 230102,
                        "name": "道里区",
                        "pid": 230100,
                        "level": 2,
                        "text": "道里区",
                        "value": 230102
                    },
                    {
                        "id": 230103,
                        "name": "南岗区",
                        "pid": 230100,
                        "level": 2,
                        "text": "南岗区",
                        "value": 230103
                    },
                    {
                        "id": 230104,
                        "name": "道外区",
                        "pid": 230100,
                        "level": 2,
                        "text": "道外区",
                        "value": 230104
                    },
                    {
                        "id": 230108,
                        "name": "平房区",
                        "pid": 230100,
                        "level": 2,
                        "text": "平房区",
                        "value": 230108
                    },
                    {
                        "id": 230109,
                        "name": "松北区",
                        "pid": 230100,
                        "level": 2,
                        "text": "松北区",
                        "value": 230109
                    },
                    {
                        "id": 230110,
                        "name": "香坊区",
                        "pid": 230100,
                        "level": 2,
                        "text": "香坊区",
                        "value": 230110
                    },
                    {
                        "id": 230111,
                        "name": "呼兰区",
                        "pid": 230100,
                        "level": 2,
                        "text": "呼兰区",
                        "value": 230111
                    },
                    {
                        "id": 230112,
                        "name": "阿城区",
                        "pid": 230100,
                        "level": 2,
                        "text": "阿城区",
                        "value": 230112
                    },
                    {
                        "id": 230113,
                        "name": "双城区",
                        "pid": 230100,
                        "level": 2,
                        "text": "双城区",
                        "value": 230113
                    },
                    {
                        "id": 230123,
                        "name": "依兰县",
                        "pid": 230100,
                        "level": 2,
                        "text": "依兰县",
                        "value": 230123
                    },
                    {
                        "id": 230124,
                        "name": "方正县",
                        "pid": 230100,
                        "level": 2,
                        "text": "方正县",
                        "value": 230124
                    },
                    {
                        "id": 230125,
                        "name": "宾县",
                        "pid": 230100,
                        "level": 2,
                        "text": "宾县",
                        "value": 230125
                    },
                    {
                        "id": 230126,
                        "name": "巴彦县",
                        "pid": 230100,
                        "level": 2,
                        "text": "巴彦县",
                        "value": 230126
                    },
                    {
                        "id": 230127,
                        "name": "木兰县",
                        "pid": 230100,
                        "level": 2,
                        "text": "木兰县",
                        "value": 230127
                    },
                    {
                        "id": 230128,
                        "name": "通河县",
                        "pid": 230100,
                        "level": 2,
                        "text": "通河县",
                        "value": 230128
                    },
                    {
                        "id": 230129,
                        "name": "延寿县",
                        "pid": 230100,
                        "level": 2,
                        "text": "延寿县",
                        "value": 230129
                    },
                    {
                        "id": 230183,
                        "name": "尚志市",
                        "pid": 230100,
                        "level": 2,
                        "text": "尚志市",
                        "value": 230183
                    },
                    {
                        "id": 230184,
                        "name": "五常市",
                        "pid": 230100,
                        "level": 2,
                        "text": "五常市",
                        "value": 230184
                    }
                ],
                "text": "哈尔滨市",
                "value": 230100
            },
            {
                "id": 230200,
                "name": "齐齐哈尔市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 230201,
                        "name": "市辖区",
                        "pid": 230200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 230201
                    },
                    {
                        "id": 230202,
                        "name": "龙沙区",
                        "pid": 230200,
                        "level": 2,
                        "text": "龙沙区",
                        "value": 230202
                    },
                    {
                        "id": 230203,
                        "name": "建华区",
                        "pid": 230200,
                        "level": 2,
                        "text": "建华区",
                        "value": 230203
                    },
                    {
                        "id": 230204,
                        "name": "铁锋区",
                        "pid": 230200,
                        "level": 2,
                        "text": "铁锋区",
                        "value": 230204
                    },
                    {
                        "id": 230205,
                        "name": "昂昂溪区",
                        "pid": 230200,
                        "level": 2,
                        "text": "昂昂溪区",
                        "value": 230205
                    },
                    {
                        "id": 230206,
                        "name": "富拉尔基区",
                        "pid": 230200,
                        "level": 2,
                        "text": "富拉尔基区",
                        "value": 230206
                    },
                    {
                        "id": 230207,
                        "name": "碾子山区",
                        "pid": 230200,
                        "level": 2,
                        "text": "碾子山区",
                        "value": 230207
                    },
                    {
                        "id": 230208,
                        "name": "梅里斯达斡尔族区",
                        "pid": 230200,
                        "level": 2,
                        "text": "梅里斯达斡尔族区",
                        "value": 230208
                    },
                    {
                        "id": 230221,
                        "name": "龙江县",
                        "pid": 230200,
                        "level": 2,
                        "text": "龙江县",
                        "value": 230221
                    },
                    {
                        "id": 230223,
                        "name": "依安县",
                        "pid": 230200,
                        "level": 2,
                        "text": "依安县",
                        "value": 230223
                    },
                    {
                        "id": 230224,
                        "name": "泰来县",
                        "pid": 230200,
                        "level": 2,
                        "text": "泰来县",
                        "value": 230224
                    },
                    {
                        "id": 230225,
                        "name": "甘南县",
                        "pid": 230200,
                        "level": 2,
                        "text": "甘南县",
                        "value": 230225
                    },
                    {
                        "id": 230227,
                        "name": "富裕县",
                        "pid": 230200,
                        "level": 2,
                        "text": "富裕县",
                        "value": 230227
                    },
                    {
                        "id": 230229,
                        "name": "克山县",
                        "pid": 230200,
                        "level": 2,
                        "text": "克山县",
                        "value": 230229
                    },
                    {
                        "id": 230230,
                        "name": "克东县",
                        "pid": 230200,
                        "level": 2,
                        "text": "克东县",
                        "value": 230230
                    },
                    {
                        "id": 230231,
                        "name": "拜泉县",
                        "pid": 230200,
                        "level": 2,
                        "text": "拜泉县",
                        "value": 230231
                    },
                    {
                        "id": 230281,
                        "name": "讷河市",
                        "pid": 230200,
                        "level": 2,
                        "text": "讷河市",
                        "value": 230281
                    }
                ],
                "text": "齐齐哈尔市",
                "value": 230200
            },
            {
                "id": 230300,
                "name": "鸡西市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 230301,
                        "name": "市辖区",
                        "pid": 230300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 230301
                    },
                    {
                        "id": 230302,
                        "name": "鸡冠区",
                        "pid": 230300,
                        "level": 2,
                        "text": "鸡冠区",
                        "value": 230302
                    },
                    {
                        "id": 230303,
                        "name": "恒山区",
                        "pid": 230300,
                        "level": 2,
                        "text": "恒山区",
                        "value": 230303
                    },
                    {
                        "id": 230304,
                        "name": "滴道区",
                        "pid": 230300,
                        "level": 2,
                        "text": "滴道区",
                        "value": 230304
                    },
                    {
                        "id": 230305,
                        "name": "梨树区",
                        "pid": 230300,
                        "level": 2,
                        "text": "梨树区",
                        "value": 230305
                    },
                    {
                        "id": 230306,
                        "name": "城子河区",
                        "pid": 230300,
                        "level": 2,
                        "text": "城子河区",
                        "value": 230306
                    },
                    {
                        "id": 230307,
                        "name": "麻山区",
                        "pid": 230300,
                        "level": 2,
                        "text": "麻山区",
                        "value": 230307
                    },
                    {
                        "id": 230321,
                        "name": "鸡东县",
                        "pid": 230300,
                        "level": 2,
                        "text": "鸡东县",
                        "value": 230321
                    },
                    {
                        "id": 230381,
                        "name": "虎林市",
                        "pid": 230300,
                        "level": 2,
                        "text": "虎林市",
                        "value": 230381
                    },
                    {
                        "id": 230382,
                        "name": "密山市",
                        "pid": 230300,
                        "level": 2,
                        "text": "密山市",
                        "value": 230382
                    }
                ],
                "text": "鸡西市",
                "value": 230300
            },
            {
                "id": 230400,
                "name": "鹤岗市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 230401,
                        "name": "市辖区",
                        "pid": 230400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 230401
                    },
                    {
                        "id": 230402,
                        "name": "向阳区",
                        "pid": 230400,
                        "level": 2,
                        "text": "向阳区",
                        "value": 230402
                    },
                    {
                        "id": 230403,
                        "name": "工农区",
                        "pid": 230400,
                        "level": 2,
                        "text": "工农区",
                        "value": 230403
                    },
                    {
                        "id": 230404,
                        "name": "南山区",
                        "pid": 230400,
                        "level": 2,
                        "text": "南山区",
                        "value": 230404
                    },
                    {
                        "id": 230405,
                        "name": "兴安区",
                        "pid": 230400,
                        "level": 2,
                        "text": "兴安区",
                        "value": 230405
                    },
                    {
                        "id": 230406,
                        "name": "东山区",
                        "pid": 230400,
                        "level": 2,
                        "text": "东山区",
                        "value": 230406
                    },
                    {
                        "id": 230407,
                        "name": "兴山区",
                        "pid": 230400,
                        "level": 2,
                        "text": "兴山区",
                        "value": 230407
                    },
                    {
                        "id": 230421,
                        "name": "萝北县",
                        "pid": 230400,
                        "level": 2,
                        "text": "萝北县",
                        "value": 230421
                    },
                    {
                        "id": 230422,
                        "name": "绥滨县",
                        "pid": 230400,
                        "level": 2,
                        "text": "绥滨县",
                        "value": 230422
                    }
                ],
                "text": "鹤岗市",
                "value": 230400
            },
            {
                "id": 230500,
                "name": "双鸭山市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 230501,
                        "name": "市辖区",
                        "pid": 230500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 230501
                    },
                    {
                        "id": 230502,
                        "name": "尖山区",
                        "pid": 230500,
                        "level": 2,
                        "text": "尖山区",
                        "value": 230502
                    },
                    {
                        "id": 230503,
                        "name": "岭东区",
                        "pid": 230500,
                        "level": 2,
                        "text": "岭东区",
                        "value": 230503
                    },
                    {
                        "id": 230505,
                        "name": "四方台区",
                        "pid": 230500,
                        "level": 2,
                        "text": "四方台区",
                        "value": 230505
                    },
                    {
                        "id": 230506,
                        "name": "宝山区",
                        "pid": 230500,
                        "level": 2,
                        "text": "宝山区",
                        "value": 230506
                    },
                    {
                        "id": 230521,
                        "name": "集贤县",
                        "pid": 230500,
                        "level": 2,
                        "text": "集贤县",
                        "value": 230521
                    },
                    {
                        "id": 230522,
                        "name": "友谊县",
                        "pid": 230500,
                        "level": 2,
                        "text": "友谊县",
                        "value": 230522
                    },
                    {
                        "id": 230523,
                        "name": "宝清县",
                        "pid": 230500,
                        "level": 2,
                        "text": "宝清县",
                        "value": 230523
                    },
                    {
                        "id": 230524,
                        "name": "饶河县",
                        "pid": 230500,
                        "level": 2,
                        "text": "饶河县",
                        "value": 230524
                    }
                ],
                "text": "双鸭山市",
                "value": 230500
            },
            {
                "id": 230600,
                "name": "大庆市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 230601,
                        "name": "市辖区",
                        "pid": 230600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 230601
                    },
                    {
                        "id": 230602,
                        "name": "萨尔图区",
                        "pid": 230600,
                        "level": 2,
                        "text": "萨尔图区",
                        "value": 230602
                    },
                    {
                        "id": 230603,
                        "name": "龙凤区",
                        "pid": 230600,
                        "level": 2,
                        "text": "龙凤区",
                        "value": 230603
                    },
                    {
                        "id": 230604,
                        "name": "让胡路区",
                        "pid": 230600,
                        "level": 2,
                        "text": "让胡路区",
                        "value": 230604
                    },
                    {
                        "id": 230605,
                        "name": "红岗区",
                        "pid": 230600,
                        "level": 2,
                        "text": "红岗区",
                        "value": 230605
                    },
                    {
                        "id": 230606,
                        "name": "大同区",
                        "pid": 230600,
                        "level": 2,
                        "text": "大同区",
                        "value": 230606
                    },
                    {
                        "id": 230621,
                        "name": "肇州县",
                        "pid": 230600,
                        "level": 2,
                        "text": "肇州县",
                        "value": 230621
                    },
                    {
                        "id": 230622,
                        "name": "肇源县",
                        "pid": 230600,
                        "level": 2,
                        "text": "肇源县",
                        "value": 230622
                    },
                    {
                        "id": 230623,
                        "name": "林甸县",
                        "pid": 230600,
                        "level": 2,
                        "text": "林甸县",
                        "value": 230623
                    },
                    {
                        "id": 230624,
                        "name": "杜尔伯特蒙古族自治县",
                        "pid": 230600,
                        "level": 2,
                        "text": "杜尔伯特蒙古族自治县",
                        "value": 230624
                    }
                ],
                "text": "大庆市",
                "value": 230600
            },
            {
                "id": 230700,
                "name": "伊春市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 230701,
                        "name": "市辖区",
                        "pid": 230700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 230701
                    },
                    {
                        "id": 230702,
                        "name": "伊春区",
                        "pid": 230700,
                        "level": 2,
                        "text": "伊春区",
                        "value": 230702
                    },
                    {
                        "id": 230703,
                        "name": "南岔区",
                        "pid": 230700,
                        "level": 2,
                        "text": "南岔区",
                        "value": 230703
                    },
                    {
                        "id": 230704,
                        "name": "友好区",
                        "pid": 230700,
                        "level": 2,
                        "text": "友好区",
                        "value": 230704
                    },
                    {
                        "id": 230705,
                        "name": "西林区",
                        "pid": 230700,
                        "level": 2,
                        "text": "西林区",
                        "value": 230705
                    },
                    {
                        "id": 230706,
                        "name": "翠峦区",
                        "pid": 230700,
                        "level": 2,
                        "text": "翠峦区",
                        "value": 230706
                    },
                    {
                        "id": 230707,
                        "name": "新青区",
                        "pid": 230700,
                        "level": 2,
                        "text": "新青区",
                        "value": 230707
                    },
                    {
                        "id": 230708,
                        "name": "美溪区",
                        "pid": 230700,
                        "level": 2,
                        "text": "美溪区",
                        "value": 230708
                    },
                    {
                        "id": 230709,
                        "name": "金山屯区",
                        "pid": 230700,
                        "level": 2,
                        "text": "金山屯区",
                        "value": 230709
                    },
                    {
                        "id": 230710,
                        "name": "五营区",
                        "pid": 230700,
                        "level": 2,
                        "text": "五营区",
                        "value": 230710
                    },
                    {
                        "id": 230711,
                        "name": "乌马河区",
                        "pid": 230700,
                        "level": 2,
                        "text": "乌马河区",
                        "value": 230711
                    },
                    {
                        "id": 230712,
                        "name": "汤旺河区",
                        "pid": 230700,
                        "level": 2,
                        "text": "汤旺河区",
                        "value": 230712
                    },
                    {
                        "id": 230713,
                        "name": "带岭区",
                        "pid": 230700,
                        "level": 2,
                        "text": "带岭区",
                        "value": 230713
                    },
                    {
                        "id": 230714,
                        "name": "乌伊岭区",
                        "pid": 230700,
                        "level": 2,
                        "text": "乌伊岭区",
                        "value": 230714
                    },
                    {
                        "id": 230715,
                        "name": "红星区",
                        "pid": 230700,
                        "level": 2,
                        "text": "红星区",
                        "value": 230715
                    },
                    {
                        "id": 230716,
                        "name": "上甘岭区",
                        "pid": 230700,
                        "level": 2,
                        "text": "上甘岭区",
                        "value": 230716
                    },
                    {
                        "id": 230722,
                        "name": "嘉荫县",
                        "pid": 230700,
                        "level": 2,
                        "text": "嘉荫县",
                        "value": 230722
                    },
                    {
                        "id": 230781,
                        "name": "铁力市",
                        "pid": 230700,
                        "level": 2,
                        "text": "铁力市",
                        "value": 230781
                    }
                ],
                "text": "伊春市",
                "value": 230700
            },
            {
                "id": 230800,
                "name": "佳木斯市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 230801,
                        "name": "市辖区",
                        "pid": 230800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 230801
                    },
                    {
                        "id": 230803,
                        "name": "向阳区",
                        "pid": 230800,
                        "level": 2,
                        "text": "向阳区",
                        "value": 230803
                    },
                    {
                        "id": 230804,
                        "name": "前进区",
                        "pid": 230800,
                        "level": 2,
                        "text": "前进区",
                        "value": 230804
                    },
                    {
                        "id": 230805,
                        "name": "东风区",
                        "pid": 230800,
                        "level": 2,
                        "text": "东风区",
                        "value": 230805
                    },
                    {
                        "id": 230811,
                        "name": "郊区",
                        "pid": 230800,
                        "level": 2,
                        "text": "郊区",
                        "value": 230811
                    },
                    {
                        "id": 230822,
                        "name": "桦南县",
                        "pid": 230800,
                        "level": 2,
                        "text": "桦南县",
                        "value": 230822
                    },
                    {
                        "id": 230826,
                        "name": "桦川县",
                        "pid": 230800,
                        "level": 2,
                        "text": "桦川县",
                        "value": 230826
                    },
                    {
                        "id": 230828,
                        "name": "汤原县",
                        "pid": 230800,
                        "level": 2,
                        "text": "汤原县",
                        "value": 230828
                    },
                    {
                        "id": 230881,
                        "name": "同江市",
                        "pid": 230800,
                        "level": 2,
                        "text": "同江市",
                        "value": 230881
                    },
                    {
                        "id": 230882,
                        "name": "富锦市",
                        "pid": 230800,
                        "level": 2,
                        "text": "富锦市",
                        "value": 230882
                    },
                    {
                        "id": 230883,
                        "name": "抚远市",
                        "pid": 230800,
                        "level": 2,
                        "text": "抚远市",
                        "value": 230883
                    }
                ],
                "text": "佳木斯市",
                "value": 230800
            },
            {
                "id": 230900,
                "name": "七台河市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 230901,
                        "name": "市辖区",
                        "pid": 230900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 230901
                    },
                    {
                        "id": 230902,
                        "name": "新兴区",
                        "pid": 230900,
                        "level": 2,
                        "text": "新兴区",
                        "value": 230902
                    },
                    {
                        "id": 230903,
                        "name": "桃山区",
                        "pid": 230900,
                        "level": 2,
                        "text": "桃山区",
                        "value": 230903
                    },
                    {
                        "id": 230904,
                        "name": "茄子河区",
                        "pid": 230900,
                        "level": 2,
                        "text": "茄子河区",
                        "value": 230904
                    },
                    {
                        "id": 230921,
                        "name": "勃利县",
                        "pid": 230900,
                        "level": 2,
                        "text": "勃利县",
                        "value": 230921
                    }
                ],
                "text": "七台河市",
                "value": 230900
            },
            {
                "id": 231000,
                "name": "牡丹江市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 231001,
                        "name": "市辖区",
                        "pid": 231000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 231001
                    },
                    {
                        "id": 231002,
                        "name": "东安区",
                        "pid": 231000,
                        "level": 2,
                        "text": "东安区",
                        "value": 231002
                    },
                    {
                        "id": 231003,
                        "name": "阳明区",
                        "pid": 231000,
                        "level": 2,
                        "text": "阳明区",
                        "value": 231003
                    },
                    {
                        "id": 231004,
                        "name": "爱民区",
                        "pid": 231000,
                        "level": 2,
                        "text": "爱民区",
                        "value": 231004
                    },
                    {
                        "id": 231005,
                        "name": "西安区",
                        "pid": 231000,
                        "level": 2,
                        "text": "西安区",
                        "value": 231005
                    },
                    {
                        "id": 231025,
                        "name": "林口县",
                        "pid": 231000,
                        "level": 2,
                        "text": "林口县",
                        "value": 231025
                    },
                    {
                        "id": 231081,
                        "name": "绥芬河市",
                        "pid": 231000,
                        "level": 2,
                        "text": "绥芬河市",
                        "value": 231081
                    },
                    {
                        "id": 231083,
                        "name": "海林市",
                        "pid": 231000,
                        "level": 2,
                        "text": "海林市",
                        "value": 231083
                    },
                    {
                        "id": 231084,
                        "name": "宁安市",
                        "pid": 231000,
                        "level": 2,
                        "text": "宁安市",
                        "value": 231084
                    },
                    {
                        "id": 231085,
                        "name": "穆棱市",
                        "pid": 231000,
                        "level": 2,
                        "text": "穆棱市",
                        "value": 231085
                    },
                    {
                        "id": 231086,
                        "name": "东宁市",
                        "pid": 231000,
                        "level": 2,
                        "text": "东宁市",
                        "value": 231086
                    }
                ],
                "text": "牡丹江市",
                "value": 231000
            },
            {
                "id": 231100,
                "name": "黑河市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 231101,
                        "name": "市辖区",
                        "pid": 231100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 231101
                    },
                    {
                        "id": 231102,
                        "name": "爱辉区",
                        "pid": 231100,
                        "level": 2,
                        "text": "爱辉区",
                        "value": 231102
                    },
                    {
                        "id": 231121,
                        "name": "嫩江县",
                        "pid": 231100,
                        "level": 2,
                        "text": "嫩江县",
                        "value": 231121
                    },
                    {
                        "id": 231123,
                        "name": "逊克县",
                        "pid": 231100,
                        "level": 2,
                        "text": "逊克县",
                        "value": 231123
                    },
                    {
                        "id": 231124,
                        "name": "孙吴县",
                        "pid": 231100,
                        "level": 2,
                        "text": "孙吴县",
                        "value": 231124
                    },
                    {
                        "id": 231181,
                        "name": "北安市",
                        "pid": 231100,
                        "level": 2,
                        "text": "北安市",
                        "value": 231181
                    },
                    {
                        "id": 231182,
                        "name": "五大连池市",
                        "pid": 231100,
                        "level": 2,
                        "text": "五大连池市",
                        "value": 231182
                    }
                ],
                "text": "黑河市",
                "value": 231100
            },
            {
                "id": 231200,
                "name": "绥化市",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 231201,
                        "name": "市辖区",
                        "pid": 231200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 231201
                    },
                    {
                        "id": 231202,
                        "name": "北林区",
                        "pid": 231200,
                        "level": 2,
                        "text": "北林区",
                        "value": 231202
                    },
                    {
                        "id": 231221,
                        "name": "望奎县",
                        "pid": 231200,
                        "level": 2,
                        "text": "望奎县",
                        "value": 231221
                    },
                    {
                        "id": 231222,
                        "name": "兰西县",
                        "pid": 231200,
                        "level": 2,
                        "text": "兰西县",
                        "value": 231222
                    },
                    {
                        "id": 231223,
                        "name": "青冈县",
                        "pid": 231200,
                        "level": 2,
                        "text": "青冈县",
                        "value": 231223
                    },
                    {
                        "id": 231224,
                        "name": "庆安县",
                        "pid": 231200,
                        "level": 2,
                        "text": "庆安县",
                        "value": 231224
                    },
                    {
                        "id": 231225,
                        "name": "明水县",
                        "pid": 231200,
                        "level": 2,
                        "text": "明水县",
                        "value": 231225
                    },
                    {
                        "id": 231226,
                        "name": "绥棱县",
                        "pid": 231200,
                        "level": 2,
                        "text": "绥棱县",
                        "value": 231226
                    },
                    {
                        "id": 231281,
                        "name": "安达市",
                        "pid": 231200,
                        "level": 2,
                        "text": "安达市",
                        "value": 231281
                    },
                    {
                        "id": 231282,
                        "name": "肇东市",
                        "pid": 231200,
                        "level": 2,
                        "text": "肇东市",
                        "value": 231282
                    },
                    {
                        "id": 231283,
                        "name": "海伦市",
                        "pid": 231200,
                        "level": 2,
                        "text": "海伦市",
                        "value": 231283
                    }
                ],
                "text": "绥化市",
                "value": 231200
            },
            {
                "id": 232700,
                "name": "大兴安岭地区",
                "pid": 230000,
                "level": 1,
                "children": [
                    {
                        "id": 232721,
                        "name": "呼玛县",
                        "pid": 232700,
                        "level": 2,
                        "text": "呼玛县",
                        "value": 232721
                    },
                    {
                        "id": 232722,
                        "name": "塔河县",
                        "pid": 232700,
                        "level": 2,
                        "text": "塔河县",
                        "value": 232722
                    },
                    {
                        "id": 232723,
                        "name": "漠河县",
                        "pid": 232700,
                        "level": 2,
                        "text": "漠河县",
                        "value": 232723
                    }
                ],
                "text": "大兴安岭地区",
                "value": 232700
            }
        ],
        "text": "黑龙江省",
        "value": 230000
    },
    {
        "id": 310000,
        "name": "上海市",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 310100,
                "name": "市辖区",
                "pid": 310000,
                "level": 1,
                "children": [
                    {
                        "id": 310101,
                        "name": "黄浦区",
                        "pid": 310100,
                        "level": 2,
                        "text": "黄浦区",
                        "value": 310101
                    },
                    {
                        "id": 310104,
                        "name": "徐汇区",
                        "pid": 310100,
                        "level": 2,
                        "text": "徐汇区",
                        "value": 310104
                    },
                    {
                        "id": 310105,
                        "name": "长宁区",
                        "pid": 310100,
                        "level": 2,
                        "text": "长宁区",
                        "value": 310105
                    },
                    {
                        "id": 310106,
                        "name": "静安区",
                        "pid": 310100,
                        "level": 2,
                        "text": "静安区",
                        "value": 310106
                    },
                    {
                        "id": 310107,
                        "name": "普陀区",
                        "pid": 310100,
                        "level": 2,
                        "text": "普陀区",
                        "value": 310107
                    },
                    {
                        "id": 310109,
                        "name": "虹口区",
                        "pid": 310100,
                        "level": 2,
                        "text": "虹口区",
                        "value": 310109
                    },
                    {
                        "id": 310110,
                        "name": "杨浦区",
                        "pid": 310100,
                        "level": 2,
                        "text": "杨浦区",
                        "value": 310110
                    },
                    {
                        "id": 310112,
                        "name": "闵行区",
                        "pid": 310100,
                        "level": 2,
                        "text": "闵行区",
                        "value": 310112
                    },
                    {
                        "id": 310113,
                        "name": "宝山区",
                        "pid": 310100,
                        "level": 2,
                        "text": "宝山区",
                        "value": 310113
                    },
                    {
                        "id": 310114,
                        "name": "嘉定区",
                        "pid": 310100,
                        "level": 2,
                        "text": "嘉定区",
                        "value": 310114
                    },
                    {
                        "id": 310115,
                        "name": "浦东新区",
                        "pid": 310100,
                        "level": 2,
                        "text": "浦东新区",
                        "value": 310115
                    },
                    {
                        "id": 310116,
                        "name": "金山区",
                        "pid": 310100,
                        "level": 2,
                        "text": "金山区",
                        "value": 310116
                    },
                    {
                        "id": 310117,
                        "name": "松江区",
                        "pid": 310100,
                        "level": 2,
                        "text": "松江区",
                        "value": 310117
                    },
                    {
                        "id": 310118,
                        "name": "青浦区",
                        "pid": 310100,
                        "level": 2,
                        "text": "青浦区",
                        "value": 310118
                    },
                    {
                        "id": 310120,
                        "name": "奉贤区",
                        "pid": 310100,
                        "level": 2,
                        "text": "奉贤区",
                        "value": 310120
                    },
                    {
                        "id": 310151,
                        "name": "崇明区",
                        "pid": 310100,
                        "level": 2,
                        "text": "崇明区",
                        "value": 310151
                    }
                ],
                "text": "市辖区",
                "value": 310100
            }
        ],
        "text": "上海市",
        "value": 310000
    },
    {
        "id": 320000,
        "name": "江苏省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 320100,
                "name": "南京市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 320101,
                        "name": "市辖区",
                        "pid": 320100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 320101
                    },
                    {
                        "id": 320102,
                        "name": "玄武区",
                        "pid": 320100,
                        "level": 2,
                        "text": "玄武区",
                        "value": 320102
                    },
                    {
                        "id": 320104,
                        "name": "秦淮区",
                        "pid": 320100,
                        "level": 2,
                        "text": "秦淮区",
                        "value": 320104
                    },
                    {
                        "id": 320105,
                        "name": "建邺区",
                        "pid": 320100,
                        "level": 2,
                        "text": "建邺区",
                        "value": 320105
                    },
                    {
                        "id": 320106,
                        "name": "鼓楼区",
                        "pid": 320100,
                        "level": 2,
                        "text": "鼓楼区",
                        "value": 320106
                    },
                    {
                        "id": 320111,
                        "name": "浦口区",
                        "pid": 320100,
                        "level": 2,
                        "text": "浦口区",
                        "value": 320111
                    },
                    {
                        "id": 320113,
                        "name": "栖霞区",
                        "pid": 320100,
                        "level": 2,
                        "text": "栖霞区",
                        "value": 320113
                    },
                    {
                        "id": 320114,
                        "name": "雨花台区",
                        "pid": 320100,
                        "level": 2,
                        "text": "雨花台区",
                        "value": 320114
                    },
                    {
                        "id": 320115,
                        "name": "江宁区",
                        "pid": 320100,
                        "level": 2,
                        "text": "江宁区",
                        "value": 320115
                    },
                    {
                        "id": 320116,
                        "name": "六合区",
                        "pid": 320100,
                        "level": 2,
                        "text": "六合区",
                        "value": 320116
                    },
                    {
                        "id": 320117,
                        "name": "溧水区",
                        "pid": 320100,
                        "level": 2,
                        "text": "溧水区",
                        "value": 320117
                    },
                    {
                        "id": 320118,
                        "name": "高淳区",
                        "pid": 320100,
                        "level": 2,
                        "text": "高淳区",
                        "value": 320118
                    }
                ],
                "text": "南京市",
                "value": 320100
            },
            {
                "id": 320200,
                "name": "无锡市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 320201,
                        "name": "市辖区",
                        "pid": 320200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 320201
                    },
                    {
                        "id": 320205,
                        "name": "锡山区",
                        "pid": 320200,
                        "level": 2,
                        "text": "锡山区",
                        "value": 320205
                    },
                    {
                        "id": 320206,
                        "name": "惠山区",
                        "pid": 320200,
                        "level": 2,
                        "text": "惠山区",
                        "value": 320206
                    },
                    {
                        "id": 320211,
                        "name": "滨湖区",
                        "pid": 320200,
                        "level": 2,
                        "text": "滨湖区",
                        "value": 320211
                    },
                    {
                        "id": 320213,
                        "name": "梁溪区",
                        "pid": 320200,
                        "level": 2,
                        "text": "梁溪区",
                        "value": 320213
                    },
                    {
                        "id": 320214,
                        "name": "新吴区",
                        "pid": 320200,
                        "level": 2,
                        "text": "新吴区",
                        "value": 320214
                    },
                    {
                        "id": 320281,
                        "name": "江阴市",
                        "pid": 320200,
                        "level": 2,
                        "text": "江阴市",
                        "value": 320281
                    },
                    {
                        "id": 320282,
                        "name": "宜兴市",
                        "pid": 320200,
                        "level": 2,
                        "text": "宜兴市",
                        "value": 320282
                    }
                ],
                "text": "无锡市",
                "value": 320200
            },
            {
                "id": 320300,
                "name": "徐州市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 320301,
                        "name": "市辖区",
                        "pid": 320300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 320301
                    },
                    {
                        "id": 320302,
                        "name": "鼓楼区",
                        "pid": 320300,
                        "level": 2,
                        "text": "鼓楼区",
                        "value": 320302
                    },
                    {
                        "id": 320303,
                        "name": "云龙区",
                        "pid": 320300,
                        "level": 2,
                        "text": "云龙区",
                        "value": 320303
                    },
                    {
                        "id": 320305,
                        "name": "贾汪区",
                        "pid": 320300,
                        "level": 2,
                        "text": "贾汪区",
                        "value": 320305
                    },
                    {
                        "id": 320311,
                        "name": "泉山区",
                        "pid": 320300,
                        "level": 2,
                        "text": "泉山区",
                        "value": 320311
                    },
                    {
                        "id": 320312,
                        "name": "铜山区",
                        "pid": 320300,
                        "level": 2,
                        "text": "铜山区",
                        "value": 320312
                    },
                    {
                        "id": 320321,
                        "name": "丰县",
                        "pid": 320300,
                        "level": 2,
                        "text": "丰县",
                        "value": 320321
                    },
                    {
                        "id": 320322,
                        "name": "沛县",
                        "pid": 320300,
                        "level": 2,
                        "text": "沛县",
                        "value": 320322
                    },
                    {
                        "id": 320324,
                        "name": "睢宁县",
                        "pid": 320300,
                        "level": 2,
                        "text": "睢宁县",
                        "value": 320324
                    },
                    {
                        "id": 320381,
                        "name": "新沂市",
                        "pid": 320300,
                        "level": 2,
                        "text": "新沂市",
                        "value": 320381
                    },
                    {
                        "id": 320382,
                        "name": "邳州市",
                        "pid": 320300,
                        "level": 2,
                        "text": "邳州市",
                        "value": 320382
                    }
                ],
                "text": "徐州市",
                "value": 320300
            },
            {
                "id": 320400,
                "name": "常州市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 320401,
                        "name": "市辖区",
                        "pid": 320400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 320401
                    },
                    {
                        "id": 320402,
                        "name": "天宁区",
                        "pid": 320400,
                        "level": 2,
                        "text": "天宁区",
                        "value": 320402
                    },
                    {
                        "id": 320404,
                        "name": "钟楼区",
                        "pid": 320400,
                        "level": 2,
                        "text": "钟楼区",
                        "value": 320404
                    },
                    {
                        "id": 320411,
                        "name": "新北区",
                        "pid": 320400,
                        "level": 2,
                        "text": "新北区",
                        "value": 320411
                    },
                    {
                        "id": 320412,
                        "name": "武进区",
                        "pid": 320400,
                        "level": 2,
                        "text": "武进区",
                        "value": 320412
                    },
                    {
                        "id": 320413,
                        "name": "金坛区",
                        "pid": 320400,
                        "level": 2,
                        "text": "金坛区",
                        "value": 320413
                    },
                    {
                        "id": 320481,
                        "name": "溧阳市",
                        "pid": 320400,
                        "level": 2,
                        "text": "溧阳市",
                        "value": 320481
                    }
                ],
                "text": "常州市",
                "value": 320400
            },
            {
                "id": 320500,
                "name": "苏州市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 320501,
                        "name": "市辖区",
                        "pid": 320500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 320501
                    },
                    {
                        "id": 320505,
                        "name": "虎丘区",
                        "pid": 320500,
                        "level": 2,
                        "text": "虎丘区",
                        "value": 320505
                    },
                    {
                        "id": 320506,
                        "name": "吴中区",
                        "pid": 320500,
                        "level": 2,
                        "text": "吴中区",
                        "value": 320506
                    },
                    {
                        "id": 320507,
                        "name": "相城区",
                        "pid": 320500,
                        "level": 2,
                        "text": "相城区",
                        "value": 320507
                    },
                    {
                        "id": 320508,
                        "name": "姑苏区",
                        "pid": 320500,
                        "level": 2,
                        "text": "姑苏区",
                        "value": 320508
                    },
                    {
                        "id": 320509,
                        "name": "吴江区",
                        "pid": 320500,
                        "level": 2,
                        "text": "吴江区",
                        "value": 320509
                    },
                    {
                        "id": 320581,
                        "name": "常熟市",
                        "pid": 320500,
                        "level": 2,
                        "text": "常熟市",
                        "value": 320581
                    },
                    {
                        "id": 320582,
                        "name": "张家港市",
                        "pid": 320500,
                        "level": 2,
                        "text": "张家港市",
                        "value": 320582
                    },
                    {
                        "id": 320583,
                        "name": "昆山市",
                        "pid": 320500,
                        "level": 2,
                        "text": "昆山市",
                        "value": 320583
                    },
                    {
                        "id": 320585,
                        "name": "太仓市",
                        "pid": 320500,
                        "level": 2,
                        "text": "太仓市",
                        "value": 320585
                    }
                ],
                "text": "苏州市",
                "value": 320500
            },
            {
                "id": 320600,
                "name": "南通市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 320601,
                        "name": "市辖区",
                        "pid": 320600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 320601
                    },
                    {
                        "id": 320602,
                        "name": "崇川区",
                        "pid": 320600,
                        "level": 2,
                        "text": "崇川区",
                        "value": 320602
                    },
                    {
                        "id": 320611,
                        "name": "港闸区",
                        "pid": 320600,
                        "level": 2,
                        "text": "港闸区",
                        "value": 320611
                    },
                    {
                        "id": 320612,
                        "name": "通州区",
                        "pid": 320600,
                        "level": 2,
                        "text": "通州区",
                        "value": 320612
                    },
                    {
                        "id": 320621,
                        "name": "海安县",
                        "pid": 320600,
                        "level": 2,
                        "text": "海安县",
                        "value": 320621
                    },
                    {
                        "id": 320623,
                        "name": "如东县",
                        "pid": 320600,
                        "level": 2,
                        "text": "如东县",
                        "value": 320623
                    },
                    {
                        "id": 320681,
                        "name": "启东市",
                        "pid": 320600,
                        "level": 2,
                        "text": "启东市",
                        "value": 320681
                    },
                    {
                        "id": 320682,
                        "name": "如皋市",
                        "pid": 320600,
                        "level": 2,
                        "text": "如皋市",
                        "value": 320682
                    },
                    {
                        "id": 320684,
                        "name": "海门市",
                        "pid": 320600,
                        "level": 2,
                        "text": "海门市",
                        "value": 320684
                    }
                ],
                "text": "南通市",
                "value": 320600
            },
            {
                "id": 320700,
                "name": "连云港市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 320701,
                        "name": "市辖区",
                        "pid": 320700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 320701
                    },
                    {
                        "id": 320703,
                        "name": "连云区",
                        "pid": 320700,
                        "level": 2,
                        "text": "连云区",
                        "value": 320703
                    },
                    {
                        "id": 320706,
                        "name": "海州区",
                        "pid": 320700,
                        "level": 2,
                        "text": "海州区",
                        "value": 320706
                    },
                    {
                        "id": 320707,
                        "name": "赣榆区",
                        "pid": 320700,
                        "level": 2,
                        "text": "赣榆区",
                        "value": 320707
                    },
                    {
                        "id": 320722,
                        "name": "东海县",
                        "pid": 320700,
                        "level": 2,
                        "text": "东海县",
                        "value": 320722
                    },
                    {
                        "id": 320723,
                        "name": "灌云县",
                        "pid": 320700,
                        "level": 2,
                        "text": "灌云县",
                        "value": 320723
                    },
                    {
                        "id": 320724,
                        "name": "灌南县",
                        "pid": 320700,
                        "level": 2,
                        "text": "灌南县",
                        "value": 320724
                    }
                ],
                "text": "连云港市",
                "value": 320700
            },
            {
                "id": 320800,
                "name": "淮安市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 320801,
                        "name": "市辖区",
                        "pid": 320800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 320801
                    },
                    {
                        "id": 320803,
                        "name": "淮安区",
                        "pid": 320800,
                        "level": 2,
                        "text": "淮安区",
                        "value": 320803
                    },
                    {
                        "id": 320804,
                        "name": "淮阴区",
                        "pid": 320800,
                        "level": 2,
                        "text": "淮阴区",
                        "value": 320804
                    },
                    {
                        "id": 320812,
                        "name": "清江浦区",
                        "pid": 320800,
                        "level": 2,
                        "text": "清江浦区",
                        "value": 320812
                    },
                    {
                        "id": 320813,
                        "name": "洪泽区",
                        "pid": 320800,
                        "level": 2,
                        "text": "洪泽区",
                        "value": 320813
                    },
                    {
                        "id": 320826,
                        "name": "涟水县",
                        "pid": 320800,
                        "level": 2,
                        "text": "涟水县",
                        "value": 320826
                    },
                    {
                        "id": 320830,
                        "name": "盱眙县",
                        "pid": 320800,
                        "level": 2,
                        "text": "盱眙县",
                        "value": 320830
                    },
                    {
                        "id": 320831,
                        "name": "金湖县",
                        "pid": 320800,
                        "level": 2,
                        "text": "金湖县",
                        "value": 320831
                    }
                ],
                "text": "淮安市",
                "value": 320800
            },
            {
                "id": 320900,
                "name": "盐城市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 320901,
                        "name": "市辖区",
                        "pid": 320900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 320901
                    },
                    {
                        "id": 320902,
                        "name": "亭湖区",
                        "pid": 320900,
                        "level": 2,
                        "text": "亭湖区",
                        "value": 320902
                    },
                    {
                        "id": 320903,
                        "name": "盐都区",
                        "pid": 320900,
                        "level": 2,
                        "text": "盐都区",
                        "value": 320903
                    },
                    {
                        "id": 320904,
                        "name": "大丰区",
                        "pid": 320900,
                        "level": 2,
                        "text": "大丰区",
                        "value": 320904
                    },
                    {
                        "id": 320921,
                        "name": "响水县",
                        "pid": 320900,
                        "level": 2,
                        "text": "响水县",
                        "value": 320921
                    },
                    {
                        "id": 320922,
                        "name": "滨海县",
                        "pid": 320900,
                        "level": 2,
                        "text": "滨海县",
                        "value": 320922
                    },
                    {
                        "id": 320923,
                        "name": "阜宁县",
                        "pid": 320900,
                        "level": 2,
                        "text": "阜宁县",
                        "value": 320923
                    },
                    {
                        "id": 320924,
                        "name": "射阳县",
                        "pid": 320900,
                        "level": 2,
                        "text": "射阳县",
                        "value": 320924
                    },
                    {
                        "id": 320925,
                        "name": "建湖县",
                        "pid": 320900,
                        "level": 2,
                        "text": "建湖县",
                        "value": 320925
                    },
                    {
                        "id": 320981,
                        "name": "东台市",
                        "pid": 320900,
                        "level": 2,
                        "text": "东台市",
                        "value": 320981
                    }
                ],
                "text": "盐城市",
                "value": 320900
            },
            {
                "id": 321000,
                "name": "扬州市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 321001,
                        "name": "市辖区",
                        "pid": 321000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 321001
                    },
                    {
                        "id": 321002,
                        "name": "广陵区",
                        "pid": 321000,
                        "level": 2,
                        "text": "广陵区",
                        "value": 321002
                    },
                    {
                        "id": 321003,
                        "name": "邗江区",
                        "pid": 321000,
                        "level": 2,
                        "text": "邗江区",
                        "value": 321003
                    },
                    {
                        "id": 321012,
                        "name": "江都区",
                        "pid": 321000,
                        "level": 2,
                        "text": "江都区",
                        "value": 321012
                    },
                    {
                        "id": 321023,
                        "name": "宝应县",
                        "pid": 321000,
                        "level": 2,
                        "text": "宝应县",
                        "value": 321023
                    },
                    {
                        "id": 321081,
                        "name": "仪征市",
                        "pid": 321000,
                        "level": 2,
                        "text": "仪征市",
                        "value": 321081
                    },
                    {
                        "id": 321084,
                        "name": "高邮市",
                        "pid": 321000,
                        "level": 2,
                        "text": "高邮市",
                        "value": 321084
                    }
                ],
                "text": "扬州市",
                "value": 321000
            },
            {
                "id": 321100,
                "name": "镇江市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 321101,
                        "name": "市辖区",
                        "pid": 321100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 321101
                    },
                    {
                        "id": 321102,
                        "name": "京口区",
                        "pid": 321100,
                        "level": 2,
                        "text": "京口区",
                        "value": 321102
                    },
                    {
                        "id": 321111,
                        "name": "润州区",
                        "pid": 321100,
                        "level": 2,
                        "text": "润州区",
                        "value": 321111
                    },
                    {
                        "id": 321112,
                        "name": "丹徒区",
                        "pid": 321100,
                        "level": 2,
                        "text": "丹徒区",
                        "value": 321112
                    },
                    {
                        "id": 321181,
                        "name": "丹阳市",
                        "pid": 321100,
                        "level": 2,
                        "text": "丹阳市",
                        "value": 321181
                    },
                    {
                        "id": 321182,
                        "name": "扬中市",
                        "pid": 321100,
                        "level": 2,
                        "text": "扬中市",
                        "value": 321182
                    },
                    {
                        "id": 321183,
                        "name": "句容市",
                        "pid": 321100,
                        "level": 2,
                        "text": "句容市",
                        "value": 321183
                    }
                ],
                "text": "镇江市",
                "value": 321100
            },
            {
                "id": 321200,
                "name": "泰州市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 321201,
                        "name": "市辖区",
                        "pid": 321200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 321201
                    },
                    {
                        "id": 321202,
                        "name": "海陵区",
                        "pid": 321200,
                        "level": 2,
                        "text": "海陵区",
                        "value": 321202
                    },
                    {
                        "id": 321203,
                        "name": "高港区",
                        "pid": 321200,
                        "level": 2,
                        "text": "高港区",
                        "value": 321203
                    },
                    {
                        "id": 321204,
                        "name": "姜堰区",
                        "pid": 321200,
                        "level": 2,
                        "text": "姜堰区",
                        "value": 321204
                    },
                    {
                        "id": 321281,
                        "name": "兴化市",
                        "pid": 321200,
                        "level": 2,
                        "text": "兴化市",
                        "value": 321281
                    },
                    {
                        "id": 321282,
                        "name": "靖江市",
                        "pid": 321200,
                        "level": 2,
                        "text": "靖江市",
                        "value": 321282
                    },
                    {
                        "id": 321283,
                        "name": "泰兴市",
                        "pid": 321200,
                        "level": 2,
                        "text": "泰兴市",
                        "value": 321283
                    }
                ],
                "text": "泰州市",
                "value": 321200
            },
            {
                "id": 321300,
                "name": "宿迁市",
                "pid": 320000,
                "level": 1,
                "children": [
                    {
                        "id": 321301,
                        "name": "市辖区",
                        "pid": 321300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 321301
                    },
                    {
                        "id": 321302,
                        "name": "宿城区",
                        "pid": 321300,
                        "level": 2,
                        "text": "宿城区",
                        "value": 321302
                    },
                    {
                        "id": 321311,
                        "name": "宿豫区",
                        "pid": 321300,
                        "level": 2,
                        "text": "宿豫区",
                        "value": 321311
                    },
                    {
                        "id": 321322,
                        "name": "沭阳县",
                        "pid": 321300,
                        "level": 2,
                        "text": "沭阳县",
                        "value": 321322
                    },
                    {
                        "id": 321323,
                        "name": "泗阳县",
                        "pid": 321300,
                        "level": 2,
                        "text": "泗阳县",
                        "value": 321323
                    },
                    {
                        "id": 321324,
                        "name": "泗洪县",
                        "pid": 321300,
                        "level": 2,
                        "text": "泗洪县",
                        "value": 321324
                    }
                ],
                "text": "宿迁市",
                "value": 321300
            }
        ],
        "text": "江苏省",
        "value": 320000
    },
    {
        "id": 330000,
        "name": "浙江省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 330100,
                "name": "杭州市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 330101,
                        "name": "市辖区",
                        "pid": 330100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 330101
                    },
                    {
                        "id": 330102,
                        "name": "上城区",
                        "pid": 330100,
                        "level": 2,
                        "text": "上城区",
                        "value": 330102
                    },
                    {
                        "id": 330103,
                        "name": "下城区",
                        "pid": 330100,
                        "level": 2,
                        "text": "下城区",
                        "value": 330103
                    },
                    {
                        "id": 330104,
                        "name": "江干区",
                        "pid": 330100,
                        "level": 2,
                        "text": "江干区",
                        "value": 330104
                    },
                    {
                        "id": 330105,
                        "name": "拱墅区",
                        "pid": 330100,
                        "level": 2,
                        "text": "拱墅区",
                        "value": 330105
                    },
                    {
                        "id": 330106,
                        "name": "西湖区",
                        "pid": 330100,
                        "level": 2,
                        "text": "西湖区",
                        "value": 330106
                    },
                    {
                        "id": 330108,
                        "name": "滨江区",
                        "pid": 330100,
                        "level": 2,
                        "text": "滨江区",
                        "value": 330108
                    },
                    {
                        "id": 330109,
                        "name": "萧山区",
                        "pid": 330100,
                        "level": 2,
                        "text": "萧山区",
                        "value": 330109
                    },
                    {
                        "id": 330110,
                        "name": "余杭区",
                        "pid": 330100,
                        "level": 2,
                        "text": "余杭区",
                        "value": 330110
                    },
                    {
                        "id": 330111,
                        "name": "富阳区",
                        "pid": 330100,
                        "level": 2,
                        "text": "富阳区",
                        "value": 330111
                    },
                    {
                        "id": 330122,
                        "name": "桐庐县",
                        "pid": 330100,
                        "level": 2,
                        "text": "桐庐县",
                        "value": 330122
                    },
                    {
                        "id": 330127,
                        "name": "淳安县",
                        "pid": 330100,
                        "level": 2,
                        "text": "淳安县",
                        "value": 330127
                    },
                    {
                        "id": 330182,
                        "name": "建德市",
                        "pid": 330100,
                        "level": 2,
                        "text": "建德市",
                        "value": 330182
                    },
                    {
                        "id": 330185,
                        "name": "临安市",
                        "pid": 330100,
                        "level": 2,
                        "text": "临安市",
                        "value": 330185
                    }
                ],
                "text": "杭州市",
                "value": 330100
            },
            {
                "id": 330200,
                "name": "宁波市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 330201,
                        "name": "市辖区",
                        "pid": 330200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 330201
                    },
                    {
                        "id": 330203,
                        "name": "海曙区",
                        "pid": 330200,
                        "level": 2,
                        "text": "海曙区",
                        "value": 330203
                    },
                    {
                        "id": 330204,
                        "name": "江东区",
                        "pid": 330200,
                        "level": 2,
                        "text": "江东区",
                        "value": 330204
                    },
                    {
                        "id": 330205,
                        "name": "江北区",
                        "pid": 330200,
                        "level": 2,
                        "text": "江北区",
                        "value": 330205
                    },
                    {
                        "id": 330206,
                        "name": "北仑区",
                        "pid": 330200,
                        "level": 2,
                        "text": "北仑区",
                        "value": 330206
                    },
                    {
                        "id": 330211,
                        "name": "镇海区",
                        "pid": 330200,
                        "level": 2,
                        "text": "镇海区",
                        "value": 330211
                    },
                    {
                        "id": 330212,
                        "name": "鄞州区",
                        "pid": 330200,
                        "level": 2,
                        "text": "鄞州区",
                        "value": 330212
                    },
                    {
                        "id": 330225,
                        "name": "象山县",
                        "pid": 330200,
                        "level": 2,
                        "text": "象山县",
                        "value": 330225
                    },
                    {
                        "id": 330226,
                        "name": "宁海县",
                        "pid": 330200,
                        "level": 2,
                        "text": "宁海县",
                        "value": 330226
                    },
                    {
                        "id": 330281,
                        "name": "余姚市",
                        "pid": 330200,
                        "level": 2,
                        "text": "余姚市",
                        "value": 330281
                    },
                    {
                        "id": 330282,
                        "name": "慈溪市",
                        "pid": 330200,
                        "level": 2,
                        "text": "慈溪市",
                        "value": 330282
                    },
                    {
                        "id": 330283,
                        "name": "奉化市",
                        "pid": 330200,
                        "level": 2,
                        "text": "奉化市",
                        "value": 330283
                    }
                ],
                "text": "宁波市",
                "value": 330200
            },
            {
                "id": 330300,
                "name": "温州市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 330301,
                        "name": "市辖区",
                        "pid": 330300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 330301
                    },
                    {
                        "id": 330302,
                        "name": "鹿城区",
                        "pid": 330300,
                        "level": 2,
                        "text": "鹿城区",
                        "value": 330302
                    },
                    {
                        "id": 330303,
                        "name": "龙湾区",
                        "pid": 330300,
                        "level": 2,
                        "text": "龙湾区",
                        "value": 330303
                    },
                    {
                        "id": 330304,
                        "name": "瓯海区",
                        "pid": 330300,
                        "level": 2,
                        "text": "瓯海区",
                        "value": 330304
                    },
                    {
                        "id": 330305,
                        "name": "洞头区",
                        "pid": 330300,
                        "level": 2,
                        "text": "洞头区",
                        "value": 330305
                    },
                    {
                        "id": 330324,
                        "name": "永嘉县",
                        "pid": 330300,
                        "level": 2,
                        "text": "永嘉县",
                        "value": 330324
                    },
                    {
                        "id": 330326,
                        "name": "平阳县",
                        "pid": 330300,
                        "level": 2,
                        "text": "平阳县",
                        "value": 330326
                    },
                    {
                        "id": 330327,
                        "name": "苍南县",
                        "pid": 330300,
                        "level": 2,
                        "text": "苍南县",
                        "value": 330327
                    },
                    {
                        "id": 330328,
                        "name": "文成县",
                        "pid": 330300,
                        "level": 2,
                        "text": "文成县",
                        "value": 330328
                    },
                    {
                        "id": 330329,
                        "name": "泰顺县",
                        "pid": 330300,
                        "level": 2,
                        "text": "泰顺县",
                        "value": 330329
                    },
                    {
                        "id": 330381,
                        "name": "瑞安市",
                        "pid": 330300,
                        "level": 2,
                        "text": "瑞安市",
                        "value": 330381
                    },
                    {
                        "id": 330382,
                        "name": "乐清市",
                        "pid": 330300,
                        "level": 2,
                        "text": "乐清市",
                        "value": 330382
                    }
                ],
                "text": "温州市",
                "value": 330300
            },
            {
                "id": 330400,
                "name": "嘉兴市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 330401,
                        "name": "市辖区",
                        "pid": 330400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 330401
                    },
                    {
                        "id": 330402,
                        "name": "南湖区",
                        "pid": 330400,
                        "level": 2,
                        "text": "南湖区",
                        "value": 330402
                    },
                    {
                        "id": 330411,
                        "name": "秀洲区",
                        "pid": 330400,
                        "level": 2,
                        "text": "秀洲区",
                        "value": 330411
                    },
                    {
                        "id": 330421,
                        "name": "嘉善县",
                        "pid": 330400,
                        "level": 2,
                        "text": "嘉善县",
                        "value": 330421
                    },
                    {
                        "id": 330424,
                        "name": "海盐县",
                        "pid": 330400,
                        "level": 2,
                        "text": "海盐县",
                        "value": 330424
                    },
                    {
                        "id": 330481,
                        "name": "海宁市",
                        "pid": 330400,
                        "level": 2,
                        "text": "海宁市",
                        "value": 330481
                    },
                    {
                        "id": 330482,
                        "name": "平湖市",
                        "pid": 330400,
                        "level": 2,
                        "text": "平湖市",
                        "value": 330482
                    },
                    {
                        "id": 330483,
                        "name": "桐乡市",
                        "pid": 330400,
                        "level": 2,
                        "text": "桐乡市",
                        "value": 330483
                    }
                ],
                "text": "嘉兴市",
                "value": 330400
            },
            {
                "id": 330500,
                "name": "湖州市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 330501,
                        "name": "市辖区",
                        "pid": 330500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 330501
                    },
                    {
                        "id": 330502,
                        "name": "吴兴区",
                        "pid": 330500,
                        "level": 2,
                        "text": "吴兴区",
                        "value": 330502
                    },
                    {
                        "id": 330503,
                        "name": "南浔区",
                        "pid": 330500,
                        "level": 2,
                        "text": "南浔区",
                        "value": 330503
                    },
                    {
                        "id": 330521,
                        "name": "德清县",
                        "pid": 330500,
                        "level": 2,
                        "text": "德清县",
                        "value": 330521
                    },
                    {
                        "id": 330522,
                        "name": "长兴县",
                        "pid": 330500,
                        "level": 2,
                        "text": "长兴县",
                        "value": 330522
                    },
                    {
                        "id": 330523,
                        "name": "安吉县",
                        "pid": 330500,
                        "level": 2,
                        "text": "安吉县",
                        "value": 330523
                    }
                ],
                "text": "湖州市",
                "value": 330500
            },
            {
                "id": 330600,
                "name": "绍兴市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 330601,
                        "name": "市辖区",
                        "pid": 330600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 330601
                    },
                    {
                        "id": 330602,
                        "name": "越城区",
                        "pid": 330600,
                        "level": 2,
                        "text": "越城区",
                        "value": 330602
                    },
                    {
                        "id": 330603,
                        "name": "柯桥区",
                        "pid": 330600,
                        "level": 2,
                        "text": "柯桥区",
                        "value": 330603
                    },
                    {
                        "id": 330604,
                        "name": "上虞区",
                        "pid": 330600,
                        "level": 2,
                        "text": "上虞区",
                        "value": 330604
                    },
                    {
                        "id": 330624,
                        "name": "新昌县",
                        "pid": 330600,
                        "level": 2,
                        "text": "新昌县",
                        "value": 330624
                    },
                    {
                        "id": 330681,
                        "name": "诸暨市",
                        "pid": 330600,
                        "level": 2,
                        "text": "诸暨市",
                        "value": 330681
                    },
                    {
                        "id": 330683,
                        "name": "嵊州市",
                        "pid": 330600,
                        "level": 2,
                        "text": "嵊州市",
                        "value": 330683
                    }
                ],
                "text": "绍兴市",
                "value": 330600
            },
            {
                "id": 330700,
                "name": "金华市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 330701,
                        "name": "市辖区",
                        "pid": 330700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 330701
                    },
                    {
                        "id": 330702,
                        "name": "婺城区",
                        "pid": 330700,
                        "level": 2,
                        "text": "婺城区",
                        "value": 330702
                    },
                    {
                        "id": 330703,
                        "name": "金东区",
                        "pid": 330700,
                        "level": 2,
                        "text": "金东区",
                        "value": 330703
                    },
                    {
                        "id": 330723,
                        "name": "武义县",
                        "pid": 330700,
                        "level": 2,
                        "text": "武义县",
                        "value": 330723
                    },
                    {
                        "id": 330726,
                        "name": "浦江县",
                        "pid": 330700,
                        "level": 2,
                        "text": "浦江县",
                        "value": 330726
                    },
                    {
                        "id": 330727,
                        "name": "磐安县",
                        "pid": 330700,
                        "level": 2,
                        "text": "磐安县",
                        "value": 330727
                    },
                    {
                        "id": 330781,
                        "name": "兰溪市",
                        "pid": 330700,
                        "level": 2,
                        "text": "兰溪市",
                        "value": 330781
                    },
                    {
                        "id": 330782,
                        "name": "义乌市",
                        "pid": 330700,
                        "level": 2,
                        "text": "义乌市",
                        "value": 330782
                    },
                    {
                        "id": 330783,
                        "name": "东阳市",
                        "pid": 330700,
                        "level": 2,
                        "text": "东阳市",
                        "value": 330783
                    },
                    {
                        "id": 330784,
                        "name": "永康市",
                        "pid": 330700,
                        "level": 2,
                        "text": "永康市",
                        "value": 330784
                    }
                ],
                "text": "金华市",
                "value": 330700
            },
            {
                "id": 330800,
                "name": "衢州市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 330801,
                        "name": "市辖区",
                        "pid": 330800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 330801
                    },
                    {
                        "id": 330802,
                        "name": "柯城区",
                        "pid": 330800,
                        "level": 2,
                        "text": "柯城区",
                        "value": 330802
                    },
                    {
                        "id": 330803,
                        "name": "衢江区",
                        "pid": 330800,
                        "level": 2,
                        "text": "衢江区",
                        "value": 330803
                    },
                    {
                        "id": 330822,
                        "name": "常山县",
                        "pid": 330800,
                        "level": 2,
                        "text": "常山县",
                        "value": 330822
                    },
                    {
                        "id": 330824,
                        "name": "开化县",
                        "pid": 330800,
                        "level": 2,
                        "text": "开化县",
                        "value": 330824
                    },
                    {
                        "id": 330825,
                        "name": "龙游县",
                        "pid": 330800,
                        "level": 2,
                        "text": "龙游县",
                        "value": 330825
                    },
                    {
                        "id": 330881,
                        "name": "江山市",
                        "pid": 330800,
                        "level": 2,
                        "text": "江山市",
                        "value": 330881
                    }
                ],
                "text": "衢州市",
                "value": 330800
            },
            {
                "id": 330900,
                "name": "舟山市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 330901,
                        "name": "市辖区",
                        "pid": 330900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 330901
                    },
                    {
                        "id": 330902,
                        "name": "定海区",
                        "pid": 330900,
                        "level": 2,
                        "text": "定海区",
                        "value": 330902
                    },
                    {
                        "id": 330903,
                        "name": "普陀区",
                        "pid": 330900,
                        "level": 2,
                        "text": "普陀区",
                        "value": 330903
                    },
                    {
                        "id": 330921,
                        "name": "岱山县",
                        "pid": 330900,
                        "level": 2,
                        "text": "岱山县",
                        "value": 330921
                    },
                    {
                        "id": 330922,
                        "name": "嵊泗县",
                        "pid": 330900,
                        "level": 2,
                        "text": "嵊泗县",
                        "value": 330922
                    }
                ],
                "text": "舟山市",
                "value": 330900
            },
            {
                "id": 331000,
                "name": "台州市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 331001,
                        "name": "市辖区",
                        "pid": 331000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 331001
                    },
                    {
                        "id": 331002,
                        "name": "椒江区",
                        "pid": 331000,
                        "level": 2,
                        "text": "椒江区",
                        "value": 331002
                    },
                    {
                        "id": 331003,
                        "name": "黄岩区",
                        "pid": 331000,
                        "level": 2,
                        "text": "黄岩区",
                        "value": 331003
                    },
                    {
                        "id": 331004,
                        "name": "路桥区",
                        "pid": 331000,
                        "level": 2,
                        "text": "路桥区",
                        "value": 331004
                    },
                    {
                        "id": 331021,
                        "name": "玉环县",
                        "pid": 331000,
                        "level": 2,
                        "text": "玉环县",
                        "value": 331021
                    },
                    {
                        "id": 331022,
                        "name": "三门县",
                        "pid": 331000,
                        "level": 2,
                        "text": "三门县",
                        "value": 331022
                    },
                    {
                        "id": 331023,
                        "name": "天台县",
                        "pid": 331000,
                        "level": 2,
                        "text": "天台县",
                        "value": 331023
                    },
                    {
                        "id": 331024,
                        "name": "仙居县",
                        "pid": 331000,
                        "level": 2,
                        "text": "仙居县",
                        "value": 331024
                    },
                    {
                        "id": 331081,
                        "name": "温岭市",
                        "pid": 331000,
                        "level": 2,
                        "text": "温岭市",
                        "value": 331081
                    },
                    {
                        "id": 331082,
                        "name": "临海市",
                        "pid": 331000,
                        "level": 2,
                        "text": "临海市",
                        "value": 331082
                    }
                ],
                "text": "台州市",
                "value": 331000
            },
            {
                "id": 331100,
                "name": "丽水市",
                "pid": 330000,
                "level": 1,
                "children": [
                    {
                        "id": 331101,
                        "name": "市辖区",
                        "pid": 331100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 331101
                    },
                    {
                        "id": 331102,
                        "name": "莲都区",
                        "pid": 331100,
                        "level": 2,
                        "text": "莲都区",
                        "value": 331102
                    },
                    {
                        "id": 331121,
                        "name": "青田县",
                        "pid": 331100,
                        "level": 2,
                        "text": "青田县",
                        "value": 331121
                    },
                    {
                        "id": 331122,
                        "name": "缙云县",
                        "pid": 331100,
                        "level": 2,
                        "text": "缙云县",
                        "value": 331122
                    },
                    {
                        "id": 331123,
                        "name": "遂昌县",
                        "pid": 331100,
                        "level": 2,
                        "text": "遂昌县",
                        "value": 331123
                    },
                    {
                        "id": 331124,
                        "name": "松阳县",
                        "pid": 331100,
                        "level": 2,
                        "text": "松阳县",
                        "value": 331124
                    },
                    {
                        "id": 331125,
                        "name": "云和县",
                        "pid": 331100,
                        "level": 2,
                        "text": "云和县",
                        "value": 331125
                    },
                    {
                        "id": 331126,
                        "name": "庆元县",
                        "pid": 331100,
                        "level": 2,
                        "text": "庆元县",
                        "value": 331126
                    },
                    {
                        "id": 331127,
                        "name": "景宁畲族自治县",
                        "pid": 331100,
                        "level": 2,
                        "text": "景宁畲族自治县",
                        "value": 331127
                    },
                    {
                        "id": 331181,
                        "name": "龙泉市",
                        "pid": 331100,
                        "level": 2,
                        "text": "龙泉市",
                        "value": 331181
                    }
                ],
                "text": "丽水市",
                "value": 331100
            }
        ],
        "text": "浙江省",
        "value": 330000
    },
    {
        "id": 340000,
        "name": "安徽省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 340100,
                "name": "合肥市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 340101,
                        "name": "市辖区",
                        "pid": 340100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 340101
                    },
                    {
                        "id": 340102,
                        "name": "瑶海区",
                        "pid": 340100,
                        "level": 2,
                        "text": "瑶海区",
                        "value": 340102
                    },
                    {
                        "id": 340103,
                        "name": "庐阳区",
                        "pid": 340100,
                        "level": 2,
                        "text": "庐阳区",
                        "value": 340103
                    },
                    {
                        "id": 340104,
                        "name": "蜀山区",
                        "pid": 340100,
                        "level": 2,
                        "text": "蜀山区",
                        "value": 340104
                    },
                    {
                        "id": 340111,
                        "name": "包河区",
                        "pid": 340100,
                        "level": 2,
                        "text": "包河区",
                        "value": 340111
                    },
                    {
                        "id": 340121,
                        "name": "长丰县",
                        "pid": 340100,
                        "level": 2,
                        "text": "长丰县",
                        "value": 340121
                    },
                    {
                        "id": 340122,
                        "name": "肥东县",
                        "pid": 340100,
                        "level": 2,
                        "text": "肥东县",
                        "value": 340122
                    },
                    {
                        "id": 340123,
                        "name": "肥西县",
                        "pid": 340100,
                        "level": 2,
                        "text": "肥西县",
                        "value": 340123
                    },
                    {
                        "id": 340124,
                        "name": "庐江县",
                        "pid": 340100,
                        "level": 2,
                        "text": "庐江县",
                        "value": 340124
                    },
                    {
                        "id": 340181,
                        "name": "巢湖市",
                        "pid": 340100,
                        "level": 2,
                        "text": "巢湖市",
                        "value": 340181
                    }
                ],
                "text": "合肥市",
                "value": 340100
            },
            {
                "id": 340200,
                "name": "芜湖市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 340201,
                        "name": "市辖区",
                        "pid": 340200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 340201
                    },
                    {
                        "id": 340202,
                        "name": "镜湖区",
                        "pid": 340200,
                        "level": 2,
                        "text": "镜湖区",
                        "value": 340202
                    },
                    {
                        "id": 340203,
                        "name": "弋江区",
                        "pid": 340200,
                        "level": 2,
                        "text": "弋江区",
                        "value": 340203
                    },
                    {
                        "id": 340207,
                        "name": "鸠江区",
                        "pid": 340200,
                        "level": 2,
                        "text": "鸠江区",
                        "value": 340207
                    },
                    {
                        "id": 340208,
                        "name": "三山区",
                        "pid": 340200,
                        "level": 2,
                        "text": "三山区",
                        "value": 340208
                    },
                    {
                        "id": 340221,
                        "name": "芜湖县",
                        "pid": 340200,
                        "level": 2,
                        "text": "芜湖县",
                        "value": 340221
                    },
                    {
                        "id": 340222,
                        "name": "繁昌县",
                        "pid": 340200,
                        "level": 2,
                        "text": "繁昌县",
                        "value": 340222
                    },
                    {
                        "id": 340223,
                        "name": "南陵县",
                        "pid": 340200,
                        "level": 2,
                        "text": "南陵县",
                        "value": 340223
                    },
                    {
                        "id": 340225,
                        "name": "无为县",
                        "pid": 340200,
                        "level": 2,
                        "text": "无为县",
                        "value": 340225
                    }
                ],
                "text": "芜湖市",
                "value": 340200
            },
            {
                "id": 340300,
                "name": "蚌埠市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 340301,
                        "name": "市辖区",
                        "pid": 340300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 340301
                    },
                    {
                        "id": 340302,
                        "name": "龙子湖区",
                        "pid": 340300,
                        "level": 2,
                        "text": "龙子湖区",
                        "value": 340302
                    },
                    {
                        "id": 340303,
                        "name": "蚌山区",
                        "pid": 340300,
                        "level": 2,
                        "text": "蚌山区",
                        "value": 340303
                    },
                    {
                        "id": 340304,
                        "name": "禹会区",
                        "pid": 340300,
                        "level": 2,
                        "text": "禹会区",
                        "value": 340304
                    },
                    {
                        "id": 340311,
                        "name": "淮上区",
                        "pid": 340300,
                        "level": 2,
                        "text": "淮上区",
                        "value": 340311
                    },
                    {
                        "id": 340321,
                        "name": "怀远县",
                        "pid": 340300,
                        "level": 2,
                        "text": "怀远县",
                        "value": 340321
                    },
                    {
                        "id": 340322,
                        "name": "五河县",
                        "pid": 340300,
                        "level": 2,
                        "text": "五河县",
                        "value": 340322
                    },
                    {
                        "id": 340323,
                        "name": "固镇县",
                        "pid": 340300,
                        "level": 2,
                        "text": "固镇县",
                        "value": 340323
                    }
                ],
                "text": "蚌埠市",
                "value": 340300
            },
            {
                "id": 340400,
                "name": "淮南市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 340401,
                        "name": "市辖区",
                        "pid": 340400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 340401
                    },
                    {
                        "id": 340402,
                        "name": "大通区",
                        "pid": 340400,
                        "level": 2,
                        "text": "大通区",
                        "value": 340402
                    },
                    {
                        "id": 340403,
                        "name": "田家庵区",
                        "pid": 340400,
                        "level": 2,
                        "text": "田家庵区",
                        "value": 340403
                    },
                    {
                        "id": 340404,
                        "name": "谢家集区",
                        "pid": 340400,
                        "level": 2,
                        "text": "谢家集区",
                        "value": 340404
                    },
                    {
                        "id": 340405,
                        "name": "八公山区",
                        "pid": 340400,
                        "level": 2,
                        "text": "八公山区",
                        "value": 340405
                    },
                    {
                        "id": 340406,
                        "name": "潘集区",
                        "pid": 340400,
                        "level": 2,
                        "text": "潘集区",
                        "value": 340406
                    },
                    {
                        "id": 340421,
                        "name": "凤台县",
                        "pid": 340400,
                        "level": 2,
                        "text": "凤台县",
                        "value": 340421
                    },
                    {
                        "id": 340422,
                        "name": "寿县",
                        "pid": 340400,
                        "level": 2,
                        "text": "寿县",
                        "value": 340422
                    }
                ],
                "text": "淮南市",
                "value": 340400
            },
            {
                "id": 340500,
                "name": "马鞍山市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 340501,
                        "name": "市辖区",
                        "pid": 340500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 340501
                    },
                    {
                        "id": 340503,
                        "name": "花山区",
                        "pid": 340500,
                        "level": 2,
                        "text": "花山区",
                        "value": 340503
                    },
                    {
                        "id": 340504,
                        "name": "雨山区",
                        "pid": 340500,
                        "level": 2,
                        "text": "雨山区",
                        "value": 340504
                    },
                    {
                        "id": 340506,
                        "name": "博望区",
                        "pid": 340500,
                        "level": 2,
                        "text": "博望区",
                        "value": 340506
                    },
                    {
                        "id": 340521,
                        "name": "当涂县",
                        "pid": 340500,
                        "level": 2,
                        "text": "当涂县",
                        "value": 340521
                    },
                    {
                        "id": 340522,
                        "name": "含山县",
                        "pid": 340500,
                        "level": 2,
                        "text": "含山县",
                        "value": 340522
                    },
                    {
                        "id": 340523,
                        "name": "和县",
                        "pid": 340500,
                        "level": 2,
                        "text": "和县",
                        "value": 340523
                    }
                ],
                "text": "马鞍山市",
                "value": 340500
            },
            {
                "id": 340600,
                "name": "淮北市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 340601,
                        "name": "市辖区",
                        "pid": 340600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 340601
                    },
                    {
                        "id": 340602,
                        "name": "杜集区",
                        "pid": 340600,
                        "level": 2,
                        "text": "杜集区",
                        "value": 340602
                    },
                    {
                        "id": 340603,
                        "name": "相山区",
                        "pid": 340600,
                        "level": 2,
                        "text": "相山区",
                        "value": 340603
                    },
                    {
                        "id": 340604,
                        "name": "烈山区",
                        "pid": 340600,
                        "level": 2,
                        "text": "烈山区",
                        "value": 340604
                    },
                    {
                        "id": 340621,
                        "name": "濉溪县",
                        "pid": 340600,
                        "level": 2,
                        "text": "濉溪县",
                        "value": 340621
                    }
                ],
                "text": "淮北市",
                "value": 340600
            },
            {
                "id": 340700,
                "name": "铜陵市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 340701,
                        "name": "市辖区",
                        "pid": 340700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 340701
                    },
                    {
                        "id": 340705,
                        "name": "铜官区",
                        "pid": 340700,
                        "level": 2,
                        "text": "铜官区",
                        "value": 340705
                    },
                    {
                        "id": 340706,
                        "name": "义安区",
                        "pid": 340700,
                        "level": 2,
                        "text": "义安区",
                        "value": 340706
                    },
                    {
                        "id": 340711,
                        "name": "郊区",
                        "pid": 340700,
                        "level": 2,
                        "text": "郊区",
                        "value": 340711
                    },
                    {
                        "id": 340722,
                        "name": "枞阳县",
                        "pid": 340700,
                        "level": 2,
                        "text": "枞阳县",
                        "value": 340722
                    }
                ],
                "text": "铜陵市",
                "value": 340700
            },
            {
                "id": 340800,
                "name": "安庆市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 340801,
                        "name": "市辖区",
                        "pid": 340800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 340801
                    },
                    {
                        "id": 340802,
                        "name": "迎江区",
                        "pid": 340800,
                        "level": 2,
                        "text": "迎江区",
                        "value": 340802
                    },
                    {
                        "id": 340803,
                        "name": "大观区",
                        "pid": 340800,
                        "level": 2,
                        "text": "大观区",
                        "value": 340803
                    },
                    {
                        "id": 340811,
                        "name": "宜秀区",
                        "pid": 340800,
                        "level": 2,
                        "text": "宜秀区",
                        "value": 340811
                    },
                    {
                        "id": 340822,
                        "name": "怀宁县",
                        "pid": 340800,
                        "level": 2,
                        "text": "怀宁县",
                        "value": 340822
                    },
                    {
                        "id": 340824,
                        "name": "潜山县",
                        "pid": 340800,
                        "level": 2,
                        "text": "潜山县",
                        "value": 340824
                    },
                    {
                        "id": 340825,
                        "name": "太湖县",
                        "pid": 340800,
                        "level": 2,
                        "text": "太湖县",
                        "value": 340825
                    },
                    {
                        "id": 340826,
                        "name": "宿松县",
                        "pid": 340800,
                        "level": 2,
                        "text": "宿松县",
                        "value": 340826
                    },
                    {
                        "id": 340827,
                        "name": "望江县",
                        "pid": 340800,
                        "level": 2,
                        "text": "望江县",
                        "value": 340827
                    },
                    {
                        "id": 340828,
                        "name": "岳西县",
                        "pid": 340800,
                        "level": 2,
                        "text": "岳西县",
                        "value": 340828
                    },
                    {
                        "id": 340881,
                        "name": "桐城市",
                        "pid": 340800,
                        "level": 2,
                        "text": "桐城市",
                        "value": 340881
                    }
                ],
                "text": "安庆市",
                "value": 340800
            },
            {
                "id": 341000,
                "name": "黄山市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 341001,
                        "name": "市辖区",
                        "pid": 341000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 341001
                    },
                    {
                        "id": 341002,
                        "name": "屯溪区",
                        "pid": 341000,
                        "level": 2,
                        "text": "屯溪区",
                        "value": 341002
                    },
                    {
                        "id": 341003,
                        "name": "黄山区",
                        "pid": 341000,
                        "level": 2,
                        "text": "黄山区",
                        "value": 341003
                    },
                    {
                        "id": 341004,
                        "name": "徽州区",
                        "pid": 341000,
                        "level": 2,
                        "text": "徽州区",
                        "value": 341004
                    },
                    {
                        "id": 341021,
                        "name": "歙县",
                        "pid": 341000,
                        "level": 2,
                        "text": "歙县",
                        "value": 341021
                    },
                    {
                        "id": 341022,
                        "name": "休宁县",
                        "pid": 341000,
                        "level": 2,
                        "text": "休宁县",
                        "value": 341022
                    },
                    {
                        "id": 341023,
                        "name": "黟县",
                        "pid": 341000,
                        "level": 2,
                        "text": "黟县",
                        "value": 341023
                    },
                    {
                        "id": 341024,
                        "name": "祁门县",
                        "pid": 341000,
                        "level": 2,
                        "text": "祁门县",
                        "value": 341024
                    }
                ],
                "text": "黄山市",
                "value": 341000
            },
            {
                "id": 341100,
                "name": "滁州市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 341101,
                        "name": "市辖区",
                        "pid": 341100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 341101
                    },
                    {
                        "id": 341102,
                        "name": "琅琊区",
                        "pid": 341100,
                        "level": 2,
                        "text": "琅琊区",
                        "value": 341102
                    },
                    {
                        "id": 341103,
                        "name": "南谯区",
                        "pid": 341100,
                        "level": 2,
                        "text": "南谯区",
                        "value": 341103
                    },
                    {
                        "id": 341122,
                        "name": "来安县",
                        "pid": 341100,
                        "level": 2,
                        "text": "来安县",
                        "value": 341122
                    },
                    {
                        "id": 341124,
                        "name": "全椒县",
                        "pid": 341100,
                        "level": 2,
                        "text": "全椒县",
                        "value": 341124
                    },
                    {
                        "id": 341125,
                        "name": "定远县",
                        "pid": 341100,
                        "level": 2,
                        "text": "定远县",
                        "value": 341125
                    },
                    {
                        "id": 341126,
                        "name": "凤阳县",
                        "pid": 341100,
                        "level": 2,
                        "text": "凤阳县",
                        "value": 341126
                    },
                    {
                        "id": 341181,
                        "name": "天长市",
                        "pid": 341100,
                        "level": 2,
                        "text": "天长市",
                        "value": 341181
                    },
                    {
                        "id": 341182,
                        "name": "明光市",
                        "pid": 341100,
                        "level": 2,
                        "text": "明光市",
                        "value": 341182
                    }
                ],
                "text": "滁州市",
                "value": 341100
            },
            {
                "id": 341200,
                "name": "阜阳市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 341201,
                        "name": "市辖区",
                        "pid": 341200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 341201
                    },
                    {
                        "id": 341202,
                        "name": "颍州区",
                        "pid": 341200,
                        "level": 2,
                        "text": "颍州区",
                        "value": 341202
                    },
                    {
                        "id": 341203,
                        "name": "颍东区",
                        "pid": 341200,
                        "level": 2,
                        "text": "颍东区",
                        "value": 341203
                    },
                    {
                        "id": 341204,
                        "name": "颍泉区",
                        "pid": 341200,
                        "level": 2,
                        "text": "颍泉区",
                        "value": 341204
                    },
                    {
                        "id": 341221,
                        "name": "临泉县",
                        "pid": 341200,
                        "level": 2,
                        "text": "临泉县",
                        "value": 341221
                    },
                    {
                        "id": 341222,
                        "name": "太和县",
                        "pid": 341200,
                        "level": 2,
                        "text": "太和县",
                        "value": 341222
                    },
                    {
                        "id": 341225,
                        "name": "阜南县",
                        "pid": 341200,
                        "level": 2,
                        "text": "阜南县",
                        "value": 341225
                    },
                    {
                        "id": 341226,
                        "name": "颍上县",
                        "pid": 341200,
                        "level": 2,
                        "text": "颍上县",
                        "value": 341226
                    },
                    {
                        "id": 341282,
                        "name": "界首市",
                        "pid": 341200,
                        "level": 2,
                        "text": "界首市",
                        "value": 341282
                    }
                ],
                "text": "阜阳市",
                "value": 341200
            },
            {
                "id": 341300,
                "name": "宿州市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 341301,
                        "name": "市辖区",
                        "pid": 341300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 341301
                    },
                    {
                        "id": 341302,
                        "name": "埇桥区",
                        "pid": 341300,
                        "level": 2,
                        "text": "埇桥区",
                        "value": 341302
                    },
                    {
                        "id": 341321,
                        "name": "砀山县",
                        "pid": 341300,
                        "level": 2,
                        "text": "砀山县",
                        "value": 341321
                    },
                    {
                        "id": 341322,
                        "name": "萧县",
                        "pid": 341300,
                        "level": 2,
                        "text": "萧县",
                        "value": 341322
                    },
                    {
                        "id": 341323,
                        "name": "灵璧县",
                        "pid": 341300,
                        "level": 2,
                        "text": "灵璧县",
                        "value": 341323
                    },
                    {
                        "id": 341324,
                        "name": "泗县",
                        "pid": 341300,
                        "level": 2,
                        "text": "泗县",
                        "value": 341324
                    }
                ],
                "text": "宿州市",
                "value": 341300
            },
            {
                "id": 341500,
                "name": "六安市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 341501,
                        "name": "市辖区",
                        "pid": 341500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 341501
                    },
                    {
                        "id": 341502,
                        "name": "金安区",
                        "pid": 341500,
                        "level": 2,
                        "text": "金安区",
                        "value": 341502
                    },
                    {
                        "id": 341503,
                        "name": "裕安区",
                        "pid": 341500,
                        "level": 2,
                        "text": "裕安区",
                        "value": 341503
                    },
                    {
                        "id": 341504,
                        "name": "叶集区",
                        "pid": 341500,
                        "level": 2,
                        "text": "叶集区",
                        "value": 341504
                    },
                    {
                        "id": 341522,
                        "name": "霍邱县",
                        "pid": 341500,
                        "level": 2,
                        "text": "霍邱县",
                        "value": 341522
                    },
                    {
                        "id": 341523,
                        "name": "舒城县",
                        "pid": 341500,
                        "level": 2,
                        "text": "舒城县",
                        "value": 341523
                    },
                    {
                        "id": 341524,
                        "name": "金寨县",
                        "pid": 341500,
                        "level": 2,
                        "text": "金寨县",
                        "value": 341524
                    },
                    {
                        "id": 341525,
                        "name": "霍山县",
                        "pid": 341500,
                        "level": 2,
                        "text": "霍山县",
                        "value": 341525
                    }
                ],
                "text": "六安市",
                "value": 341500
            },
            {
                "id": 341600,
                "name": "亳州市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 341601,
                        "name": "市辖区",
                        "pid": 341600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 341601
                    },
                    {
                        "id": 341602,
                        "name": "谯城区",
                        "pid": 341600,
                        "level": 2,
                        "text": "谯城区",
                        "value": 341602
                    },
                    {
                        "id": 341621,
                        "name": "涡阳县",
                        "pid": 341600,
                        "level": 2,
                        "text": "涡阳县",
                        "value": 341621
                    },
                    {
                        "id": 341622,
                        "name": "蒙城县",
                        "pid": 341600,
                        "level": 2,
                        "text": "蒙城县",
                        "value": 341622
                    },
                    {
                        "id": 341623,
                        "name": "利辛县",
                        "pid": 341600,
                        "level": 2,
                        "text": "利辛县",
                        "value": 341623
                    }
                ],
                "text": "亳州市",
                "value": 341600
            },
            {
                "id": 341700,
                "name": "池州市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 341701,
                        "name": "市辖区",
                        "pid": 341700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 341701
                    },
                    {
                        "id": 341702,
                        "name": "贵池区",
                        "pid": 341700,
                        "level": 2,
                        "text": "贵池区",
                        "value": 341702
                    },
                    {
                        "id": 341721,
                        "name": "东至县",
                        "pid": 341700,
                        "level": 2,
                        "text": "东至县",
                        "value": 341721
                    },
                    {
                        "id": 341722,
                        "name": "石台县",
                        "pid": 341700,
                        "level": 2,
                        "text": "石台县",
                        "value": 341722
                    },
                    {
                        "id": 341723,
                        "name": "青阳县",
                        "pid": 341700,
                        "level": 2,
                        "text": "青阳县",
                        "value": 341723
                    }
                ],
                "text": "池州市",
                "value": 341700
            },
            {
                "id": 341800,
                "name": "宣城市",
                "pid": 340000,
                "level": 1,
                "children": [
                    {
                        "id": 341801,
                        "name": "市辖区",
                        "pid": 341800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 341801
                    },
                    {
                        "id": 341802,
                        "name": "宣州区",
                        "pid": 341800,
                        "level": 2,
                        "text": "宣州区",
                        "value": 341802
                    },
                    {
                        "id": 341821,
                        "name": "郎溪县",
                        "pid": 341800,
                        "level": 2,
                        "text": "郎溪县",
                        "value": 341821
                    },
                    {
                        "id": 341822,
                        "name": "广德县",
                        "pid": 341800,
                        "level": 2,
                        "text": "广德县",
                        "value": 341822
                    },
                    {
                        "id": 341823,
                        "name": "泾县",
                        "pid": 341800,
                        "level": 2,
                        "text": "泾县",
                        "value": 341823
                    },
                    {
                        "id": 341824,
                        "name": "绩溪县",
                        "pid": 341800,
                        "level": 2,
                        "text": "绩溪县",
                        "value": 341824
                    },
                    {
                        "id": 341825,
                        "name": "旌德县",
                        "pid": 341800,
                        "level": 2,
                        "text": "旌德县",
                        "value": 341825
                    },
                    {
                        "id": 341881,
                        "name": "宁国市",
                        "pid": 341800,
                        "level": 2,
                        "text": "宁国市",
                        "value": 341881
                    }
                ],
                "text": "宣城市",
                "value": 341800
            }
        ],
        "text": "安徽省",
        "value": 340000
    },
    {
        "id": 350000,
        "name": "福建省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 350100,
                "name": "福州市",
                "pid": 350000,
                "level": 1,
                "children": [
                    {
                        "id": 350101,
                        "name": "市辖区",
                        "pid": 350100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 350101
                    },
                    {
                        "id": 350102,
                        "name": "鼓楼区",
                        "pid": 350100,
                        "level": 2,
                        "text": "鼓楼区",
                        "value": 350102
                    },
                    {
                        "id": 350103,
                        "name": "台江区",
                        "pid": 350100,
                        "level": 2,
                        "text": "台江区",
                        "value": 350103
                    },
                    {
                        "id": 350104,
                        "name": "仓山区",
                        "pid": 350100,
                        "level": 2,
                        "text": "仓山区",
                        "value": 350104
                    },
                    {
                        "id": 350105,
                        "name": "马尾区",
                        "pid": 350100,
                        "level": 2,
                        "text": "马尾区",
                        "value": 350105
                    },
                    {
                        "id": 350111,
                        "name": "晋安区",
                        "pid": 350100,
                        "level": 2,
                        "text": "晋安区",
                        "value": 350111
                    },
                    {
                        "id": 350121,
                        "name": "闽侯县",
                        "pid": 350100,
                        "level": 2,
                        "text": "闽侯县",
                        "value": 350121
                    },
                    {
                        "id": 350122,
                        "name": "连江县",
                        "pid": 350100,
                        "level": 2,
                        "text": "连江县",
                        "value": 350122
                    },
                    {
                        "id": 350123,
                        "name": "罗源县",
                        "pid": 350100,
                        "level": 2,
                        "text": "罗源县",
                        "value": 350123
                    },
                    {
                        "id": 350124,
                        "name": "闽清县",
                        "pid": 350100,
                        "level": 2,
                        "text": "闽清县",
                        "value": 350124
                    },
                    {
                        "id": 350125,
                        "name": "永泰县",
                        "pid": 350100,
                        "level": 2,
                        "text": "永泰县",
                        "value": 350125
                    },
                    {
                        "id": 350128,
                        "name": "平潭县",
                        "pid": 350100,
                        "level": 2,
                        "text": "平潭县",
                        "value": 350128
                    },
                    {
                        "id": 350181,
                        "name": "福清市",
                        "pid": 350100,
                        "level": 2,
                        "text": "福清市",
                        "value": 350181
                    },
                    {
                        "id": 350182,
                        "name": "长乐市",
                        "pid": 350100,
                        "level": 2,
                        "text": "长乐市",
                        "value": 350182
                    }
                ],
                "text": "福州市",
                "value": 350100
            },
            {
                "id": 350200,
                "name": "厦门市",
                "pid": 350000,
                "level": 1,
                "children": [
                    {
                        "id": 350201,
                        "name": "市辖区",
                        "pid": 350200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 350201
                    },
                    {
                        "id": 350203,
                        "name": "思明区",
                        "pid": 350200,
                        "level": 2,
                        "text": "思明区",
                        "value": 350203
                    },
                    {
                        "id": 350205,
                        "name": "海沧区",
                        "pid": 350200,
                        "level": 2,
                        "text": "海沧区",
                        "value": 350205
                    },
                    {
                        "id": 350206,
                        "name": "湖里区",
                        "pid": 350200,
                        "level": 2,
                        "text": "湖里区",
                        "value": 350206
                    },
                    {
                        "id": 350211,
                        "name": "集美区",
                        "pid": 350200,
                        "level": 2,
                        "text": "集美区",
                        "value": 350211
                    },
                    {
                        "id": 350212,
                        "name": "同安区",
                        "pid": 350200,
                        "level": 2,
                        "text": "同安区",
                        "value": 350212
                    },
                    {
                        "id": 350213,
                        "name": "翔安区",
                        "pid": 350200,
                        "level": 2,
                        "text": "翔安区",
                        "value": 350213
                    }
                ],
                "text": "厦门市",
                "value": 350200
            },
            {
                "id": 350300,
                "name": "莆田市",
                "pid": 350000,
                "level": 1,
                "children": [
                    {
                        "id": 350301,
                        "name": "市辖区",
                        "pid": 350300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 350301
                    },
                    {
                        "id": 350302,
                        "name": "城厢区",
                        "pid": 350300,
                        "level": 2,
                        "text": "城厢区",
                        "value": 350302
                    },
                    {
                        "id": 350303,
                        "name": "涵江区",
                        "pid": 350300,
                        "level": 2,
                        "text": "涵江区",
                        "value": 350303
                    },
                    {
                        "id": 350304,
                        "name": "荔城区",
                        "pid": 350300,
                        "level": 2,
                        "text": "荔城区",
                        "value": 350304
                    },
                    {
                        "id": 350305,
                        "name": "秀屿区",
                        "pid": 350300,
                        "level": 2,
                        "text": "秀屿区",
                        "value": 350305
                    },
                    {
                        "id": 350322,
                        "name": "仙游县",
                        "pid": 350300,
                        "level": 2,
                        "text": "仙游县",
                        "value": 350322
                    }
                ],
                "text": "莆田市",
                "value": 350300
            },
            {
                "id": 350400,
                "name": "三明市",
                "pid": 350000,
                "level": 1,
                "children": [
                    {
                        "id": 350401,
                        "name": "市辖区",
                        "pid": 350400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 350401
                    },
                    {
                        "id": 350402,
                        "name": "梅列区",
                        "pid": 350400,
                        "level": 2,
                        "text": "梅列区",
                        "value": 350402
                    },
                    {
                        "id": 350403,
                        "name": "三元区",
                        "pid": 350400,
                        "level": 2,
                        "text": "三元区",
                        "value": 350403
                    },
                    {
                        "id": 350421,
                        "name": "明溪县",
                        "pid": 350400,
                        "level": 2,
                        "text": "明溪县",
                        "value": 350421
                    },
                    {
                        "id": 350423,
                        "name": "清流县",
                        "pid": 350400,
                        "level": 2,
                        "text": "清流县",
                        "value": 350423
                    },
                    {
                        "id": 350424,
                        "name": "宁化县",
                        "pid": 350400,
                        "level": 2,
                        "text": "宁化县",
                        "value": 350424
                    },
                    {
                        "id": 350425,
                        "name": "大田县",
                        "pid": 350400,
                        "level": 2,
                        "text": "大田县",
                        "value": 350425
                    },
                    {
                        "id": 350426,
                        "name": "尤溪县",
                        "pid": 350400,
                        "level": 2,
                        "text": "尤溪县",
                        "value": 350426
                    },
                    {
                        "id": 350427,
                        "name": "沙县",
                        "pid": 350400,
                        "level": 2,
                        "text": "沙县",
                        "value": 350427
                    },
                    {
                        "id": 350428,
                        "name": "将乐县",
                        "pid": 350400,
                        "level": 2,
                        "text": "将乐县",
                        "value": 350428
                    },
                    {
                        "id": 350429,
                        "name": "泰宁县",
                        "pid": 350400,
                        "level": 2,
                        "text": "泰宁县",
                        "value": 350429
                    },
                    {
                        "id": 350430,
                        "name": "建宁县",
                        "pid": 350400,
                        "level": 2,
                        "text": "建宁县",
                        "value": 350430
                    },
                    {
                        "id": 350481,
                        "name": "永安市",
                        "pid": 350400,
                        "level": 2,
                        "text": "永安市",
                        "value": 350481
                    }
                ],
                "text": "三明市",
                "value": 350400
            },
            {
                "id": 350500,
                "name": "泉州市",
                "pid": 350000,
                "level": 1,
                "children": [
                    {
                        "id": 350501,
                        "name": "市辖区",
                        "pid": 350500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 350501
                    },
                    {
                        "id": 350502,
                        "name": "鲤城区",
                        "pid": 350500,
                        "level": 2,
                        "text": "鲤城区",
                        "value": 350502
                    },
                    {
                        "id": 350503,
                        "name": "丰泽区",
                        "pid": 350500,
                        "level": 2,
                        "text": "丰泽区",
                        "value": 350503
                    },
                    {
                        "id": 350504,
                        "name": "洛江区",
                        "pid": 350500,
                        "level": 2,
                        "text": "洛江区",
                        "value": 350504
                    },
                    {
                        "id": 350505,
                        "name": "泉港区",
                        "pid": 350500,
                        "level": 2,
                        "text": "泉港区",
                        "value": 350505
                    },
                    {
                        "id": 350521,
                        "name": "惠安县",
                        "pid": 350500,
                        "level": 2,
                        "text": "惠安县",
                        "value": 350521
                    },
                    {
                        "id": 350524,
                        "name": "安溪县",
                        "pid": 350500,
                        "level": 2,
                        "text": "安溪县",
                        "value": 350524
                    },
                    {
                        "id": 350525,
                        "name": "永春县",
                        "pid": 350500,
                        "level": 2,
                        "text": "永春县",
                        "value": 350525
                    },
                    {
                        "id": 350526,
                        "name": "德化县",
                        "pid": 350500,
                        "level": 2,
                        "text": "德化县",
                        "value": 350526
                    },
                    {
                        "id": 350527,
                        "name": "金门县",
                        "pid": 350500,
                        "level": 2,
                        "text": "金门县",
                        "value": 350527
                    },
                    {
                        "id": 350581,
                        "name": "石狮市",
                        "pid": 350500,
                        "level": 2,
                        "text": "石狮市",
                        "value": 350581
                    },
                    {
                        "id": 350582,
                        "name": "晋江市",
                        "pid": 350500,
                        "level": 2,
                        "text": "晋江市",
                        "value": 350582
                    },
                    {
                        "id": 350583,
                        "name": "南安市",
                        "pid": 350500,
                        "level": 2,
                        "text": "南安市",
                        "value": 350583
                    }
                ],
                "text": "泉州市",
                "value": 350500
            },
            {
                "id": 350600,
                "name": "漳州市",
                "pid": 350000,
                "level": 1,
                "children": [
                    {
                        "id": 350601,
                        "name": "市辖区",
                        "pid": 350600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 350601
                    },
                    {
                        "id": 350602,
                        "name": "芗城区",
                        "pid": 350600,
                        "level": 2,
                        "text": "芗城区",
                        "value": 350602
                    },
                    {
                        "id": 350603,
                        "name": "龙文区",
                        "pid": 350600,
                        "level": 2,
                        "text": "龙文区",
                        "value": 350603
                    },
                    {
                        "id": 350622,
                        "name": "云霄县",
                        "pid": 350600,
                        "level": 2,
                        "text": "云霄县",
                        "value": 350622
                    },
                    {
                        "id": 350623,
                        "name": "漳浦县",
                        "pid": 350600,
                        "level": 2,
                        "text": "漳浦县",
                        "value": 350623
                    },
                    {
                        "id": 350624,
                        "name": "诏安县",
                        "pid": 350600,
                        "level": 2,
                        "text": "诏安县",
                        "value": 350624
                    },
                    {
                        "id": 350625,
                        "name": "长泰县",
                        "pid": 350600,
                        "level": 2,
                        "text": "长泰县",
                        "value": 350625
                    },
                    {
                        "id": 350626,
                        "name": "东山县",
                        "pid": 350600,
                        "level": 2,
                        "text": "东山县",
                        "value": 350626
                    },
                    {
                        "id": 350627,
                        "name": "南靖县",
                        "pid": 350600,
                        "level": 2,
                        "text": "南靖县",
                        "value": 350627
                    },
                    {
                        "id": 350628,
                        "name": "平和县",
                        "pid": 350600,
                        "level": 2,
                        "text": "平和县",
                        "value": 350628
                    },
                    {
                        "id": 350629,
                        "name": "华安县",
                        "pid": 350600,
                        "level": 2,
                        "text": "华安县",
                        "value": 350629
                    },
                    {
                        "id": 350681,
                        "name": "龙海市",
                        "pid": 350600,
                        "level": 2,
                        "text": "龙海市",
                        "value": 350681
                    }
                ],
                "text": "漳州市",
                "value": 350600
            },
            {
                "id": 350700,
                "name": "南平市",
                "pid": 350000,
                "level": 1,
                "children": [
                    {
                        "id": 350701,
                        "name": "市辖区",
                        "pid": 350700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 350701
                    },
                    {
                        "id": 350702,
                        "name": "延平区",
                        "pid": 350700,
                        "level": 2,
                        "text": "延平区",
                        "value": 350702
                    },
                    {
                        "id": 350703,
                        "name": "建阳区",
                        "pid": 350700,
                        "level": 2,
                        "text": "建阳区",
                        "value": 350703
                    },
                    {
                        "id": 350721,
                        "name": "顺昌县",
                        "pid": 350700,
                        "level": 2,
                        "text": "顺昌县",
                        "value": 350721
                    },
                    {
                        "id": 350722,
                        "name": "浦城县",
                        "pid": 350700,
                        "level": 2,
                        "text": "浦城县",
                        "value": 350722
                    },
                    {
                        "id": 350723,
                        "name": "光泽县",
                        "pid": 350700,
                        "level": 2,
                        "text": "光泽县",
                        "value": 350723
                    },
                    {
                        "id": 350724,
                        "name": "松溪县",
                        "pid": 350700,
                        "level": 2,
                        "text": "松溪县",
                        "value": 350724
                    },
                    {
                        "id": 350725,
                        "name": "政和县",
                        "pid": 350700,
                        "level": 2,
                        "text": "政和县",
                        "value": 350725
                    },
                    {
                        "id": 350781,
                        "name": "邵武市",
                        "pid": 350700,
                        "level": 2,
                        "text": "邵武市",
                        "value": 350781
                    },
                    {
                        "id": 350782,
                        "name": "武夷山市",
                        "pid": 350700,
                        "level": 2,
                        "text": "武夷山市",
                        "value": 350782
                    },
                    {
                        "id": 350783,
                        "name": "建瓯市",
                        "pid": 350700,
                        "level": 2,
                        "text": "建瓯市",
                        "value": 350783
                    }
                ],
                "text": "南平市",
                "value": 350700
            },
            {
                "id": 350800,
                "name": "龙岩市",
                "pid": 350000,
                "level": 1,
                "children": [
                    {
                        "id": 350801,
                        "name": "市辖区",
                        "pid": 350800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 350801
                    },
                    {
                        "id": 350802,
                        "name": "新罗区",
                        "pid": 350800,
                        "level": 2,
                        "text": "新罗区",
                        "value": 350802
                    },
                    {
                        "id": 350803,
                        "name": "永定区",
                        "pid": 350800,
                        "level": 2,
                        "text": "永定区",
                        "value": 350803
                    },
                    {
                        "id": 350821,
                        "name": "长汀县",
                        "pid": 350800,
                        "level": 2,
                        "text": "长汀县",
                        "value": 350821
                    },
                    {
                        "id": 350823,
                        "name": "上杭县",
                        "pid": 350800,
                        "level": 2,
                        "text": "上杭县",
                        "value": 350823
                    },
                    {
                        "id": 350824,
                        "name": "武平县",
                        "pid": 350800,
                        "level": 2,
                        "text": "武平县",
                        "value": 350824
                    },
                    {
                        "id": 350825,
                        "name": "连城县",
                        "pid": 350800,
                        "level": 2,
                        "text": "连城县",
                        "value": 350825
                    },
                    {
                        "id": 350881,
                        "name": "漳平市",
                        "pid": 350800,
                        "level": 2,
                        "text": "漳平市",
                        "value": 350881
                    }
                ],
                "text": "龙岩市",
                "value": 350800
            },
            {
                "id": 350900,
                "name": "宁德市",
                "pid": 350000,
                "level": 1,
                "children": [
                    {
                        "id": 350901,
                        "name": "市辖区",
                        "pid": 350900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 350901
                    },
                    {
                        "id": 350902,
                        "name": "蕉城区",
                        "pid": 350900,
                        "level": 2,
                        "text": "蕉城区",
                        "value": 350902
                    },
                    {
                        "id": 350921,
                        "name": "霞浦县",
                        "pid": 350900,
                        "level": 2,
                        "text": "霞浦县",
                        "value": 350921
                    },
                    {
                        "id": 350922,
                        "name": "古田县",
                        "pid": 350900,
                        "level": 2,
                        "text": "古田县",
                        "value": 350922
                    },
                    {
                        "id": 350923,
                        "name": "屏南县",
                        "pid": 350900,
                        "level": 2,
                        "text": "屏南县",
                        "value": 350923
                    },
                    {
                        "id": 350924,
                        "name": "寿宁县",
                        "pid": 350900,
                        "level": 2,
                        "text": "寿宁县",
                        "value": 350924
                    },
                    {
                        "id": 350925,
                        "name": "周宁县",
                        "pid": 350900,
                        "level": 2,
                        "text": "周宁县",
                        "value": 350925
                    },
                    {
                        "id": 350926,
                        "name": "柘荣县",
                        "pid": 350900,
                        "level": 2,
                        "text": "柘荣县",
                        "value": 350926
                    },
                    {
                        "id": 350981,
                        "name": "福安市",
                        "pid": 350900,
                        "level": 2,
                        "text": "福安市",
                        "value": 350981
                    },
                    {
                        "id": 350982,
                        "name": "福鼎市",
                        "pid": 350900,
                        "level": 2,
                        "text": "福鼎市",
                        "value": 350982
                    }
                ],
                "text": "宁德市",
                "value": 350900
            }
        ],
        "text": "福建省",
        "value": 350000
    },
    {
        "id": 360000,
        "name": "江西省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 360100,
                "name": "南昌市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 360101,
                        "name": "市辖区",
                        "pid": 360100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 360101
                    },
                    {
                        "id": 360102,
                        "name": "东湖区",
                        "pid": 360100,
                        "level": 2,
                        "text": "东湖区",
                        "value": 360102
                    },
                    {
                        "id": 360103,
                        "name": "西湖区",
                        "pid": 360100,
                        "level": 2,
                        "text": "西湖区",
                        "value": 360103
                    },
                    {
                        "id": 360104,
                        "name": "青云谱区",
                        "pid": 360100,
                        "level": 2,
                        "text": "青云谱区",
                        "value": 360104
                    },
                    {
                        "id": 360105,
                        "name": "湾里区",
                        "pid": 360100,
                        "level": 2,
                        "text": "湾里区",
                        "value": 360105
                    },
                    {
                        "id": 360111,
                        "name": "青山湖区",
                        "pid": 360100,
                        "level": 2,
                        "text": "青山湖区",
                        "value": 360111
                    },
                    {
                        "id": 360112,
                        "name": "新建区",
                        "pid": 360100,
                        "level": 2,
                        "text": "新建区",
                        "value": 360112
                    },
                    {
                        "id": 360121,
                        "name": "南昌县",
                        "pid": 360100,
                        "level": 2,
                        "text": "南昌县",
                        "value": 360121
                    },
                    {
                        "id": 360123,
                        "name": "安义县",
                        "pid": 360100,
                        "level": 2,
                        "text": "安义县",
                        "value": 360123
                    },
                    {
                        "id": 360124,
                        "name": "进贤县",
                        "pid": 360100,
                        "level": 2,
                        "text": "进贤县",
                        "value": 360124
                    }
                ],
                "text": "南昌市",
                "value": 360100
            },
            {
                "id": 360200,
                "name": "景德镇市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 360201,
                        "name": "市辖区",
                        "pid": 360200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 360201
                    },
                    {
                        "id": 360202,
                        "name": "昌江区",
                        "pid": 360200,
                        "level": 2,
                        "text": "昌江区",
                        "value": 360202
                    },
                    {
                        "id": 360203,
                        "name": "珠山区",
                        "pid": 360200,
                        "level": 2,
                        "text": "珠山区",
                        "value": 360203
                    },
                    {
                        "id": 360222,
                        "name": "浮梁县",
                        "pid": 360200,
                        "level": 2,
                        "text": "浮梁县",
                        "value": 360222
                    },
                    {
                        "id": 360281,
                        "name": "乐平市",
                        "pid": 360200,
                        "level": 2,
                        "text": "乐平市",
                        "value": 360281
                    }
                ],
                "text": "景德镇市",
                "value": 360200
            },
            {
                "id": 360300,
                "name": "萍乡市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 360301,
                        "name": "市辖区",
                        "pid": 360300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 360301
                    },
                    {
                        "id": 360302,
                        "name": "安源区",
                        "pid": 360300,
                        "level": 2,
                        "text": "安源区",
                        "value": 360302
                    },
                    {
                        "id": 360313,
                        "name": "湘东区",
                        "pid": 360300,
                        "level": 2,
                        "text": "湘东区",
                        "value": 360313
                    },
                    {
                        "id": 360321,
                        "name": "莲花县",
                        "pid": 360300,
                        "level": 2,
                        "text": "莲花县",
                        "value": 360321
                    },
                    {
                        "id": 360322,
                        "name": "上栗县",
                        "pid": 360300,
                        "level": 2,
                        "text": "上栗县",
                        "value": 360322
                    },
                    {
                        "id": 360323,
                        "name": "芦溪县",
                        "pid": 360300,
                        "level": 2,
                        "text": "芦溪县",
                        "value": 360323
                    }
                ],
                "text": "萍乡市",
                "value": 360300
            },
            {
                "id": 360400,
                "name": "九江市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 360401,
                        "name": "市辖区",
                        "pid": 360400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 360401
                    },
                    {
                        "id": 360402,
                        "name": "濂溪区",
                        "pid": 360400,
                        "level": 2,
                        "text": "濂溪区",
                        "value": 360402
                    },
                    {
                        "id": 360403,
                        "name": "浔阳区",
                        "pid": 360400,
                        "level": 2,
                        "text": "浔阳区",
                        "value": 360403
                    },
                    {
                        "id": 360421,
                        "name": "九江县",
                        "pid": 360400,
                        "level": 2,
                        "text": "九江县",
                        "value": 360421
                    },
                    {
                        "id": 360423,
                        "name": "武宁县",
                        "pid": 360400,
                        "level": 2,
                        "text": "武宁县",
                        "value": 360423
                    },
                    {
                        "id": 360424,
                        "name": "修水县",
                        "pid": 360400,
                        "level": 2,
                        "text": "修水县",
                        "value": 360424
                    },
                    {
                        "id": 360425,
                        "name": "永修县",
                        "pid": 360400,
                        "level": 2,
                        "text": "永修县",
                        "value": 360425
                    },
                    {
                        "id": 360426,
                        "name": "德安县",
                        "pid": 360400,
                        "level": 2,
                        "text": "德安县",
                        "value": 360426
                    },
                    {
                        "id": 360428,
                        "name": "都昌县",
                        "pid": 360400,
                        "level": 2,
                        "text": "都昌县",
                        "value": 360428
                    },
                    {
                        "id": 360429,
                        "name": "湖口县",
                        "pid": 360400,
                        "level": 2,
                        "text": "湖口县",
                        "value": 360429
                    },
                    {
                        "id": 360430,
                        "name": "彭泽县",
                        "pid": 360400,
                        "level": 2,
                        "text": "彭泽县",
                        "value": 360430
                    },
                    {
                        "id": 360481,
                        "name": "瑞昌市",
                        "pid": 360400,
                        "level": 2,
                        "text": "瑞昌市",
                        "value": 360481
                    },
                    {
                        "id": 360482,
                        "name": "共青城市",
                        "pid": 360400,
                        "level": 2,
                        "text": "共青城市",
                        "value": 360482
                    },
                    {
                        "id": 360483,
                        "name": "庐山市",
                        "pid": 360400,
                        "level": 2,
                        "text": "庐山市",
                        "value": 360483
                    }
                ],
                "text": "九江市",
                "value": 360400
            },
            {
                "id": 360500,
                "name": "新余市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 360501,
                        "name": "市辖区",
                        "pid": 360500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 360501
                    },
                    {
                        "id": 360502,
                        "name": "渝水区",
                        "pid": 360500,
                        "level": 2,
                        "text": "渝水区",
                        "value": 360502
                    },
                    {
                        "id": 360521,
                        "name": "分宜县",
                        "pid": 360500,
                        "level": 2,
                        "text": "分宜县",
                        "value": 360521
                    }
                ],
                "text": "新余市",
                "value": 360500
            },
            {
                "id": 360600,
                "name": "鹰潭市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 360601,
                        "name": "市辖区",
                        "pid": 360600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 360601
                    },
                    {
                        "id": 360602,
                        "name": "月湖区",
                        "pid": 360600,
                        "level": 2,
                        "text": "月湖区",
                        "value": 360602
                    },
                    {
                        "id": 360622,
                        "name": "余江县",
                        "pid": 360600,
                        "level": 2,
                        "text": "余江县",
                        "value": 360622
                    },
                    {
                        "id": 360681,
                        "name": "贵溪市",
                        "pid": 360600,
                        "level": 2,
                        "text": "贵溪市",
                        "value": 360681
                    }
                ],
                "text": "鹰潭市",
                "value": 360600
            },
            {
                "id": 360700,
                "name": "赣州市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 360701,
                        "name": "市辖区",
                        "pid": 360700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 360701
                    },
                    {
                        "id": 360702,
                        "name": "章贡区",
                        "pid": 360700,
                        "level": 2,
                        "text": "章贡区",
                        "value": 360702
                    },
                    {
                        "id": 360703,
                        "name": "南康区",
                        "pid": 360700,
                        "level": 2,
                        "text": "南康区",
                        "value": 360703
                    },
                    {
                        "id": 360721,
                        "name": "赣县",
                        "pid": 360700,
                        "level": 2,
                        "text": "赣县",
                        "value": 360721
                    },
                    {
                        "id": 360722,
                        "name": "信丰县",
                        "pid": 360700,
                        "level": 2,
                        "text": "信丰县",
                        "value": 360722
                    },
                    {
                        "id": 360723,
                        "name": "大余县",
                        "pid": 360700,
                        "level": 2,
                        "text": "大余县",
                        "value": 360723
                    },
                    {
                        "id": 360724,
                        "name": "上犹县",
                        "pid": 360700,
                        "level": 2,
                        "text": "上犹县",
                        "value": 360724
                    },
                    {
                        "id": 360725,
                        "name": "崇义县",
                        "pid": 360700,
                        "level": 2,
                        "text": "崇义县",
                        "value": 360725
                    },
                    {
                        "id": 360726,
                        "name": "安远县",
                        "pid": 360700,
                        "level": 2,
                        "text": "安远县",
                        "value": 360726
                    },
                    {
                        "id": 360727,
                        "name": "龙南县",
                        "pid": 360700,
                        "level": 2,
                        "text": "龙南县",
                        "value": 360727
                    },
                    {
                        "id": 360728,
                        "name": "定南县",
                        "pid": 360700,
                        "level": 2,
                        "text": "定南县",
                        "value": 360728
                    },
                    {
                        "id": 360729,
                        "name": "全南县",
                        "pid": 360700,
                        "level": 2,
                        "text": "全南县",
                        "value": 360729
                    },
                    {
                        "id": 360730,
                        "name": "宁都县",
                        "pid": 360700,
                        "level": 2,
                        "text": "宁都县",
                        "value": 360730
                    },
                    {
                        "id": 360731,
                        "name": "于都县",
                        "pid": 360700,
                        "level": 2,
                        "text": "于都县",
                        "value": 360731
                    },
                    {
                        "id": 360732,
                        "name": "兴国县",
                        "pid": 360700,
                        "level": 2,
                        "text": "兴国县",
                        "value": 360732
                    },
                    {
                        "id": 360733,
                        "name": "会昌县",
                        "pid": 360700,
                        "level": 2,
                        "text": "会昌县",
                        "value": 360733
                    },
                    {
                        "id": 360734,
                        "name": "寻乌县",
                        "pid": 360700,
                        "level": 2,
                        "text": "寻乌县",
                        "value": 360734
                    },
                    {
                        "id": 360735,
                        "name": "石城县",
                        "pid": 360700,
                        "level": 2,
                        "text": "石城县",
                        "value": 360735
                    },
                    {
                        "id": 360781,
                        "name": "瑞金市",
                        "pid": 360700,
                        "level": 2,
                        "text": "瑞金市",
                        "value": 360781
                    }
                ],
                "text": "赣州市",
                "value": 360700
            },
            {
                "id": 360800,
                "name": "吉安市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 360801,
                        "name": "市辖区",
                        "pid": 360800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 360801
                    },
                    {
                        "id": 360802,
                        "name": "吉州区",
                        "pid": 360800,
                        "level": 2,
                        "text": "吉州区",
                        "value": 360802
                    },
                    {
                        "id": 360803,
                        "name": "青原区",
                        "pid": 360800,
                        "level": 2,
                        "text": "青原区",
                        "value": 360803
                    },
                    {
                        "id": 360821,
                        "name": "吉安县",
                        "pid": 360800,
                        "level": 2,
                        "text": "吉安县",
                        "value": 360821
                    },
                    {
                        "id": 360822,
                        "name": "吉水县",
                        "pid": 360800,
                        "level": 2,
                        "text": "吉水县",
                        "value": 360822
                    },
                    {
                        "id": 360823,
                        "name": "峡江县",
                        "pid": 360800,
                        "level": 2,
                        "text": "峡江县",
                        "value": 360823
                    },
                    {
                        "id": 360824,
                        "name": "新干县",
                        "pid": 360800,
                        "level": 2,
                        "text": "新干县",
                        "value": 360824
                    },
                    {
                        "id": 360825,
                        "name": "永丰县",
                        "pid": 360800,
                        "level": 2,
                        "text": "永丰县",
                        "value": 360825
                    },
                    {
                        "id": 360826,
                        "name": "泰和县",
                        "pid": 360800,
                        "level": 2,
                        "text": "泰和县",
                        "value": 360826
                    },
                    {
                        "id": 360827,
                        "name": "遂川县",
                        "pid": 360800,
                        "level": 2,
                        "text": "遂川县",
                        "value": 360827
                    },
                    {
                        "id": 360828,
                        "name": "万安县",
                        "pid": 360800,
                        "level": 2,
                        "text": "万安县",
                        "value": 360828
                    },
                    {
                        "id": 360829,
                        "name": "安福县",
                        "pid": 360800,
                        "level": 2,
                        "text": "安福县",
                        "value": 360829
                    },
                    {
                        "id": 360830,
                        "name": "永新县",
                        "pid": 360800,
                        "level": 2,
                        "text": "永新县",
                        "value": 360830
                    },
                    {
                        "id": 360881,
                        "name": "井冈山市",
                        "pid": 360800,
                        "level": 2,
                        "text": "井冈山市",
                        "value": 360881
                    }
                ],
                "text": "吉安市",
                "value": 360800
            },
            {
                "id": 360900,
                "name": "宜春市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 360901,
                        "name": "市辖区",
                        "pid": 360900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 360901
                    },
                    {
                        "id": 360902,
                        "name": "袁州区",
                        "pid": 360900,
                        "level": 2,
                        "text": "袁州区",
                        "value": 360902
                    },
                    {
                        "id": 360921,
                        "name": "奉新县",
                        "pid": 360900,
                        "level": 2,
                        "text": "奉新县",
                        "value": 360921
                    },
                    {
                        "id": 360922,
                        "name": "万载县",
                        "pid": 360900,
                        "level": 2,
                        "text": "万载县",
                        "value": 360922
                    },
                    {
                        "id": 360923,
                        "name": "上高县",
                        "pid": 360900,
                        "level": 2,
                        "text": "上高县",
                        "value": 360923
                    },
                    {
                        "id": 360924,
                        "name": "宜丰县",
                        "pid": 360900,
                        "level": 2,
                        "text": "宜丰县",
                        "value": 360924
                    },
                    {
                        "id": 360925,
                        "name": "靖安县",
                        "pid": 360900,
                        "level": 2,
                        "text": "靖安县",
                        "value": 360925
                    },
                    {
                        "id": 360926,
                        "name": "铜鼓县",
                        "pid": 360900,
                        "level": 2,
                        "text": "铜鼓县",
                        "value": 360926
                    },
                    {
                        "id": 360981,
                        "name": "丰城市",
                        "pid": 360900,
                        "level": 2,
                        "text": "丰城市",
                        "value": 360981
                    },
                    {
                        "id": 360982,
                        "name": "樟树市",
                        "pid": 360900,
                        "level": 2,
                        "text": "樟树市",
                        "value": 360982
                    },
                    {
                        "id": 360983,
                        "name": "高安市",
                        "pid": 360900,
                        "level": 2,
                        "text": "高安市",
                        "value": 360983
                    }
                ],
                "text": "宜春市",
                "value": 360900
            },
            {
                "id": 361000,
                "name": "抚州市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 361001,
                        "name": "市辖区",
                        "pid": 361000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 361001
                    },
                    {
                        "id": 361002,
                        "name": "临川区",
                        "pid": 361000,
                        "level": 2,
                        "text": "临川区",
                        "value": 361002
                    },
                    {
                        "id": 361021,
                        "name": "南城县",
                        "pid": 361000,
                        "level": 2,
                        "text": "南城县",
                        "value": 361021
                    },
                    {
                        "id": 361022,
                        "name": "黎川县",
                        "pid": 361000,
                        "level": 2,
                        "text": "黎川县",
                        "value": 361022
                    },
                    {
                        "id": 361023,
                        "name": "南丰县",
                        "pid": 361000,
                        "level": 2,
                        "text": "南丰县",
                        "value": 361023
                    },
                    {
                        "id": 361024,
                        "name": "崇仁县",
                        "pid": 361000,
                        "level": 2,
                        "text": "崇仁县",
                        "value": 361024
                    },
                    {
                        "id": 361025,
                        "name": "乐安县",
                        "pid": 361000,
                        "level": 2,
                        "text": "乐安县",
                        "value": 361025
                    },
                    {
                        "id": 361026,
                        "name": "宜黄县",
                        "pid": 361000,
                        "level": 2,
                        "text": "宜黄县",
                        "value": 361026
                    },
                    {
                        "id": 361027,
                        "name": "金溪县",
                        "pid": 361000,
                        "level": 2,
                        "text": "金溪县",
                        "value": 361027
                    },
                    {
                        "id": 361028,
                        "name": "资溪县",
                        "pid": 361000,
                        "level": 2,
                        "text": "资溪县",
                        "value": 361028
                    },
                    {
                        "id": 361029,
                        "name": "东乡县",
                        "pid": 361000,
                        "level": 2,
                        "text": "东乡县",
                        "value": 361029
                    },
                    {
                        "id": 361030,
                        "name": "广昌县",
                        "pid": 361000,
                        "level": 2,
                        "text": "广昌县",
                        "value": 361030
                    }
                ],
                "text": "抚州市",
                "value": 361000
            },
            {
                "id": 361100,
                "name": "上饶市",
                "pid": 360000,
                "level": 1,
                "children": [
                    {
                        "id": 361101,
                        "name": "市辖区",
                        "pid": 361100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 361101
                    },
                    {
                        "id": 361102,
                        "name": "信州区",
                        "pid": 361100,
                        "level": 2,
                        "text": "信州区",
                        "value": 361102
                    },
                    {
                        "id": 361103,
                        "name": "广丰区",
                        "pid": 361100,
                        "level": 2,
                        "text": "广丰区",
                        "value": 361103
                    },
                    {
                        "id": 361121,
                        "name": "上饶县",
                        "pid": 361100,
                        "level": 2,
                        "text": "上饶县",
                        "value": 361121
                    },
                    {
                        "id": 361123,
                        "name": "玉山县",
                        "pid": 361100,
                        "level": 2,
                        "text": "玉山县",
                        "value": 361123
                    },
                    {
                        "id": 361124,
                        "name": "铅山县",
                        "pid": 361100,
                        "level": 2,
                        "text": "铅山县",
                        "value": 361124
                    },
                    {
                        "id": 361125,
                        "name": "横峰县",
                        "pid": 361100,
                        "level": 2,
                        "text": "横峰县",
                        "value": 361125
                    },
                    {
                        "id": 361126,
                        "name": "弋阳县",
                        "pid": 361100,
                        "level": 2,
                        "text": "弋阳县",
                        "value": 361126
                    },
                    {
                        "id": 361127,
                        "name": "余干县",
                        "pid": 361100,
                        "level": 2,
                        "text": "余干县",
                        "value": 361127
                    },
                    {
                        "id": 361128,
                        "name": "鄱阳县",
                        "pid": 361100,
                        "level": 2,
                        "text": "鄱阳县",
                        "value": 361128
                    },
                    {
                        "id": 361129,
                        "name": "万年县",
                        "pid": 361100,
                        "level": 2,
                        "text": "万年县",
                        "value": 361129
                    },
                    {
                        "id": 361130,
                        "name": "婺源县",
                        "pid": 361100,
                        "level": 2,
                        "text": "婺源县",
                        "value": 361130
                    },
                    {
                        "id": 361181,
                        "name": "德兴市",
                        "pid": 361100,
                        "level": 2,
                        "text": "德兴市",
                        "value": 361181
                    }
                ],
                "text": "上饶市",
                "value": 361100
            }
        ],
        "text": "江西省",
        "value": 360000
    },
    {
        "id": 370000,
        "name": "山东省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 370100,
                "name": "济南市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 370101,
                        "name": "市辖区",
                        "pid": 370100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 370101
                    },
                    {
                        "id": 370102,
                        "name": "历下区",
                        "pid": 370100,
                        "level": 2,
                        "text": "历下区",
                        "value": 370102
                    },
                    {
                        "id": 370103,
                        "name": "市中区",
                        "pid": 370100,
                        "level": 2,
                        "text": "市中区",
                        "value": 370103
                    },
                    {
                        "id": 370104,
                        "name": "槐荫区",
                        "pid": 370100,
                        "level": 2,
                        "text": "槐荫区",
                        "value": 370104
                    },
                    {
                        "id": 370105,
                        "name": "天桥区",
                        "pid": 370100,
                        "level": 2,
                        "text": "天桥区",
                        "value": 370105
                    },
                    {
                        "id": 370112,
                        "name": "历城区",
                        "pid": 370100,
                        "level": 2,
                        "text": "历城区",
                        "value": 370112
                    },
                    {
                        "id": 370113,
                        "name": "长清区",
                        "pid": 370100,
                        "level": 2,
                        "text": "长清区",
                        "value": 370113
                    },
                    {
                        "id": 370124,
                        "name": "平阴县",
                        "pid": 370100,
                        "level": 2,
                        "text": "平阴县",
                        "value": 370124
                    },
                    {
                        "id": 370125,
                        "name": "济阳县",
                        "pid": 370100,
                        "level": 2,
                        "text": "济阳县",
                        "value": 370125
                    },
                    {
                        "id": 370126,
                        "name": "商河县",
                        "pid": 370100,
                        "level": 2,
                        "text": "商河县",
                        "value": 370126
                    },
                    {
                        "id": 370181,
                        "name": "章丘市",
                        "pid": 370100,
                        "level": 2,
                        "text": "章丘市",
                        "value": 370181
                    }
                ],
                "text": "济南市",
                "value": 370100
            },
            {
                "id": 370200,
                "name": "青岛市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 370201,
                        "name": "市辖区",
                        "pid": 370200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 370201
                    },
                    {
                        "id": 370202,
                        "name": "市南区",
                        "pid": 370200,
                        "level": 2,
                        "text": "市南区",
                        "value": 370202
                    },
                    {
                        "id": 370203,
                        "name": "市北区",
                        "pid": 370200,
                        "level": 2,
                        "text": "市北区",
                        "value": 370203
                    },
                    {
                        "id": 370211,
                        "name": "黄岛区",
                        "pid": 370200,
                        "level": 2,
                        "text": "黄岛区",
                        "value": 370211
                    },
                    {
                        "id": 370212,
                        "name": "崂山区",
                        "pid": 370200,
                        "level": 2,
                        "text": "崂山区",
                        "value": 370212
                    },
                    {
                        "id": 370213,
                        "name": "李沧区",
                        "pid": 370200,
                        "level": 2,
                        "text": "李沧区",
                        "value": 370213
                    },
                    {
                        "id": 370214,
                        "name": "城阳区",
                        "pid": 370200,
                        "level": 2,
                        "text": "城阳区",
                        "value": 370214
                    },
                    {
                        "id": 370281,
                        "name": "胶州市",
                        "pid": 370200,
                        "level": 2,
                        "text": "胶州市",
                        "value": 370281
                    },
                    {
                        "id": 370282,
                        "name": "即墨市",
                        "pid": 370200,
                        "level": 2,
                        "text": "即墨市",
                        "value": 370282
                    },
                    {
                        "id": 370283,
                        "name": "平度市",
                        "pid": 370200,
                        "level": 2,
                        "text": "平度市",
                        "value": 370283
                    },
                    {
                        "id": 370285,
                        "name": "莱西市",
                        "pid": 370200,
                        "level": 2,
                        "text": "莱西市",
                        "value": 370285
                    }
                ],
                "text": "青岛市",
                "value": 370200
            },
            {
                "id": 370300,
                "name": "淄博市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 370301,
                        "name": "市辖区",
                        "pid": 370300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 370301
                    },
                    {
                        "id": 370302,
                        "name": "淄川区",
                        "pid": 370300,
                        "level": 2,
                        "text": "淄川区",
                        "value": 370302
                    },
                    {
                        "id": 370303,
                        "name": "张店区",
                        "pid": 370300,
                        "level": 2,
                        "text": "张店区",
                        "value": 370303
                    },
                    {
                        "id": 370304,
                        "name": "博山区",
                        "pid": 370300,
                        "level": 2,
                        "text": "博山区",
                        "value": 370304
                    },
                    {
                        "id": 370305,
                        "name": "临淄区",
                        "pid": 370300,
                        "level": 2,
                        "text": "临淄区",
                        "value": 370305
                    },
                    {
                        "id": 370306,
                        "name": "周村区",
                        "pid": 370300,
                        "level": 2,
                        "text": "周村区",
                        "value": 370306
                    },
                    {
                        "id": 370321,
                        "name": "桓台县",
                        "pid": 370300,
                        "level": 2,
                        "text": "桓台县",
                        "value": 370321
                    },
                    {
                        "id": 370322,
                        "name": "高青县",
                        "pid": 370300,
                        "level": 2,
                        "text": "高青县",
                        "value": 370322
                    },
                    {
                        "id": 370323,
                        "name": "沂源县",
                        "pid": 370300,
                        "level": 2,
                        "text": "沂源县",
                        "value": 370323
                    }
                ],
                "text": "淄博市",
                "value": 370300
            },
            {
                "id": 370400,
                "name": "枣庄市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 370401,
                        "name": "市辖区",
                        "pid": 370400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 370401
                    },
                    {
                        "id": 370402,
                        "name": "市中区",
                        "pid": 370400,
                        "level": 2,
                        "text": "市中区",
                        "value": 370402
                    },
                    {
                        "id": 370403,
                        "name": "薛城区",
                        "pid": 370400,
                        "level": 2,
                        "text": "薛城区",
                        "value": 370403
                    },
                    {
                        "id": 370404,
                        "name": "峄城区",
                        "pid": 370400,
                        "level": 2,
                        "text": "峄城区",
                        "value": 370404
                    },
                    {
                        "id": 370405,
                        "name": "台儿庄区",
                        "pid": 370400,
                        "level": 2,
                        "text": "台儿庄区",
                        "value": 370405
                    },
                    {
                        "id": 370406,
                        "name": "山亭区",
                        "pid": 370400,
                        "level": 2,
                        "text": "山亭区",
                        "value": 370406
                    },
                    {
                        "id": 370481,
                        "name": "滕州市",
                        "pid": 370400,
                        "level": 2,
                        "text": "滕州市",
                        "value": 370481
                    }
                ],
                "text": "枣庄市",
                "value": 370400
            },
            {
                "id": 370500,
                "name": "东营市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 370501,
                        "name": "市辖区",
                        "pid": 370500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 370501
                    },
                    {
                        "id": 370502,
                        "name": "东营区",
                        "pid": 370500,
                        "level": 2,
                        "text": "东营区",
                        "value": 370502
                    },
                    {
                        "id": 370503,
                        "name": "河口区",
                        "pid": 370500,
                        "level": 2,
                        "text": "河口区",
                        "value": 370503
                    },
                    {
                        "id": 370505,
                        "name": "垦利区",
                        "pid": 370500,
                        "level": 2,
                        "text": "垦利区",
                        "value": 370505
                    },
                    {
                        "id": 370522,
                        "name": "利津县",
                        "pid": 370500,
                        "level": 2,
                        "text": "利津县",
                        "value": 370522
                    },
                    {
                        "id": 370523,
                        "name": "广饶县",
                        "pid": 370500,
                        "level": 2,
                        "text": "广饶县",
                        "value": 370523
                    }
                ],
                "text": "东营市",
                "value": 370500
            },
            {
                "id": 370600,
                "name": "烟台市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 370601,
                        "name": "市辖区",
                        "pid": 370600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 370601
                    },
                    {
                        "id": 370602,
                        "name": "芝罘区",
                        "pid": 370600,
                        "level": 2,
                        "text": "芝罘区",
                        "value": 370602
                    },
                    {
                        "id": 370611,
                        "name": "福山区",
                        "pid": 370600,
                        "level": 2,
                        "text": "福山区",
                        "value": 370611
                    },
                    {
                        "id": 370612,
                        "name": "牟平区",
                        "pid": 370600,
                        "level": 2,
                        "text": "牟平区",
                        "value": 370612
                    },
                    {
                        "id": 370613,
                        "name": "莱山区",
                        "pid": 370600,
                        "level": 2,
                        "text": "莱山区",
                        "value": 370613
                    },
                    {
                        "id": 370634,
                        "name": "长岛县",
                        "pid": 370600,
                        "level": 2,
                        "text": "长岛县",
                        "value": 370634
                    },
                    {
                        "id": 370681,
                        "name": "龙口市",
                        "pid": 370600,
                        "level": 2,
                        "text": "龙口市",
                        "value": 370681
                    },
                    {
                        "id": 370682,
                        "name": "莱阳市",
                        "pid": 370600,
                        "level": 2,
                        "text": "莱阳市",
                        "value": 370682
                    },
                    {
                        "id": 370683,
                        "name": "莱州市",
                        "pid": 370600,
                        "level": 2,
                        "text": "莱州市",
                        "value": 370683
                    },
                    {
                        "id": 370684,
                        "name": "蓬莱市",
                        "pid": 370600,
                        "level": 2,
                        "text": "蓬莱市",
                        "value": 370684
                    },
                    {
                        "id": 370685,
                        "name": "招远市",
                        "pid": 370600,
                        "level": 2,
                        "text": "招远市",
                        "value": 370685
                    },
                    {
                        "id": 370686,
                        "name": "栖霞市",
                        "pid": 370600,
                        "level": 2,
                        "text": "栖霞市",
                        "value": 370686
                    },
                    {
                        "id": 370687,
                        "name": "海阳市",
                        "pid": 370600,
                        "level": 2,
                        "text": "海阳市",
                        "value": 370687
                    }
                ],
                "text": "烟台市",
                "value": 370600
            },
            {
                "id": 370700,
                "name": "潍坊市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 370701,
                        "name": "市辖区",
                        "pid": 370700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 370701
                    },
                    {
                        "id": 370702,
                        "name": "潍城区",
                        "pid": 370700,
                        "level": 2,
                        "text": "潍城区",
                        "value": 370702
                    },
                    {
                        "id": 370703,
                        "name": "寒亭区",
                        "pid": 370700,
                        "level": 2,
                        "text": "寒亭区",
                        "value": 370703
                    },
                    {
                        "id": 370704,
                        "name": "坊子区",
                        "pid": 370700,
                        "level": 2,
                        "text": "坊子区",
                        "value": 370704
                    },
                    {
                        "id": 370705,
                        "name": "奎文区",
                        "pid": 370700,
                        "level": 2,
                        "text": "奎文区",
                        "value": 370705
                    },
                    {
                        "id": 370724,
                        "name": "临朐县",
                        "pid": 370700,
                        "level": 2,
                        "text": "临朐县",
                        "value": 370724
                    },
                    {
                        "id": 370725,
                        "name": "昌乐县",
                        "pid": 370700,
                        "level": 2,
                        "text": "昌乐县",
                        "value": 370725
                    },
                    {
                        "id": 370781,
                        "name": "青州市",
                        "pid": 370700,
                        "level": 2,
                        "text": "青州市",
                        "value": 370781
                    },
                    {
                        "id": 370782,
                        "name": "诸城市",
                        "pid": 370700,
                        "level": 2,
                        "text": "诸城市",
                        "value": 370782
                    },
                    {
                        "id": 370783,
                        "name": "寿光市",
                        "pid": 370700,
                        "level": 2,
                        "text": "寿光市",
                        "value": 370783
                    },
                    {
                        "id": 370784,
                        "name": "安丘市",
                        "pid": 370700,
                        "level": 2,
                        "text": "安丘市",
                        "value": 370784
                    },
                    {
                        "id": 370785,
                        "name": "高密市",
                        "pid": 370700,
                        "level": 2,
                        "text": "高密市",
                        "value": 370785
                    },
                    {
                        "id": 370786,
                        "name": "昌邑市",
                        "pid": 370700,
                        "level": 2,
                        "text": "昌邑市",
                        "value": 370786
                    }
                ],
                "text": "潍坊市",
                "value": 370700
            },
            {
                "id": 370800,
                "name": "济宁市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 370801,
                        "name": "市辖区",
                        "pid": 370800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 370801
                    },
                    {
                        "id": 370811,
                        "name": "任城区",
                        "pid": 370800,
                        "level": 2,
                        "text": "任城区",
                        "value": 370811
                    },
                    {
                        "id": 370812,
                        "name": "兖州区",
                        "pid": 370800,
                        "level": 2,
                        "text": "兖州区",
                        "value": 370812
                    },
                    {
                        "id": 370826,
                        "name": "微山县",
                        "pid": 370800,
                        "level": 2,
                        "text": "微山县",
                        "value": 370826
                    },
                    {
                        "id": 370827,
                        "name": "鱼台县",
                        "pid": 370800,
                        "level": 2,
                        "text": "鱼台县",
                        "value": 370827
                    },
                    {
                        "id": 370828,
                        "name": "金乡县",
                        "pid": 370800,
                        "level": 2,
                        "text": "金乡县",
                        "value": 370828
                    },
                    {
                        "id": 370829,
                        "name": "嘉祥县",
                        "pid": 370800,
                        "level": 2,
                        "text": "嘉祥县",
                        "value": 370829
                    },
                    {
                        "id": 370830,
                        "name": "汶上县",
                        "pid": 370800,
                        "level": 2,
                        "text": "汶上县",
                        "value": 370830
                    },
                    {
                        "id": 370831,
                        "name": "泗水县",
                        "pid": 370800,
                        "level": 2,
                        "text": "泗水县",
                        "value": 370831
                    },
                    {
                        "id": 370832,
                        "name": "梁山县",
                        "pid": 370800,
                        "level": 2,
                        "text": "梁山县",
                        "value": 370832
                    },
                    {
                        "id": 370881,
                        "name": "曲阜市",
                        "pid": 370800,
                        "level": 2,
                        "text": "曲阜市",
                        "value": 370881
                    },
                    {
                        "id": 370883,
                        "name": "邹城市",
                        "pid": 370800,
                        "level": 2,
                        "text": "邹城市",
                        "value": 370883
                    }
                ],
                "text": "济宁市",
                "value": 370800
            },
            {
                "id": 370900,
                "name": "泰安市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 370901,
                        "name": "市辖区",
                        "pid": 370900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 370901
                    },
                    {
                        "id": 370902,
                        "name": "泰山区",
                        "pid": 370900,
                        "level": 2,
                        "text": "泰山区",
                        "value": 370902
                    },
                    {
                        "id": 370911,
                        "name": "岱岳区",
                        "pid": 370900,
                        "level": 2,
                        "text": "岱岳区",
                        "value": 370911
                    },
                    {
                        "id": 370921,
                        "name": "宁阳县",
                        "pid": 370900,
                        "level": 2,
                        "text": "宁阳县",
                        "value": 370921
                    },
                    {
                        "id": 370923,
                        "name": "东平县",
                        "pid": 370900,
                        "level": 2,
                        "text": "东平县",
                        "value": 370923
                    },
                    {
                        "id": 370982,
                        "name": "新泰市",
                        "pid": 370900,
                        "level": 2,
                        "text": "新泰市",
                        "value": 370982
                    },
                    {
                        "id": 370983,
                        "name": "肥城市",
                        "pid": 370900,
                        "level": 2,
                        "text": "肥城市",
                        "value": 370983
                    }
                ],
                "text": "泰安市",
                "value": 370900
            },
            {
                "id": 371000,
                "name": "威海市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 371001,
                        "name": "市辖区",
                        "pid": 371000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 371001
                    },
                    {
                        "id": 371002,
                        "name": "环翠区",
                        "pid": 371000,
                        "level": 2,
                        "text": "环翠区",
                        "value": 371002
                    },
                    {
                        "id": 371003,
                        "name": "文登区",
                        "pid": 371000,
                        "level": 2,
                        "text": "文登区",
                        "value": 371003
                    },
                    {
                        "id": 371082,
                        "name": "荣成市",
                        "pid": 371000,
                        "level": 2,
                        "text": "荣成市",
                        "value": 371082
                    },
                    {
                        "id": 371083,
                        "name": "乳山市",
                        "pid": 371000,
                        "level": 2,
                        "text": "乳山市",
                        "value": 371083
                    }
                ],
                "text": "威海市",
                "value": 371000
            },
            {
                "id": 371100,
                "name": "日照市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 371101,
                        "name": "市辖区",
                        "pid": 371100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 371101
                    },
                    {
                        "id": 371102,
                        "name": "东港区",
                        "pid": 371100,
                        "level": 2,
                        "text": "东港区",
                        "value": 371102
                    },
                    {
                        "id": 371103,
                        "name": "岚山区",
                        "pid": 371100,
                        "level": 2,
                        "text": "岚山区",
                        "value": 371103
                    },
                    {
                        "id": 371121,
                        "name": "五莲县",
                        "pid": 371100,
                        "level": 2,
                        "text": "五莲县",
                        "value": 371121
                    },
                    {
                        "id": 371122,
                        "name": "莒县",
                        "pid": 371100,
                        "level": 2,
                        "text": "莒县",
                        "value": 371122
                    }
                ],
                "text": "日照市",
                "value": 371100
            },
            {
                "id": 371200,
                "name": "莱芜市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 371201,
                        "name": "市辖区",
                        "pid": 371200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 371201
                    },
                    {
                        "id": 371202,
                        "name": "莱城区",
                        "pid": 371200,
                        "level": 2,
                        "text": "莱城区",
                        "value": 371202
                    },
                    {
                        "id": 371203,
                        "name": "钢城区",
                        "pid": 371200,
                        "level": 2,
                        "text": "钢城区",
                        "value": 371203
                    }
                ],
                "text": "莱芜市",
                "value": 371200
            },
            {
                "id": 371300,
                "name": "临沂市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 371301,
                        "name": "市辖区",
                        "pid": 371300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 371301
                    },
                    {
                        "id": 371302,
                        "name": "兰山区",
                        "pid": 371300,
                        "level": 2,
                        "text": "兰山区",
                        "value": 371302
                    },
                    {
                        "id": 371311,
                        "name": "罗庄区",
                        "pid": 371300,
                        "level": 2,
                        "text": "罗庄区",
                        "value": 371311
                    },
                    {
                        "id": 371312,
                        "name": "河东区",
                        "pid": 371300,
                        "level": 2,
                        "text": "河东区",
                        "value": 371312
                    },
                    {
                        "id": 371321,
                        "name": "沂南县",
                        "pid": 371300,
                        "level": 2,
                        "text": "沂南县",
                        "value": 371321
                    },
                    {
                        "id": 371322,
                        "name": "郯城县",
                        "pid": 371300,
                        "level": 2,
                        "text": "郯城县",
                        "value": 371322
                    },
                    {
                        "id": 371323,
                        "name": "沂水县",
                        "pid": 371300,
                        "level": 2,
                        "text": "沂水县",
                        "value": 371323
                    },
                    {
                        "id": 371324,
                        "name": "兰陵县",
                        "pid": 371300,
                        "level": 2,
                        "text": "兰陵县",
                        "value": 371324
                    },
                    {
                        "id": 371325,
                        "name": "费县",
                        "pid": 371300,
                        "level": 2,
                        "text": "费县",
                        "value": 371325
                    },
                    {
                        "id": 371326,
                        "name": "平邑县",
                        "pid": 371300,
                        "level": 2,
                        "text": "平邑县",
                        "value": 371326
                    },
                    {
                        "id": 371327,
                        "name": "莒南县",
                        "pid": 371300,
                        "level": 2,
                        "text": "莒南县",
                        "value": 371327
                    },
                    {
                        "id": 371328,
                        "name": "蒙阴县",
                        "pid": 371300,
                        "level": 2,
                        "text": "蒙阴县",
                        "value": 371328
                    },
                    {
                        "id": 371329,
                        "name": "临沭县",
                        "pid": 371300,
                        "level": 2,
                        "text": "临沭县",
                        "value": 371329
                    }
                ],
                "text": "临沂市",
                "value": 371300
            },
            {
                "id": 371400,
                "name": "德州市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 371401,
                        "name": "市辖区",
                        "pid": 371400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 371401
                    },
                    {
                        "id": 371402,
                        "name": "德城区",
                        "pid": 371400,
                        "level": 2,
                        "text": "德城区",
                        "value": 371402
                    },
                    {
                        "id": 371403,
                        "name": "陵城区",
                        "pid": 371400,
                        "level": 2,
                        "text": "陵城区",
                        "value": 371403
                    },
                    {
                        "id": 371422,
                        "name": "宁津县",
                        "pid": 371400,
                        "level": 2,
                        "text": "宁津县",
                        "value": 371422
                    },
                    {
                        "id": 371423,
                        "name": "庆云县",
                        "pid": 371400,
                        "level": 2,
                        "text": "庆云县",
                        "value": 371423
                    },
                    {
                        "id": 371424,
                        "name": "临邑县",
                        "pid": 371400,
                        "level": 2,
                        "text": "临邑县",
                        "value": 371424
                    },
                    {
                        "id": 371425,
                        "name": "齐河县",
                        "pid": 371400,
                        "level": 2,
                        "text": "齐河县",
                        "value": 371425
                    },
                    {
                        "id": 371426,
                        "name": "平原县",
                        "pid": 371400,
                        "level": 2,
                        "text": "平原县",
                        "value": 371426
                    },
                    {
                        "id": 371427,
                        "name": "夏津县",
                        "pid": 371400,
                        "level": 2,
                        "text": "夏津县",
                        "value": 371427
                    },
                    {
                        "id": 371428,
                        "name": "武城县",
                        "pid": 371400,
                        "level": 2,
                        "text": "武城县",
                        "value": 371428
                    },
                    {
                        "id": 371481,
                        "name": "乐陵市",
                        "pid": 371400,
                        "level": 2,
                        "text": "乐陵市",
                        "value": 371481
                    },
                    {
                        "id": 371482,
                        "name": "禹城市",
                        "pid": 371400,
                        "level": 2,
                        "text": "禹城市",
                        "value": 371482
                    }
                ],
                "text": "德州市",
                "value": 371400
            },
            {
                "id": 371500,
                "name": "聊城市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 371501,
                        "name": "市辖区",
                        "pid": 371500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 371501
                    },
                    {
                        "id": 371502,
                        "name": "东昌府区",
                        "pid": 371500,
                        "level": 2,
                        "text": "东昌府区",
                        "value": 371502
                    },
                    {
                        "id": 371521,
                        "name": "阳谷县",
                        "pid": 371500,
                        "level": 2,
                        "text": "阳谷县",
                        "value": 371521
                    },
                    {
                        "id": 371522,
                        "name": "莘县",
                        "pid": 371500,
                        "level": 2,
                        "text": "莘县",
                        "value": 371522
                    },
                    {
                        "id": 371523,
                        "name": "茌平县",
                        "pid": 371500,
                        "level": 2,
                        "text": "茌平县",
                        "value": 371523
                    },
                    {
                        "id": 371524,
                        "name": "东阿县",
                        "pid": 371500,
                        "level": 2,
                        "text": "东阿县",
                        "value": 371524
                    },
                    {
                        "id": 371525,
                        "name": "冠县",
                        "pid": 371500,
                        "level": 2,
                        "text": "冠县",
                        "value": 371525
                    },
                    {
                        "id": 371526,
                        "name": "高唐县",
                        "pid": 371500,
                        "level": 2,
                        "text": "高唐县",
                        "value": 371526
                    },
                    {
                        "id": 371581,
                        "name": "临清市",
                        "pid": 371500,
                        "level": 2,
                        "text": "临清市",
                        "value": 371581
                    }
                ],
                "text": "聊城市",
                "value": 371500
            },
            {
                "id": 371600,
                "name": "滨州市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 371601,
                        "name": "市辖区",
                        "pid": 371600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 371601
                    },
                    {
                        "id": 371602,
                        "name": "滨城区",
                        "pid": 371600,
                        "level": 2,
                        "text": "滨城区",
                        "value": 371602
                    },
                    {
                        "id": 371603,
                        "name": "沾化区",
                        "pid": 371600,
                        "level": 2,
                        "text": "沾化区",
                        "value": 371603
                    },
                    {
                        "id": 371621,
                        "name": "惠民县",
                        "pid": 371600,
                        "level": 2,
                        "text": "惠民县",
                        "value": 371621
                    },
                    {
                        "id": 371622,
                        "name": "阳信县",
                        "pid": 371600,
                        "level": 2,
                        "text": "阳信县",
                        "value": 371622
                    },
                    {
                        "id": 371623,
                        "name": "无棣县",
                        "pid": 371600,
                        "level": 2,
                        "text": "无棣县",
                        "value": 371623
                    },
                    {
                        "id": 371625,
                        "name": "博兴县",
                        "pid": 371600,
                        "level": 2,
                        "text": "博兴县",
                        "value": 371625
                    },
                    {
                        "id": 371626,
                        "name": "邹平县",
                        "pid": 371600,
                        "level": 2,
                        "text": "邹平县",
                        "value": 371626
                    }
                ],
                "text": "滨州市",
                "value": 371600
            },
            {
                "id": 371700,
                "name": "菏泽市",
                "pid": 370000,
                "level": 1,
                "children": [
                    {
                        "id": 371701,
                        "name": "市辖区",
                        "pid": 371700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 371701
                    },
                    {
                        "id": 371702,
                        "name": "牡丹区",
                        "pid": 371700,
                        "level": 2,
                        "text": "牡丹区",
                        "value": 371702
                    },
                    {
                        "id": 371703,
                        "name": "定陶区",
                        "pid": 371700,
                        "level": 2,
                        "text": "定陶区",
                        "value": 371703
                    },
                    {
                        "id": 371721,
                        "name": "曹县",
                        "pid": 371700,
                        "level": 2,
                        "text": "曹县",
                        "value": 371721
                    },
                    {
                        "id": 371722,
                        "name": "单县",
                        "pid": 371700,
                        "level": 2,
                        "text": "单县",
                        "value": 371722
                    },
                    {
                        "id": 371723,
                        "name": "成武县",
                        "pid": 371700,
                        "level": 2,
                        "text": "成武县",
                        "value": 371723
                    },
                    {
                        "id": 371724,
                        "name": "巨野县",
                        "pid": 371700,
                        "level": 2,
                        "text": "巨野县",
                        "value": 371724
                    },
                    {
                        "id": 371725,
                        "name": "郓城县",
                        "pid": 371700,
                        "level": 2,
                        "text": "郓城县",
                        "value": 371725
                    },
                    {
                        "id": 371726,
                        "name": "鄄城县",
                        "pid": 371700,
                        "level": 2,
                        "text": "鄄城县",
                        "value": 371726
                    },
                    {
                        "id": 371728,
                        "name": "东明县",
                        "pid": 371700,
                        "level": 2,
                        "text": "东明县",
                        "value": 371728
                    }
                ],
                "text": "菏泽市",
                "value": 371700
            }
        ],
        "text": "山东省",
        "value": 370000
    },
    {
        "id": 410000,
        "name": "河南省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 410100,
                "name": "郑州市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 410101,
                        "name": "市辖区",
                        "pid": 410100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 410101
                    },
                    {
                        "id": 410102,
                        "name": "中原区",
                        "pid": 410100,
                        "level": 2,
                        "text": "中原区",
                        "value": 410102
                    },
                    {
                        "id": 410103,
                        "name": "二七区",
                        "pid": 410100,
                        "level": 2,
                        "text": "二七区",
                        "value": 410103
                    },
                    {
                        "id": 410104,
                        "name": "管城回族区",
                        "pid": 410100,
                        "level": 2,
                        "text": "管城回族区",
                        "value": 410104
                    },
                    {
                        "id": 410105,
                        "name": "金水区",
                        "pid": 410100,
                        "level": 2,
                        "text": "金水区",
                        "value": 410105
                    },
                    {
                        "id": 410106,
                        "name": "上街区",
                        "pid": 410100,
                        "level": 2,
                        "text": "上街区",
                        "value": 410106
                    },
                    {
                        "id": 410108,
                        "name": "惠济区",
                        "pid": 410100,
                        "level": 2,
                        "text": "惠济区",
                        "value": 410108
                    },
                    {
                        "id": 410122,
                        "name": "中牟县",
                        "pid": 410100,
                        "level": 2,
                        "text": "中牟县",
                        "value": 410122
                    },
                    {
                        "id": 410181,
                        "name": "巩义市",
                        "pid": 410100,
                        "level": 2,
                        "text": "巩义市",
                        "value": 410181
                    },
                    {
                        "id": 410182,
                        "name": "荥阳市",
                        "pid": 410100,
                        "level": 2,
                        "text": "荥阳市",
                        "value": 410182
                    },
                    {
                        "id": 410183,
                        "name": "新密市",
                        "pid": 410100,
                        "level": 2,
                        "text": "新密市",
                        "value": 410183
                    },
                    {
                        "id": 410184,
                        "name": "新郑市",
                        "pid": 410100,
                        "level": 2,
                        "text": "新郑市",
                        "value": 410184
                    },
                    {
                        "id": 410185,
                        "name": "登封市",
                        "pid": 410100,
                        "level": 2,
                        "text": "登封市",
                        "value": 410185
                    }
                ],
                "text": "郑州市",
                "value": 410100
            },
            {
                "id": 410200,
                "name": "开封市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 410201,
                        "name": "市辖区",
                        "pid": 410200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 410201
                    },
                    {
                        "id": 410202,
                        "name": "龙亭区",
                        "pid": 410200,
                        "level": 2,
                        "text": "龙亭区",
                        "value": 410202
                    },
                    {
                        "id": 410203,
                        "name": "顺河回族区",
                        "pid": 410200,
                        "level": 2,
                        "text": "顺河回族区",
                        "value": 410203
                    },
                    {
                        "id": 410204,
                        "name": "鼓楼区",
                        "pid": 410200,
                        "level": 2,
                        "text": "鼓楼区",
                        "value": 410204
                    },
                    {
                        "id": 410205,
                        "name": "禹王台区",
                        "pid": 410200,
                        "level": 2,
                        "text": "禹王台区",
                        "value": 410205
                    },
                    {
                        "id": 410211,
                        "name": "金明区",
                        "pid": 410200,
                        "level": 2,
                        "text": "金明区",
                        "value": 410211
                    },
                    {
                        "id": 410212,
                        "name": "祥符区",
                        "pid": 410200,
                        "level": 2,
                        "text": "祥符区",
                        "value": 410212
                    },
                    {
                        "id": 410221,
                        "name": "杞县",
                        "pid": 410200,
                        "level": 2,
                        "text": "杞县",
                        "value": 410221
                    },
                    {
                        "id": 410222,
                        "name": "通许县",
                        "pid": 410200,
                        "level": 2,
                        "text": "通许县",
                        "value": 410222
                    },
                    {
                        "id": 410223,
                        "name": "尉氏县",
                        "pid": 410200,
                        "level": 2,
                        "text": "尉氏县",
                        "value": 410223
                    },
                    {
                        "id": 410225,
                        "name": "兰考县",
                        "pid": 410200,
                        "level": 2,
                        "text": "兰考县",
                        "value": 410225
                    }
                ],
                "text": "开封市",
                "value": 410200
            },
            {
                "id": 410300,
                "name": "洛阳市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 410301,
                        "name": "市辖区",
                        "pid": 410300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 410301
                    },
                    {
                        "id": 410302,
                        "name": "老城区",
                        "pid": 410300,
                        "level": 2,
                        "text": "老城区",
                        "value": 410302
                    },
                    {
                        "id": 410303,
                        "name": "西工区",
                        "pid": 410300,
                        "level": 2,
                        "text": "西工区",
                        "value": 410303
                    },
                    {
                        "id": 410304,
                        "name": "瀍河回族区",
                        "pid": 410300,
                        "level": 2,
                        "text": "瀍河回族区",
                        "value": 410304
                    },
                    {
                        "id": 410305,
                        "name": "涧西区",
                        "pid": 410300,
                        "level": 2,
                        "text": "涧西区",
                        "value": 410305
                    },
                    {
                        "id": 410306,
                        "name": "吉利区",
                        "pid": 410300,
                        "level": 2,
                        "text": "吉利区",
                        "value": 410306
                    },
                    {
                        "id": 410311,
                        "name": "洛龙区",
                        "pid": 410300,
                        "level": 2,
                        "text": "洛龙区",
                        "value": 410311
                    },
                    {
                        "id": 410322,
                        "name": "孟津县",
                        "pid": 410300,
                        "level": 2,
                        "text": "孟津县",
                        "value": 410322
                    },
                    {
                        "id": 410323,
                        "name": "新安县",
                        "pid": 410300,
                        "level": 2,
                        "text": "新安县",
                        "value": 410323
                    },
                    {
                        "id": 410324,
                        "name": "栾川县",
                        "pid": 410300,
                        "level": 2,
                        "text": "栾川县",
                        "value": 410324
                    },
                    {
                        "id": 410325,
                        "name": "嵩县",
                        "pid": 410300,
                        "level": 2,
                        "text": "嵩县",
                        "value": 410325
                    },
                    {
                        "id": 410326,
                        "name": "汝阳县",
                        "pid": 410300,
                        "level": 2,
                        "text": "汝阳县",
                        "value": 410326
                    },
                    {
                        "id": 410327,
                        "name": "宜阳县",
                        "pid": 410300,
                        "level": 2,
                        "text": "宜阳县",
                        "value": 410327
                    },
                    {
                        "id": 410328,
                        "name": "洛宁县",
                        "pid": 410300,
                        "level": 2,
                        "text": "洛宁县",
                        "value": 410328
                    },
                    {
                        "id": 410329,
                        "name": "伊川县",
                        "pid": 410300,
                        "level": 2,
                        "text": "伊川县",
                        "value": 410329
                    },
                    {
                        "id": 410381,
                        "name": "偃师市",
                        "pid": 410300,
                        "level": 2,
                        "text": "偃师市",
                        "value": 410381
                    }
                ],
                "text": "洛阳市",
                "value": 410300
            },
            {
                "id": 410400,
                "name": "平顶山市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 410401,
                        "name": "市辖区",
                        "pid": 410400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 410401
                    },
                    {
                        "id": 410402,
                        "name": "新华区",
                        "pid": 410400,
                        "level": 2,
                        "text": "新华区",
                        "value": 410402
                    },
                    {
                        "id": 410403,
                        "name": "卫东区",
                        "pid": 410400,
                        "level": 2,
                        "text": "卫东区",
                        "value": 410403
                    },
                    {
                        "id": 410404,
                        "name": "石龙区",
                        "pid": 410400,
                        "level": 2,
                        "text": "石龙区",
                        "value": 410404
                    },
                    {
                        "id": 410411,
                        "name": "湛河区",
                        "pid": 410400,
                        "level": 2,
                        "text": "湛河区",
                        "value": 410411
                    },
                    {
                        "id": 410421,
                        "name": "宝丰县",
                        "pid": 410400,
                        "level": 2,
                        "text": "宝丰县",
                        "value": 410421
                    },
                    {
                        "id": 410422,
                        "name": "叶县",
                        "pid": 410400,
                        "level": 2,
                        "text": "叶县",
                        "value": 410422
                    },
                    {
                        "id": 410423,
                        "name": "鲁山县",
                        "pid": 410400,
                        "level": 2,
                        "text": "鲁山县",
                        "value": 410423
                    },
                    {
                        "id": 410425,
                        "name": "郏县",
                        "pid": 410400,
                        "level": 2,
                        "text": "郏县",
                        "value": 410425
                    },
                    {
                        "id": 410481,
                        "name": "舞钢市",
                        "pid": 410400,
                        "level": 2,
                        "text": "舞钢市",
                        "value": 410481
                    },
                    {
                        "id": 410482,
                        "name": "汝州市",
                        "pid": 410400,
                        "level": 2,
                        "text": "汝州市",
                        "value": 410482
                    }
                ],
                "text": "平顶山市",
                "value": 410400
            },
            {
                "id": 410500,
                "name": "安阳市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 410501,
                        "name": "市辖区",
                        "pid": 410500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 410501
                    },
                    {
                        "id": 410502,
                        "name": "文峰区",
                        "pid": 410500,
                        "level": 2,
                        "text": "文峰区",
                        "value": 410502
                    },
                    {
                        "id": 410503,
                        "name": "北关区",
                        "pid": 410500,
                        "level": 2,
                        "text": "北关区",
                        "value": 410503
                    },
                    {
                        "id": 410505,
                        "name": "殷都区",
                        "pid": 410500,
                        "level": 2,
                        "text": "殷都区",
                        "value": 410505
                    },
                    {
                        "id": 410506,
                        "name": "龙安区",
                        "pid": 410500,
                        "level": 2,
                        "text": "龙安区",
                        "value": 410506
                    },
                    {
                        "id": 410522,
                        "name": "安阳县",
                        "pid": 410500,
                        "level": 2,
                        "text": "安阳县",
                        "value": 410522
                    },
                    {
                        "id": 410523,
                        "name": "汤阴县",
                        "pid": 410500,
                        "level": 2,
                        "text": "汤阴县",
                        "value": 410523
                    },
                    {
                        "id": 410526,
                        "name": "滑县",
                        "pid": 410500,
                        "level": 2,
                        "text": "滑县",
                        "value": 410526
                    },
                    {
                        "id": 410527,
                        "name": "内黄县",
                        "pid": 410500,
                        "level": 2,
                        "text": "内黄县",
                        "value": 410527
                    },
                    {
                        "id": 410581,
                        "name": "林州市",
                        "pid": 410500,
                        "level": 2,
                        "text": "林州市",
                        "value": 410581
                    }
                ],
                "text": "安阳市",
                "value": 410500
            },
            {
                "id": 410600,
                "name": "鹤壁市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 410601,
                        "name": "市辖区",
                        "pid": 410600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 410601
                    },
                    {
                        "id": 410602,
                        "name": "鹤山区",
                        "pid": 410600,
                        "level": 2,
                        "text": "鹤山区",
                        "value": 410602
                    },
                    {
                        "id": 410603,
                        "name": "山城区",
                        "pid": 410600,
                        "level": 2,
                        "text": "山城区",
                        "value": 410603
                    },
                    {
                        "id": 410611,
                        "name": "淇滨区",
                        "pid": 410600,
                        "level": 2,
                        "text": "淇滨区",
                        "value": 410611
                    },
                    {
                        "id": 410621,
                        "name": "浚县",
                        "pid": 410600,
                        "level": 2,
                        "text": "浚县",
                        "value": 410621
                    },
                    {
                        "id": 410622,
                        "name": "淇县",
                        "pid": 410600,
                        "level": 2,
                        "text": "淇县",
                        "value": 410622
                    }
                ],
                "text": "鹤壁市",
                "value": 410600
            },
            {
                "id": 410700,
                "name": "新乡市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 410701,
                        "name": "市辖区",
                        "pid": 410700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 410701
                    },
                    {
                        "id": 410702,
                        "name": "红旗区",
                        "pid": 410700,
                        "level": 2,
                        "text": "红旗区",
                        "value": 410702
                    },
                    {
                        "id": 410703,
                        "name": "卫滨区",
                        "pid": 410700,
                        "level": 2,
                        "text": "卫滨区",
                        "value": 410703
                    },
                    {
                        "id": 410704,
                        "name": "凤泉区",
                        "pid": 410700,
                        "level": 2,
                        "text": "凤泉区",
                        "value": 410704
                    },
                    {
                        "id": 410711,
                        "name": "牧野区",
                        "pid": 410700,
                        "level": 2,
                        "text": "牧野区",
                        "value": 410711
                    },
                    {
                        "id": 410721,
                        "name": "新乡县",
                        "pid": 410700,
                        "level": 2,
                        "text": "新乡县",
                        "value": 410721
                    },
                    {
                        "id": 410724,
                        "name": "获嘉县",
                        "pid": 410700,
                        "level": 2,
                        "text": "获嘉县",
                        "value": 410724
                    },
                    {
                        "id": 410725,
                        "name": "原阳县",
                        "pid": 410700,
                        "level": 2,
                        "text": "原阳县",
                        "value": 410725
                    },
                    {
                        "id": 410726,
                        "name": "延津县",
                        "pid": 410700,
                        "level": 2,
                        "text": "延津县",
                        "value": 410726
                    },
                    {
                        "id": 410727,
                        "name": "封丘县",
                        "pid": 410700,
                        "level": 2,
                        "text": "封丘县",
                        "value": 410727
                    },
                    {
                        "id": 410728,
                        "name": "长垣县",
                        "pid": 410700,
                        "level": 2,
                        "text": "长垣县",
                        "value": 410728
                    },
                    {
                        "id": 410781,
                        "name": "卫辉市",
                        "pid": 410700,
                        "level": 2,
                        "text": "卫辉市",
                        "value": 410781
                    },
                    {
                        "id": 410782,
                        "name": "辉县市",
                        "pid": 410700,
                        "level": 2,
                        "text": "辉县市",
                        "value": 410782
                    }
                ],
                "text": "新乡市",
                "value": 410700
            },
            {
                "id": 410800,
                "name": "焦作市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 410801,
                        "name": "市辖区",
                        "pid": 410800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 410801
                    },
                    {
                        "id": 410802,
                        "name": "解放区",
                        "pid": 410800,
                        "level": 2,
                        "text": "解放区",
                        "value": 410802
                    },
                    {
                        "id": 410803,
                        "name": "中站区",
                        "pid": 410800,
                        "level": 2,
                        "text": "中站区",
                        "value": 410803
                    },
                    {
                        "id": 410804,
                        "name": "马村区",
                        "pid": 410800,
                        "level": 2,
                        "text": "马村区",
                        "value": 410804
                    },
                    {
                        "id": 410811,
                        "name": "山阳区",
                        "pid": 410800,
                        "level": 2,
                        "text": "山阳区",
                        "value": 410811
                    },
                    {
                        "id": 410821,
                        "name": "修武县",
                        "pid": 410800,
                        "level": 2,
                        "text": "修武县",
                        "value": 410821
                    },
                    {
                        "id": 410822,
                        "name": "博爱县",
                        "pid": 410800,
                        "level": 2,
                        "text": "博爱县",
                        "value": 410822
                    },
                    {
                        "id": 410823,
                        "name": "武陟县",
                        "pid": 410800,
                        "level": 2,
                        "text": "武陟县",
                        "value": 410823
                    },
                    {
                        "id": 410825,
                        "name": "温县",
                        "pid": 410800,
                        "level": 2,
                        "text": "温县",
                        "value": 410825
                    },
                    {
                        "id": 410882,
                        "name": "沁阳市",
                        "pid": 410800,
                        "level": 2,
                        "text": "沁阳市",
                        "value": 410882
                    },
                    {
                        "id": 410883,
                        "name": "孟州市",
                        "pid": 410800,
                        "level": 2,
                        "text": "孟州市",
                        "value": 410883
                    }
                ],
                "text": "焦作市",
                "value": 410800
            },
            {
                "id": 410900,
                "name": "濮阳市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 410901,
                        "name": "市辖区",
                        "pid": 410900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 410901
                    },
                    {
                        "id": 410902,
                        "name": "华龙区",
                        "pid": 410900,
                        "level": 2,
                        "text": "华龙区",
                        "value": 410902
                    },
                    {
                        "id": 410922,
                        "name": "清丰县",
                        "pid": 410900,
                        "level": 2,
                        "text": "清丰县",
                        "value": 410922
                    },
                    {
                        "id": 410923,
                        "name": "南乐县",
                        "pid": 410900,
                        "level": 2,
                        "text": "南乐县",
                        "value": 410923
                    },
                    {
                        "id": 410926,
                        "name": "范县",
                        "pid": 410900,
                        "level": 2,
                        "text": "范县",
                        "value": 410926
                    },
                    {
                        "id": 410927,
                        "name": "台前县",
                        "pid": 410900,
                        "level": 2,
                        "text": "台前县",
                        "value": 410927
                    },
                    {
                        "id": 410928,
                        "name": "濮阳县",
                        "pid": 410900,
                        "level": 2,
                        "text": "濮阳县",
                        "value": 410928
                    }
                ],
                "text": "濮阳市",
                "value": 410900
            },
            {
                "id": 411000,
                "name": "许昌市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 411001,
                        "name": "市辖区",
                        "pid": 411000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 411001
                    },
                    {
                        "id": 411002,
                        "name": "魏都区",
                        "pid": 411000,
                        "level": 2,
                        "text": "魏都区",
                        "value": 411002
                    },
                    {
                        "id": 411023,
                        "name": "许昌县",
                        "pid": 411000,
                        "level": 2,
                        "text": "许昌县",
                        "value": 411023
                    },
                    {
                        "id": 411024,
                        "name": "鄢陵县",
                        "pid": 411000,
                        "level": 2,
                        "text": "鄢陵县",
                        "value": 411024
                    },
                    {
                        "id": 411025,
                        "name": "襄城县",
                        "pid": 411000,
                        "level": 2,
                        "text": "襄城县",
                        "value": 411025
                    },
                    {
                        "id": 411081,
                        "name": "禹州市",
                        "pid": 411000,
                        "level": 2,
                        "text": "禹州市",
                        "value": 411081
                    },
                    {
                        "id": 411082,
                        "name": "长葛市",
                        "pid": 411000,
                        "level": 2,
                        "text": "长葛市",
                        "value": 411082
                    }
                ],
                "text": "许昌市",
                "value": 411000
            },
            {
                "id": 411100,
                "name": "漯河市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 411101,
                        "name": "市辖区",
                        "pid": 411100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 411101
                    },
                    {
                        "id": 411102,
                        "name": "源汇区",
                        "pid": 411100,
                        "level": 2,
                        "text": "源汇区",
                        "value": 411102
                    },
                    {
                        "id": 411103,
                        "name": "郾城区",
                        "pid": 411100,
                        "level": 2,
                        "text": "郾城区",
                        "value": 411103
                    },
                    {
                        "id": 411104,
                        "name": "召陵区",
                        "pid": 411100,
                        "level": 2,
                        "text": "召陵区",
                        "value": 411104
                    },
                    {
                        "id": 411121,
                        "name": "舞阳县",
                        "pid": 411100,
                        "level": 2,
                        "text": "舞阳县",
                        "value": 411121
                    },
                    {
                        "id": 411122,
                        "name": "临颍县",
                        "pid": 411100,
                        "level": 2,
                        "text": "临颍县",
                        "value": 411122
                    }
                ],
                "text": "漯河市",
                "value": 411100
            },
            {
                "id": 411200,
                "name": "三门峡市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 411201,
                        "name": "市辖区",
                        "pid": 411200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 411201
                    },
                    {
                        "id": 411202,
                        "name": "湖滨区",
                        "pid": 411200,
                        "level": 2,
                        "text": "湖滨区",
                        "value": 411202
                    },
                    {
                        "id": 411203,
                        "name": "陕州区",
                        "pid": 411200,
                        "level": 2,
                        "text": "陕州区",
                        "value": 411203
                    },
                    {
                        "id": 411221,
                        "name": "渑池县",
                        "pid": 411200,
                        "level": 2,
                        "text": "渑池县",
                        "value": 411221
                    },
                    {
                        "id": 411224,
                        "name": "卢氏县",
                        "pid": 411200,
                        "level": 2,
                        "text": "卢氏县",
                        "value": 411224
                    },
                    {
                        "id": 411281,
                        "name": "义马市",
                        "pid": 411200,
                        "level": 2,
                        "text": "义马市",
                        "value": 411281
                    },
                    {
                        "id": 411282,
                        "name": "灵宝市",
                        "pid": 411200,
                        "level": 2,
                        "text": "灵宝市",
                        "value": 411282
                    }
                ],
                "text": "三门峡市",
                "value": 411200
            },
            {
                "id": 411300,
                "name": "南阳市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 411301,
                        "name": "市辖区",
                        "pid": 411300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 411301
                    },
                    {
                        "id": 411302,
                        "name": "宛城区",
                        "pid": 411300,
                        "level": 2,
                        "text": "宛城区",
                        "value": 411302
                    },
                    {
                        "id": 411303,
                        "name": "卧龙区",
                        "pid": 411300,
                        "level": 2,
                        "text": "卧龙区",
                        "value": 411303
                    },
                    {
                        "id": 411321,
                        "name": "南召县",
                        "pid": 411300,
                        "level": 2,
                        "text": "南召县",
                        "value": 411321
                    },
                    {
                        "id": 411322,
                        "name": "方城县",
                        "pid": 411300,
                        "level": 2,
                        "text": "方城县",
                        "value": 411322
                    },
                    {
                        "id": 411323,
                        "name": "西峡县",
                        "pid": 411300,
                        "level": 2,
                        "text": "西峡县",
                        "value": 411323
                    },
                    {
                        "id": 411324,
                        "name": "镇平县",
                        "pid": 411300,
                        "level": 2,
                        "text": "镇平县",
                        "value": 411324
                    },
                    {
                        "id": 411325,
                        "name": "内乡县",
                        "pid": 411300,
                        "level": 2,
                        "text": "内乡县",
                        "value": 411325
                    },
                    {
                        "id": 411326,
                        "name": "淅川县",
                        "pid": 411300,
                        "level": 2,
                        "text": "淅川县",
                        "value": 411326
                    },
                    {
                        "id": 411327,
                        "name": "社旗县",
                        "pid": 411300,
                        "level": 2,
                        "text": "社旗县",
                        "value": 411327
                    },
                    {
                        "id": 411328,
                        "name": "唐河县",
                        "pid": 411300,
                        "level": 2,
                        "text": "唐河县",
                        "value": 411328
                    },
                    {
                        "id": 411329,
                        "name": "新野县",
                        "pid": 411300,
                        "level": 2,
                        "text": "新野县",
                        "value": 411329
                    },
                    {
                        "id": 411330,
                        "name": "桐柏县",
                        "pid": 411300,
                        "level": 2,
                        "text": "桐柏县",
                        "value": 411330
                    },
                    {
                        "id": 411381,
                        "name": "邓州市",
                        "pid": 411300,
                        "level": 2,
                        "text": "邓州市",
                        "value": 411381
                    }
                ],
                "text": "南阳市",
                "value": 411300
            },
            {
                "id": 411400,
                "name": "商丘市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 411401,
                        "name": "市辖区",
                        "pid": 411400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 411401
                    },
                    {
                        "id": 411402,
                        "name": "梁园区",
                        "pid": 411400,
                        "level": 2,
                        "text": "梁园区",
                        "value": 411402
                    },
                    {
                        "id": 411403,
                        "name": "睢阳区",
                        "pid": 411400,
                        "level": 2,
                        "text": "睢阳区",
                        "value": 411403
                    },
                    {
                        "id": 411421,
                        "name": "民权县",
                        "pid": 411400,
                        "level": 2,
                        "text": "民权县",
                        "value": 411421
                    },
                    {
                        "id": 411422,
                        "name": "睢县",
                        "pid": 411400,
                        "level": 2,
                        "text": "睢县",
                        "value": 411422
                    },
                    {
                        "id": 411423,
                        "name": "宁陵县",
                        "pid": 411400,
                        "level": 2,
                        "text": "宁陵县",
                        "value": 411423
                    },
                    {
                        "id": 411424,
                        "name": "柘城县",
                        "pid": 411400,
                        "level": 2,
                        "text": "柘城县",
                        "value": 411424
                    },
                    {
                        "id": 411425,
                        "name": "虞城县",
                        "pid": 411400,
                        "level": 2,
                        "text": "虞城县",
                        "value": 411425
                    },
                    {
                        "id": 411426,
                        "name": "夏邑县",
                        "pid": 411400,
                        "level": 2,
                        "text": "夏邑县",
                        "value": 411426
                    },
                    {
                        "id": 411481,
                        "name": "永城市",
                        "pid": 411400,
                        "level": 2,
                        "text": "永城市",
                        "value": 411481
                    }
                ],
                "text": "商丘市",
                "value": 411400
            },
            {
                "id": 411500,
                "name": "信阳市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 411501,
                        "name": "市辖区",
                        "pid": 411500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 411501
                    },
                    {
                        "id": 411502,
                        "name": "浉河区",
                        "pid": 411500,
                        "level": 2,
                        "text": "浉河区",
                        "value": 411502
                    },
                    {
                        "id": 411503,
                        "name": "平桥区",
                        "pid": 411500,
                        "level": 2,
                        "text": "平桥区",
                        "value": 411503
                    },
                    {
                        "id": 411521,
                        "name": "罗山县",
                        "pid": 411500,
                        "level": 2,
                        "text": "罗山县",
                        "value": 411521
                    },
                    {
                        "id": 411522,
                        "name": "光山县",
                        "pid": 411500,
                        "level": 2,
                        "text": "光山县",
                        "value": 411522
                    },
                    {
                        "id": 411523,
                        "name": "新县",
                        "pid": 411500,
                        "level": 2,
                        "text": "新县",
                        "value": 411523
                    },
                    {
                        "id": 411524,
                        "name": "商城县",
                        "pid": 411500,
                        "level": 2,
                        "text": "商城县",
                        "value": 411524
                    },
                    {
                        "id": 411525,
                        "name": "固始县",
                        "pid": 411500,
                        "level": 2,
                        "text": "固始县",
                        "value": 411525
                    },
                    {
                        "id": 411526,
                        "name": "潢川县",
                        "pid": 411500,
                        "level": 2,
                        "text": "潢川县",
                        "value": 411526
                    },
                    {
                        "id": 411527,
                        "name": "淮滨县",
                        "pid": 411500,
                        "level": 2,
                        "text": "淮滨县",
                        "value": 411527
                    },
                    {
                        "id": 411528,
                        "name": "息县",
                        "pid": 411500,
                        "level": 2,
                        "text": "息县",
                        "value": 411528
                    }
                ],
                "text": "信阳市",
                "value": 411500
            },
            {
                "id": 411600,
                "name": "周口市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 411601,
                        "name": "市辖区",
                        "pid": 411600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 411601
                    },
                    {
                        "id": 411602,
                        "name": "川汇区",
                        "pid": 411600,
                        "level": 2,
                        "text": "川汇区",
                        "value": 411602
                    },
                    {
                        "id": 411621,
                        "name": "扶沟县",
                        "pid": 411600,
                        "level": 2,
                        "text": "扶沟县",
                        "value": 411621
                    },
                    {
                        "id": 411622,
                        "name": "西华县",
                        "pid": 411600,
                        "level": 2,
                        "text": "西华县",
                        "value": 411622
                    },
                    {
                        "id": 411623,
                        "name": "商水县",
                        "pid": 411600,
                        "level": 2,
                        "text": "商水县",
                        "value": 411623
                    },
                    {
                        "id": 411624,
                        "name": "沈丘县",
                        "pid": 411600,
                        "level": 2,
                        "text": "沈丘县",
                        "value": 411624
                    },
                    {
                        "id": 411625,
                        "name": "郸城县",
                        "pid": 411600,
                        "level": 2,
                        "text": "郸城县",
                        "value": 411625
                    },
                    {
                        "id": 411626,
                        "name": "淮阳县",
                        "pid": 411600,
                        "level": 2,
                        "text": "淮阳县",
                        "value": 411626
                    },
                    {
                        "id": 411627,
                        "name": "太康县",
                        "pid": 411600,
                        "level": 2,
                        "text": "太康县",
                        "value": 411627
                    },
                    {
                        "id": 411628,
                        "name": "鹿邑县",
                        "pid": 411600,
                        "level": 2,
                        "text": "鹿邑县",
                        "value": 411628
                    },
                    {
                        "id": 411681,
                        "name": "项城市",
                        "pid": 411600,
                        "level": 2,
                        "text": "项城市",
                        "value": 411681
                    }
                ],
                "text": "周口市",
                "value": 411600
            },
            {
                "id": 411700,
                "name": "驻马店市",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 411701,
                        "name": "市辖区",
                        "pid": 411700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 411701
                    },
                    {
                        "id": 411702,
                        "name": "驿城区",
                        "pid": 411700,
                        "level": 2,
                        "text": "驿城区",
                        "value": 411702
                    },
                    {
                        "id": 411721,
                        "name": "西平县",
                        "pid": 411700,
                        "level": 2,
                        "text": "西平县",
                        "value": 411721
                    },
                    {
                        "id": 411722,
                        "name": "上蔡县",
                        "pid": 411700,
                        "level": 2,
                        "text": "上蔡县",
                        "value": 411722
                    },
                    {
                        "id": 411723,
                        "name": "平舆县",
                        "pid": 411700,
                        "level": 2,
                        "text": "平舆县",
                        "value": 411723
                    },
                    {
                        "id": 411724,
                        "name": "正阳县",
                        "pid": 411700,
                        "level": 2,
                        "text": "正阳县",
                        "value": 411724
                    },
                    {
                        "id": 411725,
                        "name": "确山县",
                        "pid": 411700,
                        "level": 2,
                        "text": "确山县",
                        "value": 411725
                    },
                    {
                        "id": 411726,
                        "name": "泌阳县",
                        "pid": 411700,
                        "level": 2,
                        "text": "泌阳县",
                        "value": 411726
                    },
                    {
                        "id": 411727,
                        "name": "汝南县",
                        "pid": 411700,
                        "level": 2,
                        "text": "汝南县",
                        "value": 411727
                    },
                    {
                        "id": 411728,
                        "name": "遂平县",
                        "pid": 411700,
                        "level": 2,
                        "text": "遂平县",
                        "value": 411728
                    },
                    {
                        "id": 411729,
                        "name": "新蔡县",
                        "pid": 411700,
                        "level": 2,
                        "text": "新蔡县",
                        "value": 411729
                    }
                ],
                "text": "驻马店市",
                "value": 411700
            },
            {
                "id": 419000,
                "name": "省直辖县级行政区划",
                "pid": 410000,
                "level": 1,
                "children": [
                    {
                        "id": 419001,
                        "name": "济源市",
                        "pid": 419000,
                        "level": 2,
                        "text": "济源市",
                        "value": 419001
                    }
                ],
                "text": "省直辖县级行政区划",
                "value": 419000
            }
        ],
        "text": "河南省",
        "value": 410000
    },
    {
        "id": 420000,
        "name": "湖北省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 420100,
                "name": "武汉市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 420101,
                        "name": "市辖区",
                        "pid": 420100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 420101
                    },
                    {
                        "id": 420102,
                        "name": "江岸区",
                        "pid": 420100,
                        "level": 2,
                        "text": "江岸区",
                        "value": 420102
                    },
                    {
                        "id": 420103,
                        "name": "江汉区",
                        "pid": 420100,
                        "level": 2,
                        "text": "江汉区",
                        "value": 420103
                    },
                    {
                        "id": 420104,
                        "name": "硚口区",
                        "pid": 420100,
                        "level": 2,
                        "text": "硚口区",
                        "value": 420104
                    },
                    {
                        "id": 420105,
                        "name": "汉阳区",
                        "pid": 420100,
                        "level": 2,
                        "text": "汉阳区",
                        "value": 420105
                    },
                    {
                        "id": 420106,
                        "name": "武昌区",
                        "pid": 420100,
                        "level": 2,
                        "text": "武昌区",
                        "value": 420106
                    },
                    {
                        "id": 420107,
                        "name": "青山区",
                        "pid": 420100,
                        "level": 2,
                        "text": "青山区",
                        "value": 420107
                    },
                    {
                        "id": 420111,
                        "name": "洪山区",
                        "pid": 420100,
                        "level": 2,
                        "text": "洪山区",
                        "value": 420111
                    },
                    {
                        "id": 420112,
                        "name": "东西湖区",
                        "pid": 420100,
                        "level": 2,
                        "text": "东西湖区",
                        "value": 420112
                    },
                    {
                        "id": 420113,
                        "name": "汉南区",
                        "pid": 420100,
                        "level": 2,
                        "text": "汉南区",
                        "value": 420113
                    },
                    {
                        "id": 420114,
                        "name": "蔡甸区",
                        "pid": 420100,
                        "level": 2,
                        "text": "蔡甸区",
                        "value": 420114
                    },
                    {
                        "id": 420115,
                        "name": "江夏区",
                        "pid": 420100,
                        "level": 2,
                        "text": "江夏区",
                        "value": 420115
                    },
                    {
                        "id": 420116,
                        "name": "黄陂区",
                        "pid": 420100,
                        "level": 2,
                        "text": "黄陂区",
                        "value": 420116
                    },
                    {
                        "id": 420117,
                        "name": "新洲区",
                        "pid": 420100,
                        "level": 2,
                        "text": "新洲区",
                        "value": 420117
                    }
                ],
                "text": "武汉市",
                "value": 420100
            },
            {
                "id": 420200,
                "name": "黄石市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 420201,
                        "name": "市辖区",
                        "pid": 420200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 420201
                    },
                    {
                        "id": 420202,
                        "name": "黄石港区",
                        "pid": 420200,
                        "level": 2,
                        "text": "黄石港区",
                        "value": 420202
                    },
                    {
                        "id": 420203,
                        "name": "西塞山区",
                        "pid": 420200,
                        "level": 2,
                        "text": "西塞山区",
                        "value": 420203
                    },
                    {
                        "id": 420204,
                        "name": "下陆区",
                        "pid": 420200,
                        "level": 2,
                        "text": "下陆区",
                        "value": 420204
                    },
                    {
                        "id": 420205,
                        "name": "铁山区",
                        "pid": 420200,
                        "level": 2,
                        "text": "铁山区",
                        "value": 420205
                    },
                    {
                        "id": 420222,
                        "name": "阳新县",
                        "pid": 420200,
                        "level": 2,
                        "text": "阳新县",
                        "value": 420222
                    },
                    {
                        "id": 420281,
                        "name": "大冶市",
                        "pid": 420200,
                        "level": 2,
                        "text": "大冶市",
                        "value": 420281
                    }
                ],
                "text": "黄石市",
                "value": 420200
            },
            {
                "id": 420300,
                "name": "十堰市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 420301,
                        "name": "市辖区",
                        "pid": 420300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 420301
                    },
                    {
                        "id": 420302,
                        "name": "茅箭区",
                        "pid": 420300,
                        "level": 2,
                        "text": "茅箭区",
                        "value": 420302
                    },
                    {
                        "id": 420303,
                        "name": "张湾区",
                        "pid": 420300,
                        "level": 2,
                        "text": "张湾区",
                        "value": 420303
                    },
                    {
                        "id": 420304,
                        "name": "郧阳区",
                        "pid": 420300,
                        "level": 2,
                        "text": "郧阳区",
                        "value": 420304
                    },
                    {
                        "id": 420322,
                        "name": "郧西县",
                        "pid": 420300,
                        "level": 2,
                        "text": "郧西县",
                        "value": 420322
                    },
                    {
                        "id": 420323,
                        "name": "竹山县",
                        "pid": 420300,
                        "level": 2,
                        "text": "竹山县",
                        "value": 420323
                    },
                    {
                        "id": 420324,
                        "name": "竹溪县",
                        "pid": 420300,
                        "level": 2,
                        "text": "竹溪县",
                        "value": 420324
                    },
                    {
                        "id": 420325,
                        "name": "房县",
                        "pid": 420300,
                        "level": 2,
                        "text": "房县",
                        "value": 420325
                    },
                    {
                        "id": 420381,
                        "name": "丹江口市",
                        "pid": 420300,
                        "level": 2,
                        "text": "丹江口市",
                        "value": 420381
                    }
                ],
                "text": "十堰市",
                "value": 420300
            },
            {
                "id": 420500,
                "name": "宜昌市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 420501,
                        "name": "市辖区",
                        "pid": 420500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 420501
                    },
                    {
                        "id": 420502,
                        "name": "西陵区",
                        "pid": 420500,
                        "level": 2,
                        "text": "西陵区",
                        "value": 420502
                    },
                    {
                        "id": 420503,
                        "name": "伍家岗区",
                        "pid": 420500,
                        "level": 2,
                        "text": "伍家岗区",
                        "value": 420503
                    },
                    {
                        "id": 420504,
                        "name": "点军区",
                        "pid": 420500,
                        "level": 2,
                        "text": "点军区",
                        "value": 420504
                    },
                    {
                        "id": 420505,
                        "name": "猇亭区",
                        "pid": 420500,
                        "level": 2,
                        "text": "猇亭区",
                        "value": 420505
                    },
                    {
                        "id": 420506,
                        "name": "夷陵区",
                        "pid": 420500,
                        "level": 2,
                        "text": "夷陵区",
                        "value": 420506
                    },
                    {
                        "id": 420525,
                        "name": "远安县",
                        "pid": 420500,
                        "level": 2,
                        "text": "远安县",
                        "value": 420525
                    },
                    {
                        "id": 420526,
                        "name": "兴山县",
                        "pid": 420500,
                        "level": 2,
                        "text": "兴山县",
                        "value": 420526
                    },
                    {
                        "id": 420527,
                        "name": "秭归县",
                        "pid": 420500,
                        "level": 2,
                        "text": "秭归县",
                        "value": 420527
                    },
                    {
                        "id": 420528,
                        "name": "长阳土家族自治县",
                        "pid": 420500,
                        "level": 2,
                        "text": "长阳土家族自治县",
                        "value": 420528
                    },
                    {
                        "id": 420529,
                        "name": "五峰土家族自治县",
                        "pid": 420500,
                        "level": 2,
                        "text": "五峰土家族自治县",
                        "value": 420529
                    },
                    {
                        "id": 420581,
                        "name": "宜都市",
                        "pid": 420500,
                        "level": 2,
                        "text": "宜都市",
                        "value": 420581
                    },
                    {
                        "id": 420582,
                        "name": "当阳市",
                        "pid": 420500,
                        "level": 2,
                        "text": "当阳市",
                        "value": 420582
                    },
                    {
                        "id": 420583,
                        "name": "枝江市",
                        "pid": 420500,
                        "level": 2,
                        "text": "枝江市",
                        "value": 420583
                    }
                ],
                "text": "宜昌市",
                "value": 420500
            },
            {
                "id": 420600,
                "name": "襄阳市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 420601,
                        "name": "市辖区",
                        "pid": 420600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 420601
                    },
                    {
                        "id": 420602,
                        "name": "襄城区",
                        "pid": 420600,
                        "level": 2,
                        "text": "襄城区",
                        "value": 420602
                    },
                    {
                        "id": 420606,
                        "name": "樊城区",
                        "pid": 420600,
                        "level": 2,
                        "text": "樊城区",
                        "value": 420606
                    },
                    {
                        "id": 420607,
                        "name": "襄州区",
                        "pid": 420600,
                        "level": 2,
                        "text": "襄州区",
                        "value": 420607
                    },
                    {
                        "id": 420624,
                        "name": "南漳县",
                        "pid": 420600,
                        "level": 2,
                        "text": "南漳县",
                        "value": 420624
                    },
                    {
                        "id": 420625,
                        "name": "谷城县",
                        "pid": 420600,
                        "level": 2,
                        "text": "谷城县",
                        "value": 420625
                    },
                    {
                        "id": 420626,
                        "name": "保康县",
                        "pid": 420600,
                        "level": 2,
                        "text": "保康县",
                        "value": 420626
                    },
                    {
                        "id": 420682,
                        "name": "老河口市",
                        "pid": 420600,
                        "level": 2,
                        "text": "老河口市",
                        "value": 420682
                    },
                    {
                        "id": 420683,
                        "name": "枣阳市",
                        "pid": 420600,
                        "level": 2,
                        "text": "枣阳市",
                        "value": 420683
                    },
                    {
                        "id": 420684,
                        "name": "宜城市",
                        "pid": 420600,
                        "level": 2,
                        "text": "宜城市",
                        "value": 420684
                    }
                ],
                "text": "襄阳市",
                "value": 420600
            },
            {
                "id": 420700,
                "name": "鄂州市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 420701,
                        "name": "市辖区",
                        "pid": 420700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 420701
                    },
                    {
                        "id": 420702,
                        "name": "梁子湖区",
                        "pid": 420700,
                        "level": 2,
                        "text": "梁子湖区",
                        "value": 420702
                    },
                    {
                        "id": 420703,
                        "name": "华容区",
                        "pid": 420700,
                        "level": 2,
                        "text": "华容区",
                        "value": 420703
                    },
                    {
                        "id": 420704,
                        "name": "鄂城区",
                        "pid": 420700,
                        "level": 2,
                        "text": "鄂城区",
                        "value": 420704
                    }
                ],
                "text": "鄂州市",
                "value": 420700
            },
            {
                "id": 420800,
                "name": "荆门市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 420801,
                        "name": "市辖区",
                        "pid": 420800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 420801
                    },
                    {
                        "id": 420802,
                        "name": "东宝区",
                        "pid": 420800,
                        "level": 2,
                        "text": "东宝区",
                        "value": 420802
                    },
                    {
                        "id": 420804,
                        "name": "掇刀区",
                        "pid": 420800,
                        "level": 2,
                        "text": "掇刀区",
                        "value": 420804
                    },
                    {
                        "id": 420821,
                        "name": "京山县",
                        "pid": 420800,
                        "level": 2,
                        "text": "京山县",
                        "value": 420821
                    },
                    {
                        "id": 420822,
                        "name": "沙洋县",
                        "pid": 420800,
                        "level": 2,
                        "text": "沙洋县",
                        "value": 420822
                    },
                    {
                        "id": 420881,
                        "name": "钟祥市",
                        "pid": 420800,
                        "level": 2,
                        "text": "钟祥市",
                        "value": 420881
                    }
                ],
                "text": "荆门市",
                "value": 420800
            },
            {
                "id": 420900,
                "name": "孝感市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 420901,
                        "name": "市辖区",
                        "pid": 420900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 420901
                    },
                    {
                        "id": 420902,
                        "name": "孝南区",
                        "pid": 420900,
                        "level": 2,
                        "text": "孝南区",
                        "value": 420902
                    },
                    {
                        "id": 420921,
                        "name": "孝昌县",
                        "pid": 420900,
                        "level": 2,
                        "text": "孝昌县",
                        "value": 420921
                    },
                    {
                        "id": 420922,
                        "name": "大悟县",
                        "pid": 420900,
                        "level": 2,
                        "text": "大悟县",
                        "value": 420922
                    },
                    {
                        "id": 420923,
                        "name": "云梦县",
                        "pid": 420900,
                        "level": 2,
                        "text": "云梦县",
                        "value": 420923
                    },
                    {
                        "id": 420981,
                        "name": "应城市",
                        "pid": 420900,
                        "level": 2,
                        "text": "应城市",
                        "value": 420981
                    },
                    {
                        "id": 420982,
                        "name": "安陆市",
                        "pid": 420900,
                        "level": 2,
                        "text": "安陆市",
                        "value": 420982
                    },
                    {
                        "id": 420984,
                        "name": "汉川市",
                        "pid": 420900,
                        "level": 2,
                        "text": "汉川市",
                        "value": 420984
                    }
                ],
                "text": "孝感市",
                "value": 420900
            },
            {
                "id": 421000,
                "name": "荆州市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 421001,
                        "name": "市辖区",
                        "pid": 421000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 421001
                    },
                    {
                        "id": 421002,
                        "name": "沙市区",
                        "pid": 421000,
                        "level": 2,
                        "text": "沙市区",
                        "value": 421002
                    },
                    {
                        "id": 421003,
                        "name": "荆州区",
                        "pid": 421000,
                        "level": 2,
                        "text": "荆州区",
                        "value": 421003
                    },
                    {
                        "id": 421022,
                        "name": "公安县",
                        "pid": 421000,
                        "level": 2,
                        "text": "公安县",
                        "value": 421022
                    },
                    {
                        "id": 421023,
                        "name": "监利县",
                        "pid": 421000,
                        "level": 2,
                        "text": "监利县",
                        "value": 421023
                    },
                    {
                        "id": 421024,
                        "name": "江陵县",
                        "pid": 421000,
                        "level": 2,
                        "text": "江陵县",
                        "value": 421024
                    },
                    {
                        "id": 421081,
                        "name": "石首市",
                        "pid": 421000,
                        "level": 2,
                        "text": "石首市",
                        "value": 421081
                    },
                    {
                        "id": 421083,
                        "name": "洪湖市",
                        "pid": 421000,
                        "level": 2,
                        "text": "洪湖市",
                        "value": 421083
                    },
                    {
                        "id": 421087,
                        "name": "松滋市",
                        "pid": 421000,
                        "level": 2,
                        "text": "松滋市",
                        "value": 421087
                    }
                ],
                "text": "荆州市",
                "value": 421000
            },
            {
                "id": 421100,
                "name": "黄冈市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 421101,
                        "name": "市辖区",
                        "pid": 421100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 421101
                    },
                    {
                        "id": 421102,
                        "name": "黄州区",
                        "pid": 421100,
                        "level": 2,
                        "text": "黄州区",
                        "value": 421102
                    },
                    {
                        "id": 421121,
                        "name": "团风县",
                        "pid": 421100,
                        "level": 2,
                        "text": "团风县",
                        "value": 421121
                    },
                    {
                        "id": 421122,
                        "name": "红安县",
                        "pid": 421100,
                        "level": 2,
                        "text": "红安县",
                        "value": 421122
                    },
                    {
                        "id": 421123,
                        "name": "罗田县",
                        "pid": 421100,
                        "level": 2,
                        "text": "罗田县",
                        "value": 421123
                    },
                    {
                        "id": 421124,
                        "name": "英山县",
                        "pid": 421100,
                        "level": 2,
                        "text": "英山县",
                        "value": 421124
                    },
                    {
                        "id": 421125,
                        "name": "浠水县",
                        "pid": 421100,
                        "level": 2,
                        "text": "浠水县",
                        "value": 421125
                    },
                    {
                        "id": 421126,
                        "name": "蕲春县",
                        "pid": 421100,
                        "level": 2,
                        "text": "蕲春县",
                        "value": 421126
                    },
                    {
                        "id": 421127,
                        "name": "黄梅县",
                        "pid": 421100,
                        "level": 2,
                        "text": "黄梅县",
                        "value": 421127
                    },
                    {
                        "id": 421181,
                        "name": "麻城市",
                        "pid": 421100,
                        "level": 2,
                        "text": "麻城市",
                        "value": 421181
                    },
                    {
                        "id": 421182,
                        "name": "武穴市",
                        "pid": 421100,
                        "level": 2,
                        "text": "武穴市",
                        "value": 421182
                    }
                ],
                "text": "黄冈市",
                "value": 421100
            },
            {
                "id": 421200,
                "name": "咸宁市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 421201,
                        "name": "市辖区",
                        "pid": 421200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 421201
                    },
                    {
                        "id": 421202,
                        "name": "咸安区",
                        "pid": 421200,
                        "level": 2,
                        "text": "咸安区",
                        "value": 421202
                    },
                    {
                        "id": 421221,
                        "name": "嘉鱼县",
                        "pid": 421200,
                        "level": 2,
                        "text": "嘉鱼县",
                        "value": 421221
                    },
                    {
                        "id": 421222,
                        "name": "通城县",
                        "pid": 421200,
                        "level": 2,
                        "text": "通城县",
                        "value": 421222
                    },
                    {
                        "id": 421223,
                        "name": "崇阳县",
                        "pid": 421200,
                        "level": 2,
                        "text": "崇阳县",
                        "value": 421223
                    },
                    {
                        "id": 421224,
                        "name": "通山县",
                        "pid": 421200,
                        "level": 2,
                        "text": "通山县",
                        "value": 421224
                    },
                    {
                        "id": 421281,
                        "name": "赤壁市",
                        "pid": 421200,
                        "level": 2,
                        "text": "赤壁市",
                        "value": 421281
                    }
                ],
                "text": "咸宁市",
                "value": 421200
            },
            {
                "id": 421300,
                "name": "随州市",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 421301,
                        "name": "市辖区",
                        "pid": 421300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 421301
                    },
                    {
                        "id": 421303,
                        "name": "曾都区",
                        "pid": 421300,
                        "level": 2,
                        "text": "曾都区",
                        "value": 421303
                    },
                    {
                        "id": 421321,
                        "name": "随县",
                        "pid": 421300,
                        "level": 2,
                        "text": "随县",
                        "value": 421321
                    },
                    {
                        "id": 421381,
                        "name": "广水市",
                        "pid": 421300,
                        "level": 2,
                        "text": "广水市",
                        "value": 421381
                    }
                ],
                "text": "随州市",
                "value": 421300
            },
            {
                "id": 422800,
                "name": "恩施土家族苗族自治州",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 422801,
                        "name": "恩施市",
                        "pid": 422800,
                        "level": 2,
                        "text": "恩施市",
                        "value": 422801
                    },
                    {
                        "id": 422802,
                        "name": "利川市",
                        "pid": 422800,
                        "level": 2,
                        "text": "利川市",
                        "value": 422802
                    },
                    {
                        "id": 422822,
                        "name": "建始县",
                        "pid": 422800,
                        "level": 2,
                        "text": "建始县",
                        "value": 422822
                    },
                    {
                        "id": 422823,
                        "name": "巴东县",
                        "pid": 422800,
                        "level": 2,
                        "text": "巴东县",
                        "value": 422823
                    },
                    {
                        "id": 422825,
                        "name": "宣恩县",
                        "pid": 422800,
                        "level": 2,
                        "text": "宣恩县",
                        "value": 422825
                    },
                    {
                        "id": 422826,
                        "name": "咸丰县",
                        "pid": 422800,
                        "level": 2,
                        "text": "咸丰县",
                        "value": 422826
                    },
                    {
                        "id": 422827,
                        "name": "来凤县",
                        "pid": 422800,
                        "level": 2,
                        "text": "来凤县",
                        "value": 422827
                    },
                    {
                        "id": 422828,
                        "name": "鹤峰县",
                        "pid": 422800,
                        "level": 2,
                        "text": "鹤峰县",
                        "value": 422828
                    }
                ],
                "text": "恩施土家族苗族自治州",
                "value": 422800
            },
            {
                "id": 429000,
                "name": "省直辖县级行政区划",
                "pid": 420000,
                "level": 1,
                "children": [
                    {
                        "id": 429004,
                        "name": "仙桃市",
                        "pid": 429000,
                        "level": 2,
                        "text": "仙桃市",
                        "value": 429004
                    },
                    {
                        "id": 429005,
                        "name": "潜江市",
                        "pid": 429000,
                        "level": 2,
                        "text": "潜江市",
                        "value": 429005
                    },
                    {
                        "id": 429006,
                        "name": "天门市",
                        "pid": 429000,
                        "level": 2,
                        "text": "天门市",
                        "value": 429006
                    },
                    {
                        "id": 429021,
                        "name": "神农架林区",
                        "pid": 429000,
                        "level": 2,
                        "text": "神农架林区",
                        "value": 429021
                    }
                ],
                "text": "省直辖县级行政区划",
                "value": 429000
            }
        ],
        "text": "湖北省",
        "value": 420000
    },
    {
        "id": 430000,
        "name": "湖南省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 430100,
                "name": "长沙市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 430101,
                        "name": "市辖区",
                        "pid": 430100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 430101
                    },
                    {
                        "id": 430102,
                        "name": "芙蓉区",
                        "pid": 430100,
                        "level": 2,
                        "text": "芙蓉区",
                        "value": 430102
                    },
                    {
                        "id": 430103,
                        "name": "天心区",
                        "pid": 430100,
                        "level": 2,
                        "text": "天心区",
                        "value": 430103
                    },
                    {
                        "id": 430104,
                        "name": "岳麓区",
                        "pid": 430100,
                        "level": 2,
                        "text": "岳麓区",
                        "value": 430104
                    },
                    {
                        "id": 430105,
                        "name": "开福区",
                        "pid": 430100,
                        "level": 2,
                        "text": "开福区",
                        "value": 430105
                    },
                    {
                        "id": 430111,
                        "name": "雨花区",
                        "pid": 430100,
                        "level": 2,
                        "text": "雨花区",
                        "value": 430111
                    },
                    {
                        "id": 430112,
                        "name": "望城区",
                        "pid": 430100,
                        "level": 2,
                        "text": "望城区",
                        "value": 430112
                    },
                    {
                        "id": 430121,
                        "name": "长沙县",
                        "pid": 430100,
                        "level": 2,
                        "text": "长沙县",
                        "value": 430121
                    },
                    {
                        "id": 430124,
                        "name": "宁乡县",
                        "pid": 430100,
                        "level": 2,
                        "text": "宁乡县",
                        "value": 430124
                    },
                    {
                        "id": 430181,
                        "name": "浏阳市",
                        "pid": 430100,
                        "level": 2,
                        "text": "浏阳市",
                        "value": 430181
                    }
                ],
                "text": "长沙市",
                "value": 430100
            },
            {
                "id": 430200,
                "name": "株洲市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 430201,
                        "name": "市辖区",
                        "pid": 430200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 430201
                    },
                    {
                        "id": 430202,
                        "name": "荷塘区",
                        "pid": 430200,
                        "level": 2,
                        "text": "荷塘区",
                        "value": 430202
                    },
                    {
                        "id": 430203,
                        "name": "芦淞区",
                        "pid": 430200,
                        "level": 2,
                        "text": "芦淞区",
                        "value": 430203
                    },
                    {
                        "id": 430204,
                        "name": "石峰区",
                        "pid": 430200,
                        "level": 2,
                        "text": "石峰区",
                        "value": 430204
                    },
                    {
                        "id": 430211,
                        "name": "天元区",
                        "pid": 430200,
                        "level": 2,
                        "text": "天元区",
                        "value": 430211
                    },
                    {
                        "id": 430221,
                        "name": "株洲县",
                        "pid": 430200,
                        "level": 2,
                        "text": "株洲县",
                        "value": 430221
                    },
                    {
                        "id": 430223,
                        "name": "攸县",
                        "pid": 430200,
                        "level": 2,
                        "text": "攸县",
                        "value": 430223
                    },
                    {
                        "id": 430224,
                        "name": "茶陵县",
                        "pid": 430200,
                        "level": 2,
                        "text": "茶陵县",
                        "value": 430224
                    },
                    {
                        "id": 430225,
                        "name": "炎陵县",
                        "pid": 430200,
                        "level": 2,
                        "text": "炎陵县",
                        "value": 430225
                    },
                    {
                        "id": 430281,
                        "name": "醴陵市",
                        "pid": 430200,
                        "level": 2,
                        "text": "醴陵市",
                        "value": 430281
                    }
                ],
                "text": "株洲市",
                "value": 430200
            },
            {
                "id": 430300,
                "name": "湘潭市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 430301,
                        "name": "市辖区",
                        "pid": 430300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 430301
                    },
                    {
                        "id": 430302,
                        "name": "雨湖区",
                        "pid": 430300,
                        "level": 2,
                        "text": "雨湖区",
                        "value": 430302
                    },
                    {
                        "id": 430304,
                        "name": "岳塘区",
                        "pid": 430300,
                        "level": 2,
                        "text": "岳塘区",
                        "value": 430304
                    },
                    {
                        "id": 430321,
                        "name": "湘潭县",
                        "pid": 430300,
                        "level": 2,
                        "text": "湘潭县",
                        "value": 430321
                    },
                    {
                        "id": 430381,
                        "name": "湘乡市",
                        "pid": 430300,
                        "level": 2,
                        "text": "湘乡市",
                        "value": 430381
                    },
                    {
                        "id": 430382,
                        "name": "韶山市",
                        "pid": 430300,
                        "level": 2,
                        "text": "韶山市",
                        "value": 430382
                    }
                ],
                "text": "湘潭市",
                "value": 430300
            },
            {
                "id": 430400,
                "name": "衡阳市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 430401,
                        "name": "市辖区",
                        "pid": 430400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 430401
                    },
                    {
                        "id": 430405,
                        "name": "珠晖区",
                        "pid": 430400,
                        "level": 2,
                        "text": "珠晖区",
                        "value": 430405
                    },
                    {
                        "id": 430406,
                        "name": "雁峰区",
                        "pid": 430400,
                        "level": 2,
                        "text": "雁峰区",
                        "value": 430406
                    },
                    {
                        "id": 430407,
                        "name": "石鼓区",
                        "pid": 430400,
                        "level": 2,
                        "text": "石鼓区",
                        "value": 430407
                    },
                    {
                        "id": 430408,
                        "name": "蒸湘区",
                        "pid": 430400,
                        "level": 2,
                        "text": "蒸湘区",
                        "value": 430408
                    },
                    {
                        "id": 430412,
                        "name": "南岳区",
                        "pid": 430400,
                        "level": 2,
                        "text": "南岳区",
                        "value": 430412
                    },
                    {
                        "id": 430421,
                        "name": "衡阳县",
                        "pid": 430400,
                        "level": 2,
                        "text": "衡阳县",
                        "value": 430421
                    },
                    {
                        "id": 430422,
                        "name": "衡南县",
                        "pid": 430400,
                        "level": 2,
                        "text": "衡南县",
                        "value": 430422
                    },
                    {
                        "id": 430423,
                        "name": "衡山县",
                        "pid": 430400,
                        "level": 2,
                        "text": "衡山县",
                        "value": 430423
                    },
                    {
                        "id": 430424,
                        "name": "衡东县",
                        "pid": 430400,
                        "level": 2,
                        "text": "衡东县",
                        "value": 430424
                    },
                    {
                        "id": 430426,
                        "name": "祁东县",
                        "pid": 430400,
                        "level": 2,
                        "text": "祁东县",
                        "value": 430426
                    },
                    {
                        "id": 430481,
                        "name": "耒阳市",
                        "pid": 430400,
                        "level": 2,
                        "text": "耒阳市",
                        "value": 430481
                    },
                    {
                        "id": 430482,
                        "name": "常宁市",
                        "pid": 430400,
                        "level": 2,
                        "text": "常宁市",
                        "value": 430482
                    }
                ],
                "text": "衡阳市",
                "value": 430400
            },
            {
                "id": 430500,
                "name": "邵阳市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 430501,
                        "name": "市辖区",
                        "pid": 430500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 430501
                    },
                    {
                        "id": 430502,
                        "name": "双清区",
                        "pid": 430500,
                        "level": 2,
                        "text": "双清区",
                        "value": 430502
                    },
                    {
                        "id": 430503,
                        "name": "大祥区",
                        "pid": 430500,
                        "level": 2,
                        "text": "大祥区",
                        "value": 430503
                    },
                    {
                        "id": 430511,
                        "name": "北塔区",
                        "pid": 430500,
                        "level": 2,
                        "text": "北塔区",
                        "value": 430511
                    },
                    {
                        "id": 430521,
                        "name": "邵东县",
                        "pid": 430500,
                        "level": 2,
                        "text": "邵东县",
                        "value": 430521
                    },
                    {
                        "id": 430522,
                        "name": "新邵县",
                        "pid": 430500,
                        "level": 2,
                        "text": "新邵县",
                        "value": 430522
                    },
                    {
                        "id": 430523,
                        "name": "邵阳县",
                        "pid": 430500,
                        "level": 2,
                        "text": "邵阳县",
                        "value": 430523
                    },
                    {
                        "id": 430524,
                        "name": "隆回县",
                        "pid": 430500,
                        "level": 2,
                        "text": "隆回县",
                        "value": 430524
                    },
                    {
                        "id": 430525,
                        "name": "洞口县",
                        "pid": 430500,
                        "level": 2,
                        "text": "洞口县",
                        "value": 430525
                    },
                    {
                        "id": 430527,
                        "name": "绥宁县",
                        "pid": 430500,
                        "level": 2,
                        "text": "绥宁县",
                        "value": 430527
                    },
                    {
                        "id": 430528,
                        "name": "新宁县",
                        "pid": 430500,
                        "level": 2,
                        "text": "新宁县",
                        "value": 430528
                    },
                    {
                        "id": 430529,
                        "name": "城步苗族自治县",
                        "pid": 430500,
                        "level": 2,
                        "text": "城步苗族自治县",
                        "value": 430529
                    },
                    {
                        "id": 430581,
                        "name": "武冈市",
                        "pid": 430500,
                        "level": 2,
                        "text": "武冈市",
                        "value": 430581
                    }
                ],
                "text": "邵阳市",
                "value": 430500
            },
            {
                "id": 430600,
                "name": "岳阳市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 430601,
                        "name": "市辖区",
                        "pid": 430600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 430601
                    },
                    {
                        "id": 430602,
                        "name": "岳阳楼区",
                        "pid": 430600,
                        "level": 2,
                        "text": "岳阳楼区",
                        "value": 430602
                    },
                    {
                        "id": 430603,
                        "name": "云溪区",
                        "pid": 430600,
                        "level": 2,
                        "text": "云溪区",
                        "value": 430603
                    },
                    {
                        "id": 430611,
                        "name": "君山区",
                        "pid": 430600,
                        "level": 2,
                        "text": "君山区",
                        "value": 430611
                    },
                    {
                        "id": 430621,
                        "name": "岳阳县",
                        "pid": 430600,
                        "level": 2,
                        "text": "岳阳县",
                        "value": 430621
                    },
                    {
                        "id": 430623,
                        "name": "华容县",
                        "pid": 430600,
                        "level": 2,
                        "text": "华容县",
                        "value": 430623
                    },
                    {
                        "id": 430624,
                        "name": "湘阴县",
                        "pid": 430600,
                        "level": 2,
                        "text": "湘阴县",
                        "value": 430624
                    },
                    {
                        "id": 430626,
                        "name": "平江县",
                        "pid": 430600,
                        "level": 2,
                        "text": "平江县",
                        "value": 430626
                    },
                    {
                        "id": 430681,
                        "name": "汨罗市",
                        "pid": 430600,
                        "level": 2,
                        "text": "汨罗市",
                        "value": 430681
                    },
                    {
                        "id": 430682,
                        "name": "临湘市",
                        "pid": 430600,
                        "level": 2,
                        "text": "临湘市",
                        "value": 430682
                    }
                ],
                "text": "岳阳市",
                "value": 430600
            },
            {
                "id": 430700,
                "name": "常德市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 430701,
                        "name": "市辖区",
                        "pid": 430700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 430701
                    },
                    {
                        "id": 430702,
                        "name": "武陵区",
                        "pid": 430700,
                        "level": 2,
                        "text": "武陵区",
                        "value": 430702
                    },
                    {
                        "id": 430703,
                        "name": "鼎城区",
                        "pid": 430700,
                        "level": 2,
                        "text": "鼎城区",
                        "value": 430703
                    },
                    {
                        "id": 430721,
                        "name": "安乡县",
                        "pid": 430700,
                        "level": 2,
                        "text": "安乡县",
                        "value": 430721
                    },
                    {
                        "id": 430722,
                        "name": "汉寿县",
                        "pid": 430700,
                        "level": 2,
                        "text": "汉寿县",
                        "value": 430722
                    },
                    {
                        "id": 430723,
                        "name": "澧县",
                        "pid": 430700,
                        "level": 2,
                        "text": "澧县",
                        "value": 430723
                    },
                    {
                        "id": 430724,
                        "name": "临澧县",
                        "pid": 430700,
                        "level": 2,
                        "text": "临澧县",
                        "value": 430724
                    },
                    {
                        "id": 430725,
                        "name": "桃源县",
                        "pid": 430700,
                        "level": 2,
                        "text": "桃源县",
                        "value": 430725
                    },
                    {
                        "id": 430726,
                        "name": "石门县",
                        "pid": 430700,
                        "level": 2,
                        "text": "石门县",
                        "value": 430726
                    },
                    {
                        "id": 430781,
                        "name": "津市市",
                        "pid": 430700,
                        "level": 2,
                        "text": "津市市",
                        "value": 430781
                    }
                ],
                "text": "常德市",
                "value": 430700
            },
            {
                "id": 430800,
                "name": "张家界市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 430801,
                        "name": "市辖区",
                        "pid": 430800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 430801
                    },
                    {
                        "id": 430802,
                        "name": "永定区",
                        "pid": 430800,
                        "level": 2,
                        "text": "永定区",
                        "value": 430802
                    },
                    {
                        "id": 430811,
                        "name": "武陵源区",
                        "pid": 430800,
                        "level": 2,
                        "text": "武陵源区",
                        "value": 430811
                    },
                    {
                        "id": 430821,
                        "name": "慈利县",
                        "pid": 430800,
                        "level": 2,
                        "text": "慈利县",
                        "value": 430821
                    },
                    {
                        "id": 430822,
                        "name": "桑植县",
                        "pid": 430800,
                        "level": 2,
                        "text": "桑植县",
                        "value": 430822
                    }
                ],
                "text": "张家界市",
                "value": 430800
            },
            {
                "id": 430900,
                "name": "益阳市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 430901,
                        "name": "市辖区",
                        "pid": 430900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 430901
                    },
                    {
                        "id": 430902,
                        "name": "资阳区",
                        "pid": 430900,
                        "level": 2,
                        "text": "资阳区",
                        "value": 430902
                    },
                    {
                        "id": 430903,
                        "name": "赫山区",
                        "pid": 430900,
                        "level": 2,
                        "text": "赫山区",
                        "value": 430903
                    },
                    {
                        "id": 430921,
                        "name": "南县",
                        "pid": 430900,
                        "level": 2,
                        "text": "南县",
                        "value": 430921
                    },
                    {
                        "id": 430922,
                        "name": "桃江县",
                        "pid": 430900,
                        "level": 2,
                        "text": "桃江县",
                        "value": 430922
                    },
                    {
                        "id": 430923,
                        "name": "安化县",
                        "pid": 430900,
                        "level": 2,
                        "text": "安化县",
                        "value": 430923
                    },
                    {
                        "id": 430981,
                        "name": "沅江市",
                        "pid": 430900,
                        "level": 2,
                        "text": "沅江市",
                        "value": 430981
                    }
                ],
                "text": "益阳市",
                "value": 430900
            },
            {
                "id": 431000,
                "name": "郴州市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 431001,
                        "name": "市辖区",
                        "pid": 431000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 431001
                    },
                    {
                        "id": 431002,
                        "name": "北湖区",
                        "pid": 431000,
                        "level": 2,
                        "text": "北湖区",
                        "value": 431002
                    },
                    {
                        "id": 431003,
                        "name": "苏仙区",
                        "pid": 431000,
                        "level": 2,
                        "text": "苏仙区",
                        "value": 431003
                    },
                    {
                        "id": 431021,
                        "name": "桂阳县",
                        "pid": 431000,
                        "level": 2,
                        "text": "桂阳县",
                        "value": 431021
                    },
                    {
                        "id": 431022,
                        "name": "宜章县",
                        "pid": 431000,
                        "level": 2,
                        "text": "宜章县",
                        "value": 431022
                    },
                    {
                        "id": 431023,
                        "name": "永兴县",
                        "pid": 431000,
                        "level": 2,
                        "text": "永兴县",
                        "value": 431023
                    },
                    {
                        "id": 431024,
                        "name": "嘉禾县",
                        "pid": 431000,
                        "level": 2,
                        "text": "嘉禾县",
                        "value": 431024
                    },
                    {
                        "id": 431025,
                        "name": "临武县",
                        "pid": 431000,
                        "level": 2,
                        "text": "临武县",
                        "value": 431025
                    },
                    {
                        "id": 431026,
                        "name": "汝城县",
                        "pid": 431000,
                        "level": 2,
                        "text": "汝城县",
                        "value": 431026
                    },
                    {
                        "id": 431027,
                        "name": "桂东县",
                        "pid": 431000,
                        "level": 2,
                        "text": "桂东县",
                        "value": 431027
                    },
                    {
                        "id": 431028,
                        "name": "安仁县",
                        "pid": 431000,
                        "level": 2,
                        "text": "安仁县",
                        "value": 431028
                    },
                    {
                        "id": 431081,
                        "name": "资兴市",
                        "pid": 431000,
                        "level": 2,
                        "text": "资兴市",
                        "value": 431081
                    }
                ],
                "text": "郴州市",
                "value": 431000
            },
            {
                "id": 431100,
                "name": "永州市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 431101,
                        "name": "市辖区",
                        "pid": 431100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 431101
                    },
                    {
                        "id": 431102,
                        "name": "零陵区",
                        "pid": 431100,
                        "level": 2,
                        "text": "零陵区",
                        "value": 431102
                    },
                    {
                        "id": 431103,
                        "name": "冷水滩区",
                        "pid": 431100,
                        "level": 2,
                        "text": "冷水滩区",
                        "value": 431103
                    },
                    {
                        "id": 431121,
                        "name": "祁阳县",
                        "pid": 431100,
                        "level": 2,
                        "text": "祁阳县",
                        "value": 431121
                    },
                    {
                        "id": 431122,
                        "name": "东安县",
                        "pid": 431100,
                        "level": 2,
                        "text": "东安县",
                        "value": 431122
                    },
                    {
                        "id": 431123,
                        "name": "双牌县",
                        "pid": 431100,
                        "level": 2,
                        "text": "双牌县",
                        "value": 431123
                    },
                    {
                        "id": 431124,
                        "name": "道县",
                        "pid": 431100,
                        "level": 2,
                        "text": "道县",
                        "value": 431124
                    },
                    {
                        "id": 431125,
                        "name": "江永县",
                        "pid": 431100,
                        "level": 2,
                        "text": "江永县",
                        "value": 431125
                    },
                    {
                        "id": 431126,
                        "name": "宁远县",
                        "pid": 431100,
                        "level": 2,
                        "text": "宁远县",
                        "value": 431126
                    },
                    {
                        "id": 431127,
                        "name": "蓝山县",
                        "pid": 431100,
                        "level": 2,
                        "text": "蓝山县",
                        "value": 431127
                    },
                    {
                        "id": 431128,
                        "name": "新田县",
                        "pid": 431100,
                        "level": 2,
                        "text": "新田县",
                        "value": 431128
                    },
                    {
                        "id": 431129,
                        "name": "江华瑶族自治县",
                        "pid": 431100,
                        "level": 2,
                        "text": "江华瑶族自治县",
                        "value": 431129
                    }
                ],
                "text": "永州市",
                "value": 431100
            },
            {
                "id": 431200,
                "name": "怀化市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 431201,
                        "name": "市辖区",
                        "pid": 431200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 431201
                    },
                    {
                        "id": 431202,
                        "name": "鹤城区",
                        "pid": 431200,
                        "level": 2,
                        "text": "鹤城区",
                        "value": 431202
                    },
                    {
                        "id": 431221,
                        "name": "中方县",
                        "pid": 431200,
                        "level": 2,
                        "text": "中方县",
                        "value": 431221
                    },
                    {
                        "id": 431222,
                        "name": "沅陵县",
                        "pid": 431200,
                        "level": 2,
                        "text": "沅陵县",
                        "value": 431222
                    },
                    {
                        "id": 431223,
                        "name": "辰溪县",
                        "pid": 431200,
                        "level": 2,
                        "text": "辰溪县",
                        "value": 431223
                    },
                    {
                        "id": 431224,
                        "name": "溆浦县",
                        "pid": 431200,
                        "level": 2,
                        "text": "溆浦县",
                        "value": 431224
                    },
                    {
                        "id": 431225,
                        "name": "会同县",
                        "pid": 431200,
                        "level": 2,
                        "text": "会同县",
                        "value": 431225
                    },
                    {
                        "id": 431226,
                        "name": "麻阳苗族自治县",
                        "pid": 431200,
                        "level": 2,
                        "text": "麻阳苗族自治县",
                        "value": 431226
                    },
                    {
                        "id": 431227,
                        "name": "新晃侗族自治县",
                        "pid": 431200,
                        "level": 2,
                        "text": "新晃侗族自治县",
                        "value": 431227
                    },
                    {
                        "id": 431228,
                        "name": "芷江侗族自治县",
                        "pid": 431200,
                        "level": 2,
                        "text": "芷江侗族自治县",
                        "value": 431228
                    },
                    {
                        "id": 431229,
                        "name": "靖州苗族侗族自治县",
                        "pid": 431200,
                        "level": 2,
                        "text": "靖州苗族侗族自治县",
                        "value": 431229
                    },
                    {
                        "id": 431230,
                        "name": "通道侗族自治县",
                        "pid": 431200,
                        "level": 2,
                        "text": "通道侗族自治县",
                        "value": 431230
                    },
                    {
                        "id": 431281,
                        "name": "洪江市",
                        "pid": 431200,
                        "level": 2,
                        "text": "洪江市",
                        "value": 431281
                    }
                ],
                "text": "怀化市",
                "value": 431200
            },
            {
                "id": 431300,
                "name": "娄底市",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 431301,
                        "name": "市辖区",
                        "pid": 431300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 431301
                    },
                    {
                        "id": 431302,
                        "name": "娄星区",
                        "pid": 431300,
                        "level": 2,
                        "text": "娄星区",
                        "value": 431302
                    },
                    {
                        "id": 431321,
                        "name": "双峰县",
                        "pid": 431300,
                        "level": 2,
                        "text": "双峰县",
                        "value": 431321
                    },
                    {
                        "id": 431322,
                        "name": "新化县",
                        "pid": 431300,
                        "level": 2,
                        "text": "新化县",
                        "value": 431322
                    },
                    {
                        "id": 431381,
                        "name": "冷水江市",
                        "pid": 431300,
                        "level": 2,
                        "text": "冷水江市",
                        "value": 431381
                    },
                    {
                        "id": 431382,
                        "name": "涟源市",
                        "pid": 431300,
                        "level": 2,
                        "text": "涟源市",
                        "value": 431382
                    }
                ],
                "text": "娄底市",
                "value": 431300
            },
            {
                "id": 433100,
                "name": "湘西土家族苗族自治州",
                "pid": 430000,
                "level": 1,
                "children": [
                    {
                        "id": 433101,
                        "name": "吉首市",
                        "pid": 433100,
                        "level": 2,
                        "text": "吉首市",
                        "value": 433101
                    },
                    {
                        "id": 433122,
                        "name": "泸溪县",
                        "pid": 433100,
                        "level": 2,
                        "text": "泸溪县",
                        "value": 433122
                    },
                    {
                        "id": 433123,
                        "name": "凤凰县",
                        "pid": 433100,
                        "level": 2,
                        "text": "凤凰县",
                        "value": 433123
                    },
                    {
                        "id": 433124,
                        "name": "花垣县",
                        "pid": 433100,
                        "level": 2,
                        "text": "花垣县",
                        "value": 433124
                    },
                    {
                        "id": 433125,
                        "name": "保靖县",
                        "pid": 433100,
                        "level": 2,
                        "text": "保靖县",
                        "value": 433125
                    },
                    {
                        "id": 433126,
                        "name": "古丈县",
                        "pid": 433100,
                        "level": 2,
                        "text": "古丈县",
                        "value": 433126
                    },
                    {
                        "id": 433127,
                        "name": "永顺县",
                        "pid": 433100,
                        "level": 2,
                        "text": "永顺县",
                        "value": 433127
                    },
                    {
                        "id": 433130,
                        "name": "龙山县",
                        "pid": 433100,
                        "level": 2,
                        "text": "龙山县",
                        "value": 433130
                    }
                ],
                "text": "湘西土家族苗族自治州",
                "value": 433100
            }
        ],
        "text": "湖南省",
        "value": 430000
    },
    {
        "id": 440000,
        "name": "广东省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 440100,
                "name": "广州市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 440101,
                        "name": "市辖区",
                        "pid": 440100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 440101
                    },
                    {
                        "id": 440103,
                        "name": "荔湾区",
                        "pid": 440100,
                        "level": 2,
                        "text": "荔湾区",
                        "value": 440103
                    },
                    {
                        "id": 440104,
                        "name": "越秀区",
                        "pid": 440100,
                        "level": 2,
                        "text": "越秀区",
                        "value": 440104
                    },
                    {
                        "id": 440105,
                        "name": "海珠区",
                        "pid": 440100,
                        "level": 2,
                        "text": "海珠区",
                        "value": 440105
                    },
                    {
                        "id": 440106,
                        "name": "天河区",
                        "pid": 440100,
                        "level": 2,
                        "text": "天河区",
                        "value": 440106
                    },
                    {
                        "id": 440111,
                        "name": "白云区",
                        "pid": 440100,
                        "level": 2,
                        "text": "白云区",
                        "value": 440111
                    },
                    {
                        "id": 440112,
                        "name": "黄埔区",
                        "pid": 440100,
                        "level": 2,
                        "text": "黄埔区",
                        "value": 440112
                    },
                    {
                        "id": 440113,
                        "name": "番禺区",
                        "pid": 440100,
                        "level": 2,
                        "text": "番禺区",
                        "value": 440113
                    },
                    {
                        "id": 440114,
                        "name": "花都区",
                        "pid": 440100,
                        "level": 2,
                        "text": "花都区",
                        "value": 440114
                    },
                    {
                        "id": 440115,
                        "name": "南沙区",
                        "pid": 440100,
                        "level": 2,
                        "text": "南沙区",
                        "value": 440115
                    },
                    {
                        "id": 440117,
                        "name": "从化区",
                        "pid": 440100,
                        "level": 2,
                        "text": "从化区",
                        "value": 440117
                    },
                    {
                        "id": 440118,
                        "name": "增城区",
                        "pid": 440100,
                        "level": 2,
                        "text": "增城区",
                        "value": 440118
                    }
                ],
                "text": "广州市",
                "value": 440100
            },
            {
                "id": 440200,
                "name": "韶关市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 440201,
                        "name": "市辖区",
                        "pid": 440200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 440201
                    },
                    {
                        "id": 440203,
                        "name": "武江区",
                        "pid": 440200,
                        "level": 2,
                        "text": "武江区",
                        "value": 440203
                    },
                    {
                        "id": 440204,
                        "name": "浈江区",
                        "pid": 440200,
                        "level": 2,
                        "text": "浈江区",
                        "value": 440204
                    },
                    {
                        "id": 440205,
                        "name": "曲江区",
                        "pid": 440200,
                        "level": 2,
                        "text": "曲江区",
                        "value": 440205
                    },
                    {
                        "id": 440222,
                        "name": "始兴县",
                        "pid": 440200,
                        "level": 2,
                        "text": "始兴县",
                        "value": 440222
                    },
                    {
                        "id": 440224,
                        "name": "仁化县",
                        "pid": 440200,
                        "level": 2,
                        "text": "仁化县",
                        "value": 440224
                    },
                    {
                        "id": 440229,
                        "name": "翁源县",
                        "pid": 440200,
                        "level": 2,
                        "text": "翁源县",
                        "value": 440229
                    },
                    {
                        "id": 440232,
                        "name": "乳源瑶族自治县",
                        "pid": 440200,
                        "level": 2,
                        "text": "乳源瑶族自治县",
                        "value": 440232
                    },
                    {
                        "id": 440233,
                        "name": "新丰县",
                        "pid": 440200,
                        "level": 2,
                        "text": "新丰县",
                        "value": 440233
                    },
                    {
                        "id": 440281,
                        "name": "乐昌市",
                        "pid": 440200,
                        "level": 2,
                        "text": "乐昌市",
                        "value": 440281
                    },
                    {
                        "id": 440282,
                        "name": "南雄市",
                        "pid": 440200,
                        "level": 2,
                        "text": "南雄市",
                        "value": 440282
                    }
                ],
                "text": "韶关市",
                "value": 440200
            },
            {
                "id": 440300,
                "name": "深圳市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 440301,
                        "name": "市辖区",
                        "pid": 440300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 440301
                    },
                    {
                        "id": 440303,
                        "name": "罗湖区",
                        "pid": 440300,
                        "level": 2,
                        "text": "罗湖区",
                        "value": 440303
                    },
                    {
                        "id": 440304,
                        "name": "福田区",
                        "pid": 440300,
                        "level": 2,
                        "text": "福田区",
                        "value": 440304
                    },
                    {
                        "id": 440305,
                        "name": "南山区",
                        "pid": 440300,
                        "level": 2,
                        "text": "南山区",
                        "value": 440305
                    },
                    {
                        "id": 440306,
                        "name": "宝安区",
                        "pid": 440300,
                        "level": 2,
                        "text": "宝安区",
                        "value": 440306
                    },
                    {
                        "id": 440307,
                        "name": "龙岗区",
                        "pid": 440300,
                        "level": 2,
                        "text": "龙岗区",
                        "value": 440307
                    },
                    {
                        "id": 440308,
                        "name": "盐田区",
                        "pid": 440300,
                        "level": 2,
                        "text": "盐田区",
                        "value": 440308
                    }
                ],
                "text": "深圳市",
                "value": 440300
            },
            {
                "id": 440400,
                "name": "珠海市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 440401,
                        "name": "市辖区",
                        "pid": 440400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 440401
                    },
                    {
                        "id": 440402,
                        "name": "香洲区",
                        "pid": 440400,
                        "level": 2,
                        "text": "香洲区",
                        "value": 440402
                    },
                    {
                        "id": 440403,
                        "name": "斗门区",
                        "pid": 440400,
                        "level": 2,
                        "text": "斗门区",
                        "value": 440403
                    },
                    {
                        "id": 440404,
                        "name": "金湾区",
                        "pid": 440400,
                        "level": 2,
                        "text": "金湾区",
                        "value": 440404
                    }
                ],
                "text": "珠海市",
                "value": 440400
            },
            {
                "id": 440500,
                "name": "汕头市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 440501,
                        "name": "市辖区",
                        "pid": 440500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 440501
                    },
                    {
                        "id": 440507,
                        "name": "龙湖区",
                        "pid": 440500,
                        "level": 2,
                        "text": "龙湖区",
                        "value": 440507
                    },
                    {
                        "id": 440511,
                        "name": "金平区",
                        "pid": 440500,
                        "level": 2,
                        "text": "金平区",
                        "value": 440511
                    },
                    {
                        "id": 440512,
                        "name": "濠江区",
                        "pid": 440500,
                        "level": 2,
                        "text": "濠江区",
                        "value": 440512
                    },
                    {
                        "id": 440513,
                        "name": "潮阳区",
                        "pid": 440500,
                        "level": 2,
                        "text": "潮阳区",
                        "value": 440513
                    },
                    {
                        "id": 440514,
                        "name": "潮南区",
                        "pid": 440500,
                        "level": 2,
                        "text": "潮南区",
                        "value": 440514
                    },
                    {
                        "id": 440515,
                        "name": "澄海区",
                        "pid": 440500,
                        "level": 2,
                        "text": "澄海区",
                        "value": 440515
                    },
                    {
                        "id": 440523,
                        "name": "南澳县",
                        "pid": 440500,
                        "level": 2,
                        "text": "南澳县",
                        "value": 440523
                    }
                ],
                "text": "汕头市",
                "value": 440500
            },
            {
                "id": 440600,
                "name": "佛山市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 440601,
                        "name": "市辖区",
                        "pid": 440600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 440601
                    },
                    {
                        "id": 440604,
                        "name": "禅城区",
                        "pid": 440600,
                        "level": 2,
                        "text": "禅城区",
                        "value": 440604
                    },
                    {
                        "id": 440605,
                        "name": "南海区",
                        "pid": 440600,
                        "level": 2,
                        "text": "南海区",
                        "value": 440605
                    },
                    {
                        "id": 440606,
                        "name": "顺德区",
                        "pid": 440600,
                        "level": 2,
                        "text": "顺德区",
                        "value": 440606
                    },
                    {
                        "id": 440607,
                        "name": "三水区",
                        "pid": 440600,
                        "level": 2,
                        "text": "三水区",
                        "value": 440607
                    },
                    {
                        "id": 440608,
                        "name": "高明区",
                        "pid": 440600,
                        "level": 2,
                        "text": "高明区",
                        "value": 440608
                    }
                ],
                "text": "佛山市",
                "value": 440600
            },
            {
                "id": 440700,
                "name": "江门市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 440701,
                        "name": "市辖区",
                        "pid": 440700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 440701
                    },
                    {
                        "id": 440703,
                        "name": "蓬江区",
                        "pid": 440700,
                        "level": 2,
                        "text": "蓬江区",
                        "value": 440703
                    },
                    {
                        "id": 440704,
                        "name": "江海区",
                        "pid": 440700,
                        "level": 2,
                        "text": "江海区",
                        "value": 440704
                    },
                    {
                        "id": 440705,
                        "name": "新会区",
                        "pid": 440700,
                        "level": 2,
                        "text": "新会区",
                        "value": 440705
                    },
                    {
                        "id": 440781,
                        "name": "台山市",
                        "pid": 440700,
                        "level": 2,
                        "text": "台山市",
                        "value": 440781
                    },
                    {
                        "id": 440783,
                        "name": "开平市",
                        "pid": 440700,
                        "level": 2,
                        "text": "开平市",
                        "value": 440783
                    },
                    {
                        "id": 440784,
                        "name": "鹤山市",
                        "pid": 440700,
                        "level": 2,
                        "text": "鹤山市",
                        "value": 440784
                    },
                    {
                        "id": 440785,
                        "name": "恩平市",
                        "pid": 440700,
                        "level": 2,
                        "text": "恩平市",
                        "value": 440785
                    }
                ],
                "text": "江门市",
                "value": 440700
            },
            {
                "id": 440800,
                "name": "湛江市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 440801,
                        "name": "市辖区",
                        "pid": 440800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 440801
                    },
                    {
                        "id": 440802,
                        "name": "赤坎区",
                        "pid": 440800,
                        "level": 2,
                        "text": "赤坎区",
                        "value": 440802
                    },
                    {
                        "id": 440803,
                        "name": "霞山区",
                        "pid": 440800,
                        "level": 2,
                        "text": "霞山区",
                        "value": 440803
                    },
                    {
                        "id": 440804,
                        "name": "坡头区",
                        "pid": 440800,
                        "level": 2,
                        "text": "坡头区",
                        "value": 440804
                    },
                    {
                        "id": 440811,
                        "name": "麻章区",
                        "pid": 440800,
                        "level": 2,
                        "text": "麻章区",
                        "value": 440811
                    },
                    {
                        "id": 440823,
                        "name": "遂溪县",
                        "pid": 440800,
                        "level": 2,
                        "text": "遂溪县",
                        "value": 440823
                    },
                    {
                        "id": 440825,
                        "name": "徐闻县",
                        "pid": 440800,
                        "level": 2,
                        "text": "徐闻县",
                        "value": 440825
                    },
                    {
                        "id": 440881,
                        "name": "廉江市",
                        "pid": 440800,
                        "level": 2,
                        "text": "廉江市",
                        "value": 440881
                    },
                    {
                        "id": 440882,
                        "name": "雷州市",
                        "pid": 440800,
                        "level": 2,
                        "text": "雷州市",
                        "value": 440882
                    },
                    {
                        "id": 440883,
                        "name": "吴川市",
                        "pid": 440800,
                        "level": 2,
                        "text": "吴川市",
                        "value": 440883
                    }
                ],
                "text": "湛江市",
                "value": 440800
            },
            {
                "id": 440900,
                "name": "茂名市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 440901,
                        "name": "市辖区",
                        "pid": 440900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 440901
                    },
                    {
                        "id": 440902,
                        "name": "茂南区",
                        "pid": 440900,
                        "level": 2,
                        "text": "茂南区",
                        "value": 440902
                    },
                    {
                        "id": 440904,
                        "name": "电白区",
                        "pid": 440900,
                        "level": 2,
                        "text": "电白区",
                        "value": 440904
                    },
                    {
                        "id": 440981,
                        "name": "高州市",
                        "pid": 440900,
                        "level": 2,
                        "text": "高州市",
                        "value": 440981
                    },
                    {
                        "id": 440982,
                        "name": "化州市",
                        "pid": 440900,
                        "level": 2,
                        "text": "化州市",
                        "value": 440982
                    },
                    {
                        "id": 440983,
                        "name": "信宜市",
                        "pid": 440900,
                        "level": 2,
                        "text": "信宜市",
                        "value": 440983
                    }
                ],
                "text": "茂名市",
                "value": 440900
            },
            {
                "id": 441200,
                "name": "肇庆市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 441201,
                        "name": "市辖区",
                        "pid": 441200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 441201
                    },
                    {
                        "id": 441202,
                        "name": "端州区",
                        "pid": 441200,
                        "level": 2,
                        "text": "端州区",
                        "value": 441202
                    },
                    {
                        "id": 441203,
                        "name": "鼎湖区",
                        "pid": 441200,
                        "level": 2,
                        "text": "鼎湖区",
                        "value": 441203
                    },
                    {
                        "id": 441204,
                        "name": "高要区",
                        "pid": 441200,
                        "level": 2,
                        "text": "高要区",
                        "value": 441204
                    },
                    {
                        "id": 441223,
                        "name": "广宁县",
                        "pid": 441200,
                        "level": 2,
                        "text": "广宁县",
                        "value": 441223
                    },
                    {
                        "id": 441224,
                        "name": "怀集县",
                        "pid": 441200,
                        "level": 2,
                        "text": "怀集县",
                        "value": 441224
                    },
                    {
                        "id": 441225,
                        "name": "封开县",
                        "pid": 441200,
                        "level": 2,
                        "text": "封开县",
                        "value": 441225
                    },
                    {
                        "id": 441226,
                        "name": "德庆县",
                        "pid": 441200,
                        "level": 2,
                        "text": "德庆县",
                        "value": 441226
                    },
                    {
                        "id": 441284,
                        "name": "四会市",
                        "pid": 441200,
                        "level": 2,
                        "text": "四会市",
                        "value": 441284
                    }
                ],
                "text": "肇庆市",
                "value": 441200
            },
            {
                "id": 441300,
                "name": "惠州市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 441301,
                        "name": "市辖区",
                        "pid": 441300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 441301
                    },
                    {
                        "id": 441302,
                        "name": "惠城区",
                        "pid": 441300,
                        "level": 2,
                        "text": "惠城区",
                        "value": 441302
                    },
                    {
                        "id": 441303,
                        "name": "惠阳区",
                        "pid": 441300,
                        "level": 2,
                        "text": "惠阳区",
                        "value": 441303
                    },
                    {
                        "id": 441322,
                        "name": "博罗县",
                        "pid": 441300,
                        "level": 2,
                        "text": "博罗县",
                        "value": 441322
                    },
                    {
                        "id": 441323,
                        "name": "惠东县",
                        "pid": 441300,
                        "level": 2,
                        "text": "惠东县",
                        "value": 441323
                    },
                    {
                        "id": 441324,
                        "name": "龙门县",
                        "pid": 441300,
                        "level": 2,
                        "text": "龙门县",
                        "value": 441324
                    }
                ],
                "text": "惠州市",
                "value": 441300
            },
            {
                "id": 441400,
                "name": "梅州市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 441401,
                        "name": "市辖区",
                        "pid": 441400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 441401
                    },
                    {
                        "id": 441402,
                        "name": "梅江区",
                        "pid": 441400,
                        "level": 2,
                        "text": "梅江区",
                        "value": 441402
                    },
                    {
                        "id": 441403,
                        "name": "梅县区",
                        "pid": 441400,
                        "level": 2,
                        "text": "梅县区",
                        "value": 441403
                    },
                    {
                        "id": 441422,
                        "name": "大埔县",
                        "pid": 441400,
                        "level": 2,
                        "text": "大埔县",
                        "value": 441422
                    },
                    {
                        "id": 441423,
                        "name": "丰顺县",
                        "pid": 441400,
                        "level": 2,
                        "text": "丰顺县",
                        "value": 441423
                    },
                    {
                        "id": 441424,
                        "name": "五华县",
                        "pid": 441400,
                        "level": 2,
                        "text": "五华县",
                        "value": 441424
                    },
                    {
                        "id": 441426,
                        "name": "平远县",
                        "pid": 441400,
                        "level": 2,
                        "text": "平远县",
                        "value": 441426
                    },
                    {
                        "id": 441427,
                        "name": "蕉岭县",
                        "pid": 441400,
                        "level": 2,
                        "text": "蕉岭县",
                        "value": 441427
                    },
                    {
                        "id": 441481,
                        "name": "兴宁市",
                        "pid": 441400,
                        "level": 2,
                        "text": "兴宁市",
                        "value": 441481
                    }
                ],
                "text": "梅州市",
                "value": 441400
            },
            {
                "id": 441500,
                "name": "汕尾市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 441501,
                        "name": "市辖区",
                        "pid": 441500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 441501
                    },
                    {
                        "id": 441502,
                        "name": "城区",
                        "pid": 441500,
                        "level": 2,
                        "text": "城区",
                        "value": 441502
                    },
                    {
                        "id": 441521,
                        "name": "海丰县",
                        "pid": 441500,
                        "level": 2,
                        "text": "海丰县",
                        "value": 441521
                    },
                    {
                        "id": 441523,
                        "name": "陆河县",
                        "pid": 441500,
                        "level": 2,
                        "text": "陆河县",
                        "value": 441523
                    },
                    {
                        "id": 441581,
                        "name": "陆丰市",
                        "pid": 441500,
                        "level": 2,
                        "text": "陆丰市",
                        "value": 441581
                    }
                ],
                "text": "汕尾市",
                "value": 441500
            },
            {
                "id": 441600,
                "name": "河源市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 441601,
                        "name": "市辖区",
                        "pid": 441600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 441601
                    },
                    {
                        "id": 441602,
                        "name": "源城区",
                        "pid": 441600,
                        "level": 2,
                        "text": "源城区",
                        "value": 441602
                    },
                    {
                        "id": 441621,
                        "name": "紫金县",
                        "pid": 441600,
                        "level": 2,
                        "text": "紫金县",
                        "value": 441621
                    },
                    {
                        "id": 441622,
                        "name": "龙川县",
                        "pid": 441600,
                        "level": 2,
                        "text": "龙川县",
                        "value": 441622
                    },
                    {
                        "id": 441623,
                        "name": "连平县",
                        "pid": 441600,
                        "level": 2,
                        "text": "连平县",
                        "value": 441623
                    },
                    {
                        "id": 441624,
                        "name": "和平县",
                        "pid": 441600,
                        "level": 2,
                        "text": "和平县",
                        "value": 441624
                    },
                    {
                        "id": 441625,
                        "name": "东源县",
                        "pid": 441600,
                        "level": 2,
                        "text": "东源县",
                        "value": 441625
                    }
                ],
                "text": "河源市",
                "value": 441600
            },
            {
                "id": 441700,
                "name": "阳江市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 441701,
                        "name": "市辖区",
                        "pid": 441700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 441701
                    },
                    {
                        "id": 441702,
                        "name": "江城区",
                        "pid": 441700,
                        "level": 2,
                        "text": "江城区",
                        "value": 441702
                    },
                    {
                        "id": 441704,
                        "name": "阳东区",
                        "pid": 441700,
                        "level": 2,
                        "text": "阳东区",
                        "value": 441704
                    },
                    {
                        "id": 441721,
                        "name": "阳西县",
                        "pid": 441700,
                        "level": 2,
                        "text": "阳西县",
                        "value": 441721
                    },
                    {
                        "id": 441781,
                        "name": "阳春市",
                        "pid": 441700,
                        "level": 2,
                        "text": "阳春市",
                        "value": 441781
                    }
                ],
                "text": "阳江市",
                "value": 441700
            },
            {
                "id": 441800,
                "name": "清远市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 441801,
                        "name": "市辖区",
                        "pid": 441800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 441801
                    },
                    {
                        "id": 441802,
                        "name": "清城区",
                        "pid": 441800,
                        "level": 2,
                        "text": "清城区",
                        "value": 441802
                    },
                    {
                        "id": 441803,
                        "name": "清新区",
                        "pid": 441800,
                        "level": 2,
                        "text": "清新区",
                        "value": 441803
                    },
                    {
                        "id": 441821,
                        "name": "佛冈县",
                        "pid": 441800,
                        "level": 2,
                        "text": "佛冈县",
                        "value": 441821
                    },
                    {
                        "id": 441823,
                        "name": "阳山县",
                        "pid": 441800,
                        "level": 2,
                        "text": "阳山县",
                        "value": 441823
                    },
                    {
                        "id": 441825,
                        "name": "连山壮族瑶族自治县",
                        "pid": 441800,
                        "level": 2,
                        "text": "连山壮族瑶族自治县",
                        "value": 441825
                    },
                    {
                        "id": 441826,
                        "name": "连南瑶族自治县",
                        "pid": 441800,
                        "level": 2,
                        "text": "连南瑶族自治县",
                        "value": 441826
                    },
                    {
                        "id": 441881,
                        "name": "英德市",
                        "pid": 441800,
                        "level": 2,
                        "text": "英德市",
                        "value": 441881
                    },
                    {
                        "id": 441882,
                        "name": "连州市",
                        "pid": 441800,
                        "level": 2,
                        "text": "连州市",
                        "value": 441882
                    }
                ],
                "text": "清远市",
                "value": 441800
            },
            {
                "id": 441900,
                "name": "东莞市",
                "pid": 440000,
                "level": 1,
                "text": "东莞市",
                "value": 441900
            },
            {
                "id": 442000,
                "name": "中山市",
                "pid": 440000,
                "level": 1,
                "text": "中山市",
                "value": 442000
            },
            {
                "id": 445100,
                "name": "潮州市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 445101,
                        "name": "市辖区",
                        "pid": 445100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 445101
                    },
                    {
                        "id": 445102,
                        "name": "湘桥区",
                        "pid": 445100,
                        "level": 2,
                        "text": "湘桥区",
                        "value": 445102
                    },
                    {
                        "id": 445103,
                        "name": "潮安区",
                        "pid": 445100,
                        "level": 2,
                        "text": "潮安区",
                        "value": 445103
                    },
                    {
                        "id": 445122,
                        "name": "饶平县",
                        "pid": 445100,
                        "level": 2,
                        "text": "饶平县",
                        "value": 445122
                    }
                ],
                "text": "潮州市",
                "value": 445100
            },
            {
                "id": 445200,
                "name": "揭阳市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 445201,
                        "name": "市辖区",
                        "pid": 445200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 445201
                    },
                    {
                        "id": 445202,
                        "name": "榕城区",
                        "pid": 445200,
                        "level": 2,
                        "text": "榕城区",
                        "value": 445202
                    },
                    {
                        "id": 445203,
                        "name": "揭东区",
                        "pid": 445200,
                        "level": 2,
                        "text": "揭东区",
                        "value": 445203
                    },
                    {
                        "id": 445222,
                        "name": "揭西县",
                        "pid": 445200,
                        "level": 2,
                        "text": "揭西县",
                        "value": 445222
                    },
                    {
                        "id": 445224,
                        "name": "惠来县",
                        "pid": 445200,
                        "level": 2,
                        "text": "惠来县",
                        "value": 445224
                    },
                    {
                        "id": 445281,
                        "name": "普宁市",
                        "pid": 445200,
                        "level": 2,
                        "text": "普宁市",
                        "value": 445281
                    }
                ],
                "text": "揭阳市",
                "value": 445200
            },
            {
                "id": 445300,
                "name": "云浮市",
                "pid": 440000,
                "level": 1,
                "children": [
                    {
                        "id": 445301,
                        "name": "市辖区",
                        "pid": 445300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 445301
                    },
                    {
                        "id": 445302,
                        "name": "云城区",
                        "pid": 445300,
                        "level": 2,
                        "text": "云城区",
                        "value": 445302
                    },
                    {
                        "id": 445303,
                        "name": "云安区",
                        "pid": 445300,
                        "level": 2,
                        "text": "云安区",
                        "value": 445303
                    },
                    {
                        "id": 445321,
                        "name": "新兴县",
                        "pid": 445300,
                        "level": 2,
                        "text": "新兴县",
                        "value": 445321
                    },
                    {
                        "id": 445322,
                        "name": "郁南县",
                        "pid": 445300,
                        "level": 2,
                        "text": "郁南县",
                        "value": 445322
                    },
                    {
                        "id": 445381,
                        "name": "罗定市",
                        "pid": 445300,
                        "level": 2,
                        "text": "罗定市",
                        "value": 445381
                    }
                ],
                "text": "云浮市",
                "value": 445300
            }
        ],
        "text": "广东省",
        "value": 440000
    },
    {
        "id": 450000,
        "name": "广西壮族自治区",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 450100,
                "name": "南宁市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 450101,
                        "name": "市辖区",
                        "pid": 450100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 450101
                    },
                    {
                        "id": 450102,
                        "name": "兴宁区",
                        "pid": 450100,
                        "level": 2,
                        "text": "兴宁区",
                        "value": 450102
                    },
                    {
                        "id": 450103,
                        "name": "青秀区",
                        "pid": 450100,
                        "level": 2,
                        "text": "青秀区",
                        "value": 450103
                    },
                    {
                        "id": 450105,
                        "name": "江南区",
                        "pid": 450100,
                        "level": 2,
                        "text": "江南区",
                        "value": 450105
                    },
                    {
                        "id": 450107,
                        "name": "西乡塘区",
                        "pid": 450100,
                        "level": 2,
                        "text": "西乡塘区",
                        "value": 450107
                    },
                    {
                        "id": 450108,
                        "name": "良庆区",
                        "pid": 450100,
                        "level": 2,
                        "text": "良庆区",
                        "value": 450108
                    },
                    {
                        "id": 450109,
                        "name": "邕宁区",
                        "pid": 450100,
                        "level": 2,
                        "text": "邕宁区",
                        "value": 450109
                    },
                    {
                        "id": 450110,
                        "name": "武鸣区",
                        "pid": 450100,
                        "level": 2,
                        "text": "武鸣区",
                        "value": 450110
                    },
                    {
                        "id": 450123,
                        "name": "隆安县",
                        "pid": 450100,
                        "level": 2,
                        "text": "隆安县",
                        "value": 450123
                    },
                    {
                        "id": 450124,
                        "name": "马山县",
                        "pid": 450100,
                        "level": 2,
                        "text": "马山县",
                        "value": 450124
                    },
                    {
                        "id": 450125,
                        "name": "上林县",
                        "pid": 450100,
                        "level": 2,
                        "text": "上林县",
                        "value": 450125
                    },
                    {
                        "id": 450126,
                        "name": "宾阳县",
                        "pid": 450100,
                        "level": 2,
                        "text": "宾阳县",
                        "value": 450126
                    },
                    {
                        "id": 450127,
                        "name": "横县",
                        "pid": 450100,
                        "level": 2,
                        "text": "横县",
                        "value": 450127
                    }
                ],
                "text": "南宁市",
                "value": 450100
            },
            {
                "id": 450200,
                "name": "柳州市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 450201,
                        "name": "市辖区",
                        "pid": 450200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 450201
                    },
                    {
                        "id": 450202,
                        "name": "城中区",
                        "pid": 450200,
                        "level": 2,
                        "text": "城中区",
                        "value": 450202
                    },
                    {
                        "id": 450203,
                        "name": "鱼峰区",
                        "pid": 450200,
                        "level": 2,
                        "text": "鱼峰区",
                        "value": 450203
                    },
                    {
                        "id": 450204,
                        "name": "柳南区",
                        "pid": 450200,
                        "level": 2,
                        "text": "柳南区",
                        "value": 450204
                    },
                    {
                        "id": 450205,
                        "name": "柳北区",
                        "pid": 450200,
                        "level": 2,
                        "text": "柳北区",
                        "value": 450205
                    },
                    {
                        "id": 450206,
                        "name": "柳江区",
                        "pid": 450200,
                        "level": 2,
                        "text": "柳江区",
                        "value": 450206
                    },
                    {
                        "id": 450222,
                        "name": "柳城县",
                        "pid": 450200,
                        "level": 2,
                        "text": "柳城县",
                        "value": 450222
                    },
                    {
                        "id": 450223,
                        "name": "鹿寨县",
                        "pid": 450200,
                        "level": 2,
                        "text": "鹿寨县",
                        "value": 450223
                    },
                    {
                        "id": 450224,
                        "name": "融安县",
                        "pid": 450200,
                        "level": 2,
                        "text": "融安县",
                        "value": 450224
                    },
                    {
                        "id": 450225,
                        "name": "融水苗族自治县",
                        "pid": 450200,
                        "level": 2,
                        "text": "融水苗族自治县",
                        "value": 450225
                    },
                    {
                        "id": 450226,
                        "name": "三江侗族自治县",
                        "pid": 450200,
                        "level": 2,
                        "text": "三江侗族自治县",
                        "value": 450226
                    }
                ],
                "text": "柳州市",
                "value": 450200
            },
            {
                "id": 450300,
                "name": "桂林市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 450301,
                        "name": "市辖区",
                        "pid": 450300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 450301
                    },
                    {
                        "id": 450302,
                        "name": "秀峰区",
                        "pid": 450300,
                        "level": 2,
                        "text": "秀峰区",
                        "value": 450302
                    },
                    {
                        "id": 450303,
                        "name": "叠彩区",
                        "pid": 450300,
                        "level": 2,
                        "text": "叠彩区",
                        "value": 450303
                    },
                    {
                        "id": 450304,
                        "name": "象山区",
                        "pid": 450300,
                        "level": 2,
                        "text": "象山区",
                        "value": 450304
                    },
                    {
                        "id": 450305,
                        "name": "七星区",
                        "pid": 450300,
                        "level": 2,
                        "text": "七星区",
                        "value": 450305
                    },
                    {
                        "id": 450311,
                        "name": "雁山区",
                        "pid": 450300,
                        "level": 2,
                        "text": "雁山区",
                        "value": 450311
                    },
                    {
                        "id": 450312,
                        "name": "临桂区",
                        "pid": 450300,
                        "level": 2,
                        "text": "临桂区",
                        "value": 450312
                    },
                    {
                        "id": 450321,
                        "name": "阳朔县",
                        "pid": 450300,
                        "level": 2,
                        "text": "阳朔县",
                        "value": 450321
                    },
                    {
                        "id": 450323,
                        "name": "灵川县",
                        "pid": 450300,
                        "level": 2,
                        "text": "灵川县",
                        "value": 450323
                    },
                    {
                        "id": 450324,
                        "name": "全州县",
                        "pid": 450300,
                        "level": 2,
                        "text": "全州县",
                        "value": 450324
                    },
                    {
                        "id": 450325,
                        "name": "兴安县",
                        "pid": 450300,
                        "level": 2,
                        "text": "兴安县",
                        "value": 450325
                    },
                    {
                        "id": 450326,
                        "name": "永福县",
                        "pid": 450300,
                        "level": 2,
                        "text": "永福县",
                        "value": 450326
                    },
                    {
                        "id": 450327,
                        "name": "灌阳县",
                        "pid": 450300,
                        "level": 2,
                        "text": "灌阳县",
                        "value": 450327
                    },
                    {
                        "id": 450328,
                        "name": "龙胜各族自治县",
                        "pid": 450300,
                        "level": 2,
                        "text": "龙胜各族自治县",
                        "value": 450328
                    },
                    {
                        "id": 450329,
                        "name": "资源县",
                        "pid": 450300,
                        "level": 2,
                        "text": "资源县",
                        "value": 450329
                    },
                    {
                        "id": 450330,
                        "name": "平乐县",
                        "pid": 450300,
                        "level": 2,
                        "text": "平乐县",
                        "value": 450330
                    },
                    {
                        "id": 450331,
                        "name": "荔浦县",
                        "pid": 450300,
                        "level": 2,
                        "text": "荔浦县",
                        "value": 450331
                    },
                    {
                        "id": 450332,
                        "name": "恭城瑶族自治县",
                        "pid": 450300,
                        "level": 2,
                        "text": "恭城瑶族自治县",
                        "value": 450332
                    }
                ],
                "text": "桂林市",
                "value": 450300
            },
            {
                "id": 450400,
                "name": "梧州市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 450401,
                        "name": "市辖区",
                        "pid": 450400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 450401
                    },
                    {
                        "id": 450403,
                        "name": "万秀区",
                        "pid": 450400,
                        "level": 2,
                        "text": "万秀区",
                        "value": 450403
                    },
                    {
                        "id": 450405,
                        "name": "长洲区",
                        "pid": 450400,
                        "level": 2,
                        "text": "长洲区",
                        "value": 450405
                    },
                    {
                        "id": 450406,
                        "name": "龙圩区",
                        "pid": 450400,
                        "level": 2,
                        "text": "龙圩区",
                        "value": 450406
                    },
                    {
                        "id": 450421,
                        "name": "苍梧县",
                        "pid": 450400,
                        "level": 2,
                        "text": "苍梧县",
                        "value": 450421
                    },
                    {
                        "id": 450422,
                        "name": "藤县",
                        "pid": 450400,
                        "level": 2,
                        "text": "藤县",
                        "value": 450422
                    },
                    {
                        "id": 450423,
                        "name": "蒙山县",
                        "pid": 450400,
                        "level": 2,
                        "text": "蒙山县",
                        "value": 450423
                    },
                    {
                        "id": 450481,
                        "name": "岑溪市",
                        "pid": 450400,
                        "level": 2,
                        "text": "岑溪市",
                        "value": 450481
                    }
                ],
                "text": "梧州市",
                "value": 450400
            },
            {
                "id": 450500,
                "name": "北海市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 450501,
                        "name": "市辖区",
                        "pid": 450500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 450501
                    },
                    {
                        "id": 450502,
                        "name": "海城区",
                        "pid": 450500,
                        "level": 2,
                        "text": "海城区",
                        "value": 450502
                    },
                    {
                        "id": 450503,
                        "name": "银海区",
                        "pid": 450500,
                        "level": 2,
                        "text": "银海区",
                        "value": 450503
                    },
                    {
                        "id": 450512,
                        "name": "铁山港区",
                        "pid": 450500,
                        "level": 2,
                        "text": "铁山港区",
                        "value": 450512
                    },
                    {
                        "id": 450521,
                        "name": "合浦县",
                        "pid": 450500,
                        "level": 2,
                        "text": "合浦县",
                        "value": 450521
                    }
                ],
                "text": "北海市",
                "value": 450500
            },
            {
                "id": 450600,
                "name": "防城港市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 450601,
                        "name": "市辖区",
                        "pid": 450600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 450601
                    },
                    {
                        "id": 450602,
                        "name": "港口区",
                        "pid": 450600,
                        "level": 2,
                        "text": "港口区",
                        "value": 450602
                    },
                    {
                        "id": 450603,
                        "name": "防城区",
                        "pid": 450600,
                        "level": 2,
                        "text": "防城区",
                        "value": 450603
                    },
                    {
                        "id": 450621,
                        "name": "上思县",
                        "pid": 450600,
                        "level": 2,
                        "text": "上思县",
                        "value": 450621
                    },
                    {
                        "id": 450681,
                        "name": "东兴市",
                        "pid": 450600,
                        "level": 2,
                        "text": "东兴市",
                        "value": 450681
                    }
                ],
                "text": "防城港市",
                "value": 450600
            },
            {
                "id": 450700,
                "name": "钦州市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 450701,
                        "name": "市辖区",
                        "pid": 450700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 450701
                    },
                    {
                        "id": 450702,
                        "name": "钦南区",
                        "pid": 450700,
                        "level": 2,
                        "text": "钦南区",
                        "value": 450702
                    },
                    {
                        "id": 450703,
                        "name": "钦北区",
                        "pid": 450700,
                        "level": 2,
                        "text": "钦北区",
                        "value": 450703
                    },
                    {
                        "id": 450721,
                        "name": "灵山县",
                        "pid": 450700,
                        "level": 2,
                        "text": "灵山县",
                        "value": 450721
                    },
                    {
                        "id": 450722,
                        "name": "浦北县",
                        "pid": 450700,
                        "level": 2,
                        "text": "浦北县",
                        "value": 450722
                    }
                ],
                "text": "钦州市",
                "value": 450700
            },
            {
                "id": 450800,
                "name": "贵港市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 450801,
                        "name": "市辖区",
                        "pid": 450800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 450801
                    },
                    {
                        "id": 450802,
                        "name": "港北区",
                        "pid": 450800,
                        "level": 2,
                        "text": "港北区",
                        "value": 450802
                    },
                    {
                        "id": 450803,
                        "name": "港南区",
                        "pid": 450800,
                        "level": 2,
                        "text": "港南区",
                        "value": 450803
                    },
                    {
                        "id": 450804,
                        "name": "覃塘区",
                        "pid": 450800,
                        "level": 2,
                        "text": "覃塘区",
                        "value": 450804
                    },
                    {
                        "id": 450821,
                        "name": "平南县",
                        "pid": 450800,
                        "level": 2,
                        "text": "平南县",
                        "value": 450821
                    },
                    {
                        "id": 450881,
                        "name": "桂平市",
                        "pid": 450800,
                        "level": 2,
                        "text": "桂平市",
                        "value": 450881
                    }
                ],
                "text": "贵港市",
                "value": 450800
            },
            {
                "id": 450900,
                "name": "玉林市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 450901,
                        "name": "市辖区",
                        "pid": 450900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 450901
                    },
                    {
                        "id": 450902,
                        "name": "玉州区",
                        "pid": 450900,
                        "level": 2,
                        "text": "玉州区",
                        "value": 450902
                    },
                    {
                        "id": 450903,
                        "name": "福绵区",
                        "pid": 450900,
                        "level": 2,
                        "text": "福绵区",
                        "value": 450903
                    },
                    {
                        "id": 450921,
                        "name": "容县",
                        "pid": 450900,
                        "level": 2,
                        "text": "容县",
                        "value": 450921
                    },
                    {
                        "id": 450922,
                        "name": "陆川县",
                        "pid": 450900,
                        "level": 2,
                        "text": "陆川县",
                        "value": 450922
                    },
                    {
                        "id": 450923,
                        "name": "博白县",
                        "pid": 450900,
                        "level": 2,
                        "text": "博白县",
                        "value": 450923
                    },
                    {
                        "id": 450924,
                        "name": "兴业县",
                        "pid": 450900,
                        "level": 2,
                        "text": "兴业县",
                        "value": 450924
                    },
                    {
                        "id": 450981,
                        "name": "北流市",
                        "pid": 450900,
                        "level": 2,
                        "text": "北流市",
                        "value": 450981
                    }
                ],
                "text": "玉林市",
                "value": 450900
            },
            {
                "id": 451000,
                "name": "百色市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 451001,
                        "name": "市辖区",
                        "pid": 451000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 451001
                    },
                    {
                        "id": 451002,
                        "name": "右江区",
                        "pid": 451000,
                        "level": 2,
                        "text": "右江区",
                        "value": 451002
                    },
                    {
                        "id": 451021,
                        "name": "田阳县",
                        "pid": 451000,
                        "level": 2,
                        "text": "田阳县",
                        "value": 451021
                    },
                    {
                        "id": 451022,
                        "name": "田东县",
                        "pid": 451000,
                        "level": 2,
                        "text": "田东县",
                        "value": 451022
                    },
                    {
                        "id": 451023,
                        "name": "平果县",
                        "pid": 451000,
                        "level": 2,
                        "text": "平果县",
                        "value": 451023
                    },
                    {
                        "id": 451024,
                        "name": "德保县",
                        "pid": 451000,
                        "level": 2,
                        "text": "德保县",
                        "value": 451024
                    },
                    {
                        "id": 451026,
                        "name": "那坡县",
                        "pid": 451000,
                        "level": 2,
                        "text": "那坡县",
                        "value": 451026
                    },
                    {
                        "id": 451027,
                        "name": "凌云县",
                        "pid": 451000,
                        "level": 2,
                        "text": "凌云县",
                        "value": 451027
                    },
                    {
                        "id": 451028,
                        "name": "乐业县",
                        "pid": 451000,
                        "level": 2,
                        "text": "乐业县",
                        "value": 451028
                    },
                    {
                        "id": 451029,
                        "name": "田林县",
                        "pid": 451000,
                        "level": 2,
                        "text": "田林县",
                        "value": 451029
                    },
                    {
                        "id": 451030,
                        "name": "西林县",
                        "pid": 451000,
                        "level": 2,
                        "text": "西林县",
                        "value": 451030
                    },
                    {
                        "id": 451031,
                        "name": "隆林各族自治县",
                        "pid": 451000,
                        "level": 2,
                        "text": "隆林各族自治县",
                        "value": 451031
                    },
                    {
                        "id": 451081,
                        "name": "靖西市",
                        "pid": 451000,
                        "level": 2,
                        "text": "靖西市",
                        "value": 451081
                    }
                ],
                "text": "百色市",
                "value": 451000
            },
            {
                "id": 451100,
                "name": "贺州市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 451101,
                        "name": "市辖区",
                        "pid": 451100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 451101
                    },
                    {
                        "id": 451102,
                        "name": "八步区",
                        "pid": 451100,
                        "level": 2,
                        "text": "八步区",
                        "value": 451102
                    },
                    {
                        "id": 451103,
                        "name": "平桂区",
                        "pid": 451100,
                        "level": 2,
                        "text": "平桂区",
                        "value": 451103
                    },
                    {
                        "id": 451121,
                        "name": "昭平县",
                        "pid": 451100,
                        "level": 2,
                        "text": "昭平县",
                        "value": 451121
                    },
                    {
                        "id": 451122,
                        "name": "钟山县",
                        "pid": 451100,
                        "level": 2,
                        "text": "钟山县",
                        "value": 451122
                    },
                    {
                        "id": 451123,
                        "name": "富川瑶族自治县",
                        "pid": 451100,
                        "level": 2,
                        "text": "富川瑶族自治县",
                        "value": 451123
                    }
                ],
                "text": "贺州市",
                "value": 451100
            },
            {
                "id": 451200,
                "name": "河池市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 451201,
                        "name": "市辖区",
                        "pid": 451200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 451201
                    },
                    {
                        "id": 451202,
                        "name": "金城江区",
                        "pid": 451200,
                        "level": 2,
                        "text": "金城江区",
                        "value": 451202
                    },
                    {
                        "id": 451221,
                        "name": "南丹县",
                        "pid": 451200,
                        "level": 2,
                        "text": "南丹县",
                        "value": 451221
                    },
                    {
                        "id": 451222,
                        "name": "天峨县",
                        "pid": 451200,
                        "level": 2,
                        "text": "天峨县",
                        "value": 451222
                    },
                    {
                        "id": 451223,
                        "name": "凤山县",
                        "pid": 451200,
                        "level": 2,
                        "text": "凤山县",
                        "value": 451223
                    },
                    {
                        "id": 451224,
                        "name": "东兰县",
                        "pid": 451200,
                        "level": 2,
                        "text": "东兰县",
                        "value": 451224
                    },
                    {
                        "id": 451225,
                        "name": "罗城仫佬族自治县",
                        "pid": 451200,
                        "level": 2,
                        "text": "罗城仫佬族自治县",
                        "value": 451225
                    },
                    {
                        "id": 451226,
                        "name": "环江毛南族自治县",
                        "pid": 451200,
                        "level": 2,
                        "text": "环江毛南族自治县",
                        "value": 451226
                    },
                    {
                        "id": 451227,
                        "name": "巴马瑶族自治县",
                        "pid": 451200,
                        "level": 2,
                        "text": "巴马瑶族自治县",
                        "value": 451227
                    },
                    {
                        "id": 451228,
                        "name": "都安瑶族自治县",
                        "pid": 451200,
                        "level": 2,
                        "text": "都安瑶族自治县",
                        "value": 451228
                    },
                    {
                        "id": 451229,
                        "name": "大化瑶族自治县",
                        "pid": 451200,
                        "level": 2,
                        "text": "大化瑶族自治县",
                        "value": 451229
                    },
                    {
                        "id": 451281,
                        "name": "宜州市",
                        "pid": 451200,
                        "level": 2,
                        "text": "宜州市",
                        "value": 451281
                    }
                ],
                "text": "河池市",
                "value": 451200
            },
            {
                "id": 451300,
                "name": "来宾市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 451301,
                        "name": "市辖区",
                        "pid": 451300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 451301
                    },
                    {
                        "id": 451302,
                        "name": "兴宾区",
                        "pid": 451300,
                        "level": 2,
                        "text": "兴宾区",
                        "value": 451302
                    },
                    {
                        "id": 451321,
                        "name": "忻城县",
                        "pid": 451300,
                        "level": 2,
                        "text": "忻城县",
                        "value": 451321
                    },
                    {
                        "id": 451322,
                        "name": "象州县",
                        "pid": 451300,
                        "level": 2,
                        "text": "象州县",
                        "value": 451322
                    },
                    {
                        "id": 451323,
                        "name": "武宣县",
                        "pid": 451300,
                        "level": 2,
                        "text": "武宣县",
                        "value": 451323
                    },
                    {
                        "id": 451324,
                        "name": "金秀瑶族自治县",
                        "pid": 451300,
                        "level": 2,
                        "text": "金秀瑶族自治县",
                        "value": 451324
                    },
                    {
                        "id": 451381,
                        "name": "合山市",
                        "pid": 451300,
                        "level": 2,
                        "text": "合山市",
                        "value": 451381
                    }
                ],
                "text": "来宾市",
                "value": 451300
            },
            {
                "id": 451400,
                "name": "崇左市",
                "pid": 450000,
                "level": 1,
                "children": [
                    {
                        "id": 451401,
                        "name": "市辖区",
                        "pid": 451400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 451401
                    },
                    {
                        "id": 451402,
                        "name": "江州区",
                        "pid": 451400,
                        "level": 2,
                        "text": "江州区",
                        "value": 451402
                    },
                    {
                        "id": 451421,
                        "name": "扶绥县",
                        "pid": 451400,
                        "level": 2,
                        "text": "扶绥县",
                        "value": 451421
                    },
                    {
                        "id": 451422,
                        "name": "宁明县",
                        "pid": 451400,
                        "level": 2,
                        "text": "宁明县",
                        "value": 451422
                    },
                    {
                        "id": 451423,
                        "name": "龙州县",
                        "pid": 451400,
                        "level": 2,
                        "text": "龙州县",
                        "value": 451423
                    },
                    {
                        "id": 451424,
                        "name": "大新县",
                        "pid": 451400,
                        "level": 2,
                        "text": "大新县",
                        "value": 451424
                    },
                    {
                        "id": 451425,
                        "name": "天等县",
                        "pid": 451400,
                        "level": 2,
                        "text": "天等县",
                        "value": 451425
                    },
                    {
                        "id": 451481,
                        "name": "凭祥市",
                        "pid": 451400,
                        "level": 2,
                        "text": "凭祥市",
                        "value": 451481
                    }
                ],
                "text": "崇左市",
                "value": 451400
            }
        ],
        "text": "广西壮族自治区",
        "value": 450000
    },
    {
        "id": 460000,
        "name": "海南省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 460100,
                "name": "海口市",
                "pid": 460000,
                "level": 1,
                "children": [
                    {
                        "id": 460101,
                        "name": "市辖区",
                        "pid": 460100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 460101
                    },
                    {
                        "id": 460105,
                        "name": "秀英区",
                        "pid": 460100,
                        "level": 2,
                        "text": "秀英区",
                        "value": 460105
                    },
                    {
                        "id": 460106,
                        "name": "龙华区",
                        "pid": 460100,
                        "level": 2,
                        "text": "龙华区",
                        "value": 460106
                    },
                    {
                        "id": 460107,
                        "name": "琼山区",
                        "pid": 460100,
                        "level": 2,
                        "text": "琼山区",
                        "value": 460107
                    },
                    {
                        "id": 460108,
                        "name": "美兰区",
                        "pid": 460100,
                        "level": 2,
                        "text": "美兰区",
                        "value": 460108
                    }
                ],
                "text": "海口市",
                "value": 460100
            },
            {
                "id": 460200,
                "name": "三亚市",
                "pid": 460000,
                "level": 1,
                "children": [
                    {
                        "id": 460201,
                        "name": "市辖区",
                        "pid": 460200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 460201
                    },
                    {
                        "id": 460202,
                        "name": "海棠区",
                        "pid": 460200,
                        "level": 2,
                        "text": "海棠区",
                        "value": 460202
                    },
                    {
                        "id": 460203,
                        "name": "吉阳区",
                        "pid": 460200,
                        "level": 2,
                        "text": "吉阳区",
                        "value": 460203
                    },
                    {
                        "id": 460204,
                        "name": "天涯区",
                        "pid": 460200,
                        "level": 2,
                        "text": "天涯区",
                        "value": 460204
                    },
                    {
                        "id": 460205,
                        "name": "崖州区",
                        "pid": 460200,
                        "level": 2,
                        "text": "崖州区",
                        "value": 460205
                    }
                ],
                "text": "三亚市",
                "value": 460200
            },
            {
                "id": 460300,
                "name": "三沙市",
                "pid": 460000,
                "level": 1,
                "text": "三沙市",
                "value": 460300
            },
            {
                "id": 460400,
                "name": "儋州市",
                "pid": 460000,
                "level": 1,
                "text": "儋州市",
                "value": 460400
            },
            {
                "id": 469000,
                "name": "省直辖县级行政区划",
                "pid": 460000,
                "level": 1,
                "children": [
                    {
                        "id": 469001,
                        "name": "五指山市",
                        "pid": 469000,
                        "level": 2,
                        "text": "五指山市",
                        "value": 469001
                    },
                    {
                        "id": 469002,
                        "name": "琼海市",
                        "pid": 469000,
                        "level": 2,
                        "text": "琼海市",
                        "value": 469002
                    },
                    {
                        "id": 469005,
                        "name": "文昌市",
                        "pid": 469000,
                        "level": 2,
                        "text": "文昌市",
                        "value": 469005
                    },
                    {
                        "id": 469006,
                        "name": "万宁市",
                        "pid": 469000,
                        "level": 2,
                        "text": "万宁市",
                        "value": 469006
                    },
                    {
                        "id": 469007,
                        "name": "东方市",
                        "pid": 469000,
                        "level": 2,
                        "text": "东方市",
                        "value": 469007
                    },
                    {
                        "id": 469021,
                        "name": "定安县",
                        "pid": 469000,
                        "level": 2,
                        "text": "定安县",
                        "value": 469021
                    },
                    {
                        "id": 469022,
                        "name": "屯昌县",
                        "pid": 469000,
                        "level": 2,
                        "text": "屯昌县",
                        "value": 469022
                    },
                    {
                        "id": 469023,
                        "name": "澄迈县",
                        "pid": 469000,
                        "level": 2,
                        "text": "澄迈县",
                        "value": 469023
                    },
                    {
                        "id": 469024,
                        "name": "临高县",
                        "pid": 469000,
                        "level": 2,
                        "text": "临高县",
                        "value": 469024
                    },
                    {
                        "id": 469025,
                        "name": "白沙黎族自治县",
                        "pid": 469000,
                        "level": 2,
                        "text": "白沙黎族自治县",
                        "value": 469025
                    },
                    {
                        "id": 469026,
                        "name": "昌江黎族自治县",
                        "pid": 469000,
                        "level": 2,
                        "text": "昌江黎族自治县",
                        "value": 469026
                    },
                    {
                        "id": 469027,
                        "name": "乐东黎族自治县",
                        "pid": 469000,
                        "level": 2,
                        "text": "乐东黎族自治县",
                        "value": 469027
                    },
                    {
                        "id": 469028,
                        "name": "陵水黎族自治县",
                        "pid": 469000,
                        "level": 2,
                        "text": "陵水黎族自治县",
                        "value": 469028
                    },
                    {
                        "id": 469029,
                        "name": "保亭黎族苗族自治县",
                        "pid": 469000,
                        "level": 2,
                        "text": "保亭黎族苗族自治县",
                        "value": 469029
                    },
                    {
                        "id": 469030,
                        "name": "琼中黎族苗族自治县",
                        "pid": 469000,
                        "level": 2,
                        "text": "琼中黎族苗族自治县",
                        "value": 469030
                    }
                ],
                "text": "省直辖县级行政区划",
                "value": 469000
            }
        ],
        "text": "海南省",
        "value": 460000
    },
    {
        "id": 500000,
        "name": "重庆市",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 500100,
                "name": "市辖区",
                "pid": 500000,
                "level": 1,
                "children": [
                    {
                        "id": 500101,
                        "name": "万州区",
                        "pid": 500100,
                        "level": 2,
                        "text": "万州区",
                        "value": 500101
                    },
                    {
                        "id": 500102,
                        "name": "涪陵区",
                        "pid": 500100,
                        "level": 2,
                        "text": "涪陵区",
                        "value": 500102
                    },
                    {
                        "id": 500103,
                        "name": "渝中区",
                        "pid": 500100,
                        "level": 2,
                        "text": "渝中区",
                        "value": 500103
                    },
                    {
                        "id": 500104,
                        "name": "大渡口区",
                        "pid": 500100,
                        "level": 2,
                        "text": "大渡口区",
                        "value": 500104
                    },
                    {
                        "id": 500105,
                        "name": "江北区",
                        "pid": 500100,
                        "level": 2,
                        "text": "江北区",
                        "value": 500105
                    },
                    {
                        "id": 500106,
                        "name": "沙坪坝区",
                        "pid": 500100,
                        "level": 2,
                        "text": "沙坪坝区",
                        "value": 500106
                    },
                    {
                        "id": 500107,
                        "name": "九龙坡区",
                        "pid": 500100,
                        "level": 2,
                        "text": "九龙坡区",
                        "value": 500107
                    },
                    {
                        "id": 500108,
                        "name": "南岸区",
                        "pid": 500100,
                        "level": 2,
                        "text": "南岸区",
                        "value": 500108
                    },
                    {
                        "id": 500109,
                        "name": "北碚区",
                        "pid": 500100,
                        "level": 2,
                        "text": "北碚区",
                        "value": 500109
                    },
                    {
                        "id": 500110,
                        "name": "綦江区",
                        "pid": 500100,
                        "level": 2,
                        "text": "綦江区",
                        "value": 500110
                    },
                    {
                        "id": 500111,
                        "name": "大足区",
                        "pid": 500100,
                        "level": 2,
                        "text": "大足区",
                        "value": 500111
                    },
                    {
                        "id": 500112,
                        "name": "渝北区",
                        "pid": 500100,
                        "level": 2,
                        "text": "渝北区",
                        "value": 500112
                    },
                    {
                        "id": 500113,
                        "name": "巴南区",
                        "pid": 500100,
                        "level": 2,
                        "text": "巴南区",
                        "value": 500113
                    },
                    {
                        "id": 500114,
                        "name": "黔江区",
                        "pid": 500100,
                        "level": 2,
                        "text": "黔江区",
                        "value": 500114
                    },
                    {
                        "id": 500115,
                        "name": "长寿区",
                        "pid": 500100,
                        "level": 2,
                        "text": "长寿区",
                        "value": 500115
                    },
                    {
                        "id": 500116,
                        "name": "江津区",
                        "pid": 500100,
                        "level": 2,
                        "text": "江津区",
                        "value": 500116
                    },
                    {
                        "id": 500117,
                        "name": "合川区",
                        "pid": 500100,
                        "level": 2,
                        "text": "合川区",
                        "value": 500117
                    },
                    {
                        "id": 500118,
                        "name": "永川区",
                        "pid": 500100,
                        "level": 2,
                        "text": "永川区",
                        "value": 500118
                    },
                    {
                        "id": 500119,
                        "name": "南川区",
                        "pid": 500100,
                        "level": 2,
                        "text": "南川区",
                        "value": 500119
                    },
                    {
                        "id": 500120,
                        "name": "璧山区",
                        "pid": 500100,
                        "level": 2,
                        "text": "璧山区",
                        "value": 500120
                    },
                    {
                        "id": 500151,
                        "name": "铜梁区",
                        "pid": 500100,
                        "level": 2,
                        "text": "铜梁区",
                        "value": 500151
                    },
                    {
                        "id": 500152,
                        "name": "潼南区",
                        "pid": 500100,
                        "level": 2,
                        "text": "潼南区",
                        "value": 500152
                    },
                    {
                        "id": 500153,
                        "name": "荣昌区",
                        "pid": 500100,
                        "level": 2,
                        "text": "荣昌区",
                        "value": 500153
                    },
                    {
                        "id": 500154,
                        "name": "开州区",
                        "pid": 500100,
                        "level": 2,
                        "text": "开州区",
                        "value": 500154
                    }
                ],
                "text": "市辖区",
                "value": 500100
            },
            {
                "id": 500200,
                "name": "县",
                "pid": 500000,
                "level": 1,
                "children": [
                    {
                        "id": 500228,
                        "name": "梁平县",
                        "pid": 500200,
                        "level": 2,
                        "text": "梁平县",
                        "value": 500228
                    },
                    {
                        "id": 500229,
                        "name": "城口县",
                        "pid": 500200,
                        "level": 2,
                        "text": "城口县",
                        "value": 500229
                    },
                    {
                        "id": 500230,
                        "name": "丰都县",
                        "pid": 500200,
                        "level": 2,
                        "text": "丰都县",
                        "value": 500230
                    },
                    {
                        "id": 500231,
                        "name": "垫江县",
                        "pid": 500200,
                        "level": 2,
                        "text": "垫江县",
                        "value": 500231
                    },
                    {
                        "id": 500232,
                        "name": "武隆县",
                        "pid": 500200,
                        "level": 2,
                        "text": "武隆县",
                        "value": 500232
                    },
                    {
                        "id": 500233,
                        "name": "忠县",
                        "pid": 500200,
                        "level": 2,
                        "text": "忠县",
                        "value": 500233
                    },
                    {
                        "id": 500235,
                        "name": "云阳县",
                        "pid": 500200,
                        "level": 2,
                        "text": "云阳县",
                        "value": 500235
                    },
                    {
                        "id": 500236,
                        "name": "奉节县",
                        "pid": 500200,
                        "level": 2,
                        "text": "奉节县",
                        "value": 500236
                    },
                    {
                        "id": 500237,
                        "name": "巫山县",
                        "pid": 500200,
                        "level": 2,
                        "text": "巫山县",
                        "value": 500237
                    },
                    {
                        "id": 500238,
                        "name": "巫溪县",
                        "pid": 500200,
                        "level": 2,
                        "text": "巫溪县",
                        "value": 500238
                    },
                    {
                        "id": 500240,
                        "name": "石柱土家族自治县",
                        "pid": 500200,
                        "level": 2,
                        "text": "石柱土家族自治县",
                        "value": 500240
                    },
                    {
                        "id": 500241,
                        "name": "秀山土家族苗族自治县",
                        "pid": 500200,
                        "level": 2,
                        "text": "秀山土家族苗族自治县",
                        "value": 500241
                    },
                    {
                        "id": 500242,
                        "name": "酉阳土家族苗族自治县",
                        "pid": 500200,
                        "level": 2,
                        "text": "酉阳土家族苗族自治县",
                        "value": 500242
                    },
                    {
                        "id": 500243,
                        "name": "彭水苗族土家族自治县",
                        "pid": 500200,
                        "level": 2,
                        "text": "彭水苗族土家族自治县",
                        "value": 500243
                    }
                ],
                "text": "县",
                "value": 500200
            }
        ],
        "text": "重庆市",
        "value": 500000
    },
    {
        "id": 510000,
        "name": "四川省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 510100,
                "name": "成都市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 510101,
                        "name": "市辖区",
                        "pid": 510100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 510101
                    },
                    {
                        "id": 510104,
                        "name": "锦江区",
                        "pid": 510100,
                        "level": 2,
                        "text": "锦江区",
                        "value": 510104
                    },
                    {
                        "id": 510105,
                        "name": "青羊区",
                        "pid": 510100,
                        "level": 2,
                        "text": "青羊区",
                        "value": 510105
                    },
                    {
                        "id": 510106,
                        "name": "金牛区",
                        "pid": 510100,
                        "level": 2,
                        "text": "金牛区",
                        "value": 510106
                    },
                    {
                        "id": 510107,
                        "name": "武侯区",
                        "pid": 510100,
                        "level": 2,
                        "text": "武侯区",
                        "value": 510107
                    },
                    {
                        "id": 510108,
                        "name": "成华区",
                        "pid": 510100,
                        "level": 2,
                        "text": "成华区",
                        "value": 510108
                    },
                    {
                        "id": 510112,
                        "name": "龙泉驿区",
                        "pid": 510100,
                        "level": 2,
                        "text": "龙泉驿区",
                        "value": 510112
                    },
                    {
                        "id": 510113,
                        "name": "青白江区",
                        "pid": 510100,
                        "level": 2,
                        "text": "青白江区",
                        "value": 510113
                    },
                    {
                        "id": 510114,
                        "name": "新都区",
                        "pid": 510100,
                        "level": 2,
                        "text": "新都区",
                        "value": 510114
                    },
                    {
                        "id": 510115,
                        "name": "温江区",
                        "pid": 510100,
                        "level": 2,
                        "text": "温江区",
                        "value": 510115
                    },
                    {
                        "id": 510116,
                        "name": "双流区",
                        "pid": 510100,
                        "level": 2,
                        "text": "双流区",
                        "value": 510116
                    },
                    {
                        "id": 510121,
                        "name": "金堂县",
                        "pid": 510100,
                        "level": 2,
                        "text": "金堂县",
                        "value": 510121
                    },
                    {
                        "id": 510124,
                        "name": "郫县",
                        "pid": 510100,
                        "level": 2,
                        "text": "郫县",
                        "value": 510124
                    },
                    {
                        "id": 510129,
                        "name": "大邑县",
                        "pid": 510100,
                        "level": 2,
                        "text": "大邑县",
                        "value": 510129
                    },
                    {
                        "id": 510131,
                        "name": "蒲江县",
                        "pid": 510100,
                        "level": 2,
                        "text": "蒲江县",
                        "value": 510131
                    },
                    {
                        "id": 510132,
                        "name": "新津县",
                        "pid": 510100,
                        "level": 2,
                        "text": "新津县",
                        "value": 510132
                    },
                    {
                        "id": 510181,
                        "name": "都江堰市",
                        "pid": 510100,
                        "level": 2,
                        "text": "都江堰市",
                        "value": 510181
                    },
                    {
                        "id": 510182,
                        "name": "彭州市",
                        "pid": 510100,
                        "level": 2,
                        "text": "彭州市",
                        "value": 510182
                    },
                    {
                        "id": 510183,
                        "name": "邛崃市",
                        "pid": 510100,
                        "level": 2,
                        "text": "邛崃市",
                        "value": 510183
                    },
                    {
                        "id": 510184,
                        "name": "崇州市",
                        "pid": 510100,
                        "level": 2,
                        "text": "崇州市",
                        "value": 510184
                    },
                    {
                        "id": 510185,
                        "name": "简阳市",
                        "pid": 510100,
                        "level": 2,
                        "text": "简阳市",
                        "value": 510185
                    }
                ],
                "text": "成都市",
                "value": 510100
            },
            {
                "id": 510300,
                "name": "自贡市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 510301,
                        "name": "市辖区",
                        "pid": 510300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 510301
                    },
                    {
                        "id": 510302,
                        "name": "自流井区",
                        "pid": 510300,
                        "level": 2,
                        "text": "自流井区",
                        "value": 510302
                    },
                    {
                        "id": 510303,
                        "name": "贡井区",
                        "pid": 510300,
                        "level": 2,
                        "text": "贡井区",
                        "value": 510303
                    },
                    {
                        "id": 510304,
                        "name": "大安区",
                        "pid": 510300,
                        "level": 2,
                        "text": "大安区",
                        "value": 510304
                    },
                    {
                        "id": 510311,
                        "name": "沿滩区",
                        "pid": 510300,
                        "level": 2,
                        "text": "沿滩区",
                        "value": 510311
                    },
                    {
                        "id": 510321,
                        "name": "荣县",
                        "pid": 510300,
                        "level": 2,
                        "text": "荣县",
                        "value": 510321
                    },
                    {
                        "id": 510322,
                        "name": "富顺县",
                        "pid": 510300,
                        "level": 2,
                        "text": "富顺县",
                        "value": 510322
                    }
                ],
                "text": "自贡市",
                "value": 510300
            },
            {
                "id": 510400,
                "name": "攀枝花市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 510401,
                        "name": "市辖区",
                        "pid": 510400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 510401
                    },
                    {
                        "id": 510402,
                        "name": "东区",
                        "pid": 510400,
                        "level": 2,
                        "text": "东区",
                        "value": 510402
                    },
                    {
                        "id": 510403,
                        "name": "西区",
                        "pid": 510400,
                        "level": 2,
                        "text": "西区",
                        "value": 510403
                    },
                    {
                        "id": 510411,
                        "name": "仁和区",
                        "pid": 510400,
                        "level": 2,
                        "text": "仁和区",
                        "value": 510411
                    },
                    {
                        "id": 510421,
                        "name": "米易县",
                        "pid": 510400,
                        "level": 2,
                        "text": "米易县",
                        "value": 510421
                    },
                    {
                        "id": 510422,
                        "name": "盐边县",
                        "pid": 510400,
                        "level": 2,
                        "text": "盐边县",
                        "value": 510422
                    }
                ],
                "text": "攀枝花市",
                "value": 510400
            },
            {
                "id": 510500,
                "name": "泸州市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 510501,
                        "name": "市辖区",
                        "pid": 510500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 510501
                    },
                    {
                        "id": 510502,
                        "name": "江阳区",
                        "pid": 510500,
                        "level": 2,
                        "text": "江阳区",
                        "value": 510502
                    },
                    {
                        "id": 510503,
                        "name": "纳溪区",
                        "pid": 510500,
                        "level": 2,
                        "text": "纳溪区",
                        "value": 510503
                    },
                    {
                        "id": 510504,
                        "name": "龙马潭区",
                        "pid": 510500,
                        "level": 2,
                        "text": "龙马潭区",
                        "value": 510504
                    },
                    {
                        "id": 510521,
                        "name": "泸县",
                        "pid": 510500,
                        "level": 2,
                        "text": "泸县",
                        "value": 510521
                    },
                    {
                        "id": 510522,
                        "name": "合江县",
                        "pid": 510500,
                        "level": 2,
                        "text": "合江县",
                        "value": 510522
                    },
                    {
                        "id": 510524,
                        "name": "叙永县",
                        "pid": 510500,
                        "level": 2,
                        "text": "叙永县",
                        "value": 510524
                    },
                    {
                        "id": 510525,
                        "name": "古蔺县",
                        "pid": 510500,
                        "level": 2,
                        "text": "古蔺县",
                        "value": 510525
                    }
                ],
                "text": "泸州市",
                "value": 510500
            },
            {
                "id": 510600,
                "name": "德阳市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 510601,
                        "name": "市辖区",
                        "pid": 510600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 510601
                    },
                    {
                        "id": 510603,
                        "name": "旌阳区",
                        "pid": 510600,
                        "level": 2,
                        "text": "旌阳区",
                        "value": 510603
                    },
                    {
                        "id": 510623,
                        "name": "中江县",
                        "pid": 510600,
                        "level": 2,
                        "text": "中江县",
                        "value": 510623
                    },
                    {
                        "id": 510626,
                        "name": "罗江县",
                        "pid": 510600,
                        "level": 2,
                        "text": "罗江县",
                        "value": 510626
                    },
                    {
                        "id": 510681,
                        "name": "广汉市",
                        "pid": 510600,
                        "level": 2,
                        "text": "广汉市",
                        "value": 510681
                    },
                    {
                        "id": 510682,
                        "name": "什邡市",
                        "pid": 510600,
                        "level": 2,
                        "text": "什邡市",
                        "value": 510682
                    },
                    {
                        "id": 510683,
                        "name": "绵竹市",
                        "pid": 510600,
                        "level": 2,
                        "text": "绵竹市",
                        "value": 510683
                    }
                ],
                "text": "德阳市",
                "value": 510600
            },
            {
                "id": 510700,
                "name": "绵阳市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 510701,
                        "name": "市辖区",
                        "pid": 510700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 510701
                    },
                    {
                        "id": 510703,
                        "name": "涪城区",
                        "pid": 510700,
                        "level": 2,
                        "text": "涪城区",
                        "value": 510703
                    },
                    {
                        "id": 510704,
                        "name": "游仙区",
                        "pid": 510700,
                        "level": 2,
                        "text": "游仙区",
                        "value": 510704
                    },
                    {
                        "id": 510705,
                        "name": "安州区",
                        "pid": 510700,
                        "level": 2,
                        "text": "安州区",
                        "value": 510705
                    },
                    {
                        "id": 510722,
                        "name": "三台县",
                        "pid": 510700,
                        "level": 2,
                        "text": "三台县",
                        "value": 510722
                    },
                    {
                        "id": 510723,
                        "name": "盐亭县",
                        "pid": 510700,
                        "level": 2,
                        "text": "盐亭县",
                        "value": 510723
                    },
                    {
                        "id": 510725,
                        "name": "梓潼县",
                        "pid": 510700,
                        "level": 2,
                        "text": "梓潼县",
                        "value": 510725
                    },
                    {
                        "id": 510726,
                        "name": "北川羌族自治县",
                        "pid": 510700,
                        "level": 2,
                        "text": "北川羌族自治县",
                        "value": 510726
                    },
                    {
                        "id": 510727,
                        "name": "平武县",
                        "pid": 510700,
                        "level": 2,
                        "text": "平武县",
                        "value": 510727
                    },
                    {
                        "id": 510781,
                        "name": "江油市",
                        "pid": 510700,
                        "level": 2,
                        "text": "江油市",
                        "value": 510781
                    }
                ],
                "text": "绵阳市",
                "value": 510700
            },
            {
                "id": 510800,
                "name": "广元市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 510801,
                        "name": "市辖区",
                        "pid": 510800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 510801
                    },
                    {
                        "id": 510802,
                        "name": "利州区",
                        "pid": 510800,
                        "level": 2,
                        "text": "利州区",
                        "value": 510802
                    },
                    {
                        "id": 510811,
                        "name": "昭化区",
                        "pid": 510800,
                        "level": 2,
                        "text": "昭化区",
                        "value": 510811
                    },
                    {
                        "id": 510812,
                        "name": "朝天区",
                        "pid": 510800,
                        "level": 2,
                        "text": "朝天区",
                        "value": 510812
                    },
                    {
                        "id": 510821,
                        "name": "旺苍县",
                        "pid": 510800,
                        "level": 2,
                        "text": "旺苍县",
                        "value": 510821
                    },
                    {
                        "id": 510822,
                        "name": "青川县",
                        "pid": 510800,
                        "level": 2,
                        "text": "青川县",
                        "value": 510822
                    },
                    {
                        "id": 510823,
                        "name": "剑阁县",
                        "pid": 510800,
                        "level": 2,
                        "text": "剑阁县",
                        "value": 510823
                    },
                    {
                        "id": 510824,
                        "name": "苍溪县",
                        "pid": 510800,
                        "level": 2,
                        "text": "苍溪县",
                        "value": 510824
                    }
                ],
                "text": "广元市",
                "value": 510800
            },
            {
                "id": 510900,
                "name": "遂宁市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 510901,
                        "name": "市辖区",
                        "pid": 510900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 510901
                    },
                    {
                        "id": 510903,
                        "name": "船山区",
                        "pid": 510900,
                        "level": 2,
                        "text": "船山区",
                        "value": 510903
                    },
                    {
                        "id": 510904,
                        "name": "安居区",
                        "pid": 510900,
                        "level": 2,
                        "text": "安居区",
                        "value": 510904
                    },
                    {
                        "id": 510921,
                        "name": "蓬溪县",
                        "pid": 510900,
                        "level": 2,
                        "text": "蓬溪县",
                        "value": 510921
                    },
                    {
                        "id": 510922,
                        "name": "射洪县",
                        "pid": 510900,
                        "level": 2,
                        "text": "射洪县",
                        "value": 510922
                    },
                    {
                        "id": 510923,
                        "name": "大英县",
                        "pid": 510900,
                        "level": 2,
                        "text": "大英县",
                        "value": 510923
                    }
                ],
                "text": "遂宁市",
                "value": 510900
            },
            {
                "id": 511000,
                "name": "内江市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 511001,
                        "name": "市辖区",
                        "pid": 511000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 511001
                    },
                    {
                        "id": 511002,
                        "name": "市中区",
                        "pid": 511000,
                        "level": 2,
                        "text": "市中区",
                        "value": 511002
                    },
                    {
                        "id": 511011,
                        "name": "东兴区",
                        "pid": 511000,
                        "level": 2,
                        "text": "东兴区",
                        "value": 511011
                    },
                    {
                        "id": 511024,
                        "name": "威远县",
                        "pid": 511000,
                        "level": 2,
                        "text": "威远县",
                        "value": 511024
                    },
                    {
                        "id": 511025,
                        "name": "资中县",
                        "pid": 511000,
                        "level": 2,
                        "text": "资中县",
                        "value": 511025
                    },
                    {
                        "id": 511028,
                        "name": "隆昌县",
                        "pid": 511000,
                        "level": 2,
                        "text": "隆昌县",
                        "value": 511028
                    }
                ],
                "text": "内江市",
                "value": 511000
            },
            {
                "id": 511100,
                "name": "乐山市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 511101,
                        "name": "市辖区",
                        "pid": 511100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 511101
                    },
                    {
                        "id": 511102,
                        "name": "市中区",
                        "pid": 511100,
                        "level": 2,
                        "text": "市中区",
                        "value": 511102
                    },
                    {
                        "id": 511111,
                        "name": "沙湾区",
                        "pid": 511100,
                        "level": 2,
                        "text": "沙湾区",
                        "value": 511111
                    },
                    {
                        "id": 511112,
                        "name": "五通桥区",
                        "pid": 511100,
                        "level": 2,
                        "text": "五通桥区",
                        "value": 511112
                    },
                    {
                        "id": 511113,
                        "name": "金口河区",
                        "pid": 511100,
                        "level": 2,
                        "text": "金口河区",
                        "value": 511113
                    },
                    {
                        "id": 511123,
                        "name": "犍为县",
                        "pid": 511100,
                        "level": 2,
                        "text": "犍为县",
                        "value": 511123
                    },
                    {
                        "id": 511124,
                        "name": "井研县",
                        "pid": 511100,
                        "level": 2,
                        "text": "井研县",
                        "value": 511124
                    },
                    {
                        "id": 511126,
                        "name": "夹江县",
                        "pid": 511100,
                        "level": 2,
                        "text": "夹江县",
                        "value": 511126
                    },
                    {
                        "id": 511129,
                        "name": "沐川县",
                        "pid": 511100,
                        "level": 2,
                        "text": "沐川县",
                        "value": 511129
                    },
                    {
                        "id": 511132,
                        "name": "峨边彝族自治县",
                        "pid": 511100,
                        "level": 2,
                        "text": "峨边彝族自治县",
                        "value": 511132
                    },
                    {
                        "id": 511133,
                        "name": "马边彝族自治县",
                        "pid": 511100,
                        "level": 2,
                        "text": "马边彝族自治县",
                        "value": 511133
                    },
                    {
                        "id": 511181,
                        "name": "峨眉山市",
                        "pid": 511100,
                        "level": 2,
                        "text": "峨眉山市",
                        "value": 511181
                    }
                ],
                "text": "乐山市",
                "value": 511100
            },
            {
                "id": 511300,
                "name": "南充市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 511301,
                        "name": "市辖区",
                        "pid": 511300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 511301
                    },
                    {
                        "id": 511302,
                        "name": "顺庆区",
                        "pid": 511300,
                        "level": 2,
                        "text": "顺庆区",
                        "value": 511302
                    },
                    {
                        "id": 511303,
                        "name": "高坪区",
                        "pid": 511300,
                        "level": 2,
                        "text": "高坪区",
                        "value": 511303
                    },
                    {
                        "id": 511304,
                        "name": "嘉陵区",
                        "pid": 511300,
                        "level": 2,
                        "text": "嘉陵区",
                        "value": 511304
                    },
                    {
                        "id": 511321,
                        "name": "南部县",
                        "pid": 511300,
                        "level": 2,
                        "text": "南部县",
                        "value": 511321
                    },
                    {
                        "id": 511322,
                        "name": "营山县",
                        "pid": 511300,
                        "level": 2,
                        "text": "营山县",
                        "value": 511322
                    },
                    {
                        "id": 511323,
                        "name": "蓬安县",
                        "pid": 511300,
                        "level": 2,
                        "text": "蓬安县",
                        "value": 511323
                    },
                    {
                        "id": 511324,
                        "name": "仪陇县",
                        "pid": 511300,
                        "level": 2,
                        "text": "仪陇县",
                        "value": 511324
                    },
                    {
                        "id": 511325,
                        "name": "西充县",
                        "pid": 511300,
                        "level": 2,
                        "text": "西充县",
                        "value": 511325
                    },
                    {
                        "id": 511381,
                        "name": "阆中市",
                        "pid": 511300,
                        "level": 2,
                        "text": "阆中市",
                        "value": 511381
                    }
                ],
                "text": "南充市",
                "value": 511300
            },
            {
                "id": 511400,
                "name": "眉山市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 511401,
                        "name": "市辖区",
                        "pid": 511400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 511401
                    },
                    {
                        "id": 511402,
                        "name": "东坡区",
                        "pid": 511400,
                        "level": 2,
                        "text": "东坡区",
                        "value": 511402
                    },
                    {
                        "id": 511403,
                        "name": "彭山区",
                        "pid": 511400,
                        "level": 2,
                        "text": "彭山区",
                        "value": 511403
                    },
                    {
                        "id": 511421,
                        "name": "仁寿县",
                        "pid": 511400,
                        "level": 2,
                        "text": "仁寿县",
                        "value": 511421
                    },
                    {
                        "id": 511423,
                        "name": "洪雅县",
                        "pid": 511400,
                        "level": 2,
                        "text": "洪雅县",
                        "value": 511423
                    },
                    {
                        "id": 511424,
                        "name": "丹棱县",
                        "pid": 511400,
                        "level": 2,
                        "text": "丹棱县",
                        "value": 511424
                    },
                    {
                        "id": 511425,
                        "name": "青神县",
                        "pid": 511400,
                        "level": 2,
                        "text": "青神县",
                        "value": 511425
                    }
                ],
                "text": "眉山市",
                "value": 511400
            },
            {
                "id": 511500,
                "name": "宜宾市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 511501,
                        "name": "市辖区",
                        "pid": 511500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 511501
                    },
                    {
                        "id": 511502,
                        "name": "翠屏区",
                        "pid": 511500,
                        "level": 2,
                        "text": "翠屏区",
                        "value": 511502
                    },
                    {
                        "id": 511503,
                        "name": "南溪区",
                        "pid": 511500,
                        "level": 2,
                        "text": "南溪区",
                        "value": 511503
                    },
                    {
                        "id": 511521,
                        "name": "宜宾县",
                        "pid": 511500,
                        "level": 2,
                        "text": "宜宾县",
                        "value": 511521
                    },
                    {
                        "id": 511523,
                        "name": "江安县",
                        "pid": 511500,
                        "level": 2,
                        "text": "江安县",
                        "value": 511523
                    },
                    {
                        "id": 511524,
                        "name": "长宁县",
                        "pid": 511500,
                        "level": 2,
                        "text": "长宁县",
                        "value": 511524
                    },
                    {
                        "id": 511525,
                        "name": "高县",
                        "pid": 511500,
                        "level": 2,
                        "text": "高县",
                        "value": 511525
                    },
                    {
                        "id": 511526,
                        "name": "珙县",
                        "pid": 511500,
                        "level": 2,
                        "text": "珙县",
                        "value": 511526
                    },
                    {
                        "id": 511527,
                        "name": "筠连县",
                        "pid": 511500,
                        "level": 2,
                        "text": "筠连县",
                        "value": 511527
                    },
                    {
                        "id": 511528,
                        "name": "兴文县",
                        "pid": 511500,
                        "level": 2,
                        "text": "兴文县",
                        "value": 511528
                    },
                    {
                        "id": 511529,
                        "name": "屏山县",
                        "pid": 511500,
                        "level": 2,
                        "text": "屏山县",
                        "value": 511529
                    }
                ],
                "text": "宜宾市",
                "value": 511500
            },
            {
                "id": 511600,
                "name": "广安市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 511601,
                        "name": "市辖区",
                        "pid": 511600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 511601
                    },
                    {
                        "id": 511602,
                        "name": "广安区",
                        "pid": 511600,
                        "level": 2,
                        "text": "广安区",
                        "value": 511602
                    },
                    {
                        "id": 511603,
                        "name": "前锋区",
                        "pid": 511600,
                        "level": 2,
                        "text": "前锋区",
                        "value": 511603
                    },
                    {
                        "id": 511621,
                        "name": "岳池县",
                        "pid": 511600,
                        "level": 2,
                        "text": "岳池县",
                        "value": 511621
                    },
                    {
                        "id": 511622,
                        "name": "武胜县",
                        "pid": 511600,
                        "level": 2,
                        "text": "武胜县",
                        "value": 511622
                    },
                    {
                        "id": 511623,
                        "name": "邻水县",
                        "pid": 511600,
                        "level": 2,
                        "text": "邻水县",
                        "value": 511623
                    },
                    {
                        "id": 511681,
                        "name": "华蓥市",
                        "pid": 511600,
                        "level": 2,
                        "text": "华蓥市",
                        "value": 511681
                    }
                ],
                "text": "广安市",
                "value": 511600
            },
            {
                "id": 511700,
                "name": "达州市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 511701,
                        "name": "市辖区",
                        "pid": 511700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 511701
                    },
                    {
                        "id": 511702,
                        "name": "通川区",
                        "pid": 511700,
                        "level": 2,
                        "text": "通川区",
                        "value": 511702
                    },
                    {
                        "id": 511703,
                        "name": "达川区",
                        "pid": 511700,
                        "level": 2,
                        "text": "达川区",
                        "value": 511703
                    },
                    {
                        "id": 511722,
                        "name": "宣汉县",
                        "pid": 511700,
                        "level": 2,
                        "text": "宣汉县",
                        "value": 511722
                    },
                    {
                        "id": 511723,
                        "name": "开江县",
                        "pid": 511700,
                        "level": 2,
                        "text": "开江县",
                        "value": 511723
                    },
                    {
                        "id": 511724,
                        "name": "大竹县",
                        "pid": 511700,
                        "level": 2,
                        "text": "大竹县",
                        "value": 511724
                    },
                    {
                        "id": 511725,
                        "name": "渠县",
                        "pid": 511700,
                        "level": 2,
                        "text": "渠县",
                        "value": 511725
                    },
                    {
                        "id": 511781,
                        "name": "万源市",
                        "pid": 511700,
                        "level": 2,
                        "text": "万源市",
                        "value": 511781
                    }
                ],
                "text": "达州市",
                "value": 511700
            },
            {
                "id": 511800,
                "name": "雅安市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 511801,
                        "name": "市辖区",
                        "pid": 511800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 511801
                    },
                    {
                        "id": 511802,
                        "name": "雨城区",
                        "pid": 511800,
                        "level": 2,
                        "text": "雨城区",
                        "value": 511802
                    },
                    {
                        "id": 511803,
                        "name": "名山区",
                        "pid": 511800,
                        "level": 2,
                        "text": "名山区",
                        "value": 511803
                    },
                    {
                        "id": 511822,
                        "name": "荥经县",
                        "pid": 511800,
                        "level": 2,
                        "text": "荥经县",
                        "value": 511822
                    },
                    {
                        "id": 511823,
                        "name": "汉源县",
                        "pid": 511800,
                        "level": 2,
                        "text": "汉源县",
                        "value": 511823
                    },
                    {
                        "id": 511824,
                        "name": "石棉县",
                        "pid": 511800,
                        "level": 2,
                        "text": "石棉县",
                        "value": 511824
                    },
                    {
                        "id": 511825,
                        "name": "天全县",
                        "pid": 511800,
                        "level": 2,
                        "text": "天全县",
                        "value": 511825
                    },
                    {
                        "id": 511826,
                        "name": "芦山县",
                        "pid": 511800,
                        "level": 2,
                        "text": "芦山县",
                        "value": 511826
                    },
                    {
                        "id": 511827,
                        "name": "宝兴县",
                        "pid": 511800,
                        "level": 2,
                        "text": "宝兴县",
                        "value": 511827
                    }
                ],
                "text": "雅安市",
                "value": 511800
            },
            {
                "id": 511900,
                "name": "巴中市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 511901,
                        "name": "市辖区",
                        "pid": 511900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 511901
                    },
                    {
                        "id": 511902,
                        "name": "巴州区",
                        "pid": 511900,
                        "level": 2,
                        "text": "巴州区",
                        "value": 511902
                    },
                    {
                        "id": 511903,
                        "name": "恩阳区",
                        "pid": 511900,
                        "level": 2,
                        "text": "恩阳区",
                        "value": 511903
                    },
                    {
                        "id": 511921,
                        "name": "通江县",
                        "pid": 511900,
                        "level": 2,
                        "text": "通江县",
                        "value": 511921
                    },
                    {
                        "id": 511922,
                        "name": "南江县",
                        "pid": 511900,
                        "level": 2,
                        "text": "南江县",
                        "value": 511922
                    },
                    {
                        "id": 511923,
                        "name": "平昌县",
                        "pid": 511900,
                        "level": 2,
                        "text": "平昌县",
                        "value": 511923
                    }
                ],
                "text": "巴中市",
                "value": 511900
            },
            {
                "id": 512000,
                "name": "资阳市",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 512001,
                        "name": "市辖区",
                        "pid": 512000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 512001
                    },
                    {
                        "id": 512002,
                        "name": "雁江区",
                        "pid": 512000,
                        "level": 2,
                        "text": "雁江区",
                        "value": 512002
                    },
                    {
                        "id": 512021,
                        "name": "安岳县",
                        "pid": 512000,
                        "level": 2,
                        "text": "安岳县",
                        "value": 512021
                    },
                    {
                        "id": 512022,
                        "name": "乐至县",
                        "pid": 512000,
                        "level": 2,
                        "text": "乐至县",
                        "value": 512022
                    }
                ],
                "text": "资阳市",
                "value": 512000
            },
            {
                "id": 513200,
                "name": "阿坝藏族羌族自治州",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 513201,
                        "name": "马尔康市",
                        "pid": 513200,
                        "level": 2,
                        "text": "马尔康市",
                        "value": 513201
                    },
                    {
                        "id": 513221,
                        "name": "汶川县",
                        "pid": 513200,
                        "level": 2,
                        "text": "汶川县",
                        "value": 513221
                    },
                    {
                        "id": 513222,
                        "name": "理县",
                        "pid": 513200,
                        "level": 2,
                        "text": "理县",
                        "value": 513222
                    },
                    {
                        "id": 513223,
                        "name": "茂县",
                        "pid": 513200,
                        "level": 2,
                        "text": "茂县",
                        "value": 513223
                    },
                    {
                        "id": 513224,
                        "name": "松潘县",
                        "pid": 513200,
                        "level": 2,
                        "text": "松潘县",
                        "value": 513224
                    },
                    {
                        "id": 513225,
                        "name": "九寨沟县",
                        "pid": 513200,
                        "level": 2,
                        "text": "九寨沟县",
                        "value": 513225
                    },
                    {
                        "id": 513226,
                        "name": "金川县",
                        "pid": 513200,
                        "level": 2,
                        "text": "金川县",
                        "value": 513226
                    },
                    {
                        "id": 513227,
                        "name": "小金县",
                        "pid": 513200,
                        "level": 2,
                        "text": "小金县",
                        "value": 513227
                    },
                    {
                        "id": 513228,
                        "name": "黑水县",
                        "pid": 513200,
                        "level": 2,
                        "text": "黑水县",
                        "value": 513228
                    },
                    {
                        "id": 513230,
                        "name": "壤塘县",
                        "pid": 513200,
                        "level": 2,
                        "text": "壤塘县",
                        "value": 513230
                    },
                    {
                        "id": 513231,
                        "name": "阿坝县",
                        "pid": 513200,
                        "level": 2,
                        "text": "阿坝县",
                        "value": 513231
                    },
                    {
                        "id": 513232,
                        "name": "若尔盖县",
                        "pid": 513200,
                        "level": 2,
                        "text": "若尔盖县",
                        "value": 513232
                    },
                    {
                        "id": 513233,
                        "name": "红原县",
                        "pid": 513200,
                        "level": 2,
                        "text": "红原县",
                        "value": 513233
                    }
                ],
                "text": "阿坝藏族羌族自治州",
                "value": 513200
            },
            {
                "id": 513300,
                "name": "甘孜藏族自治州",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 513301,
                        "name": "康定市",
                        "pid": 513300,
                        "level": 2,
                        "text": "康定市",
                        "value": 513301
                    },
                    {
                        "id": 513322,
                        "name": "泸定县",
                        "pid": 513300,
                        "level": 2,
                        "text": "泸定县",
                        "value": 513322
                    },
                    {
                        "id": 513323,
                        "name": "丹巴县",
                        "pid": 513300,
                        "level": 2,
                        "text": "丹巴县",
                        "value": 513323
                    },
                    {
                        "id": 513324,
                        "name": "九龙县",
                        "pid": 513300,
                        "level": 2,
                        "text": "九龙县",
                        "value": 513324
                    },
                    {
                        "id": 513325,
                        "name": "雅江县",
                        "pid": 513300,
                        "level": 2,
                        "text": "雅江县",
                        "value": 513325
                    },
                    {
                        "id": 513326,
                        "name": "道孚县",
                        "pid": 513300,
                        "level": 2,
                        "text": "道孚县",
                        "value": 513326
                    },
                    {
                        "id": 513327,
                        "name": "炉霍县",
                        "pid": 513300,
                        "level": 2,
                        "text": "炉霍县",
                        "value": 513327
                    },
                    {
                        "id": 513328,
                        "name": "甘孜县",
                        "pid": 513300,
                        "level": 2,
                        "text": "甘孜县",
                        "value": 513328
                    },
                    {
                        "id": 513329,
                        "name": "新龙县",
                        "pid": 513300,
                        "level": 2,
                        "text": "新龙县",
                        "value": 513329
                    },
                    {
                        "id": 513330,
                        "name": "德格县",
                        "pid": 513300,
                        "level": 2,
                        "text": "德格县",
                        "value": 513330
                    },
                    {
                        "id": 513331,
                        "name": "白玉县",
                        "pid": 513300,
                        "level": 2,
                        "text": "白玉县",
                        "value": 513331
                    },
                    {
                        "id": 513332,
                        "name": "石渠县",
                        "pid": 513300,
                        "level": 2,
                        "text": "石渠县",
                        "value": 513332
                    },
                    {
                        "id": 513333,
                        "name": "色达县",
                        "pid": 513300,
                        "level": 2,
                        "text": "色达县",
                        "value": 513333
                    },
                    {
                        "id": 513334,
                        "name": "理塘县",
                        "pid": 513300,
                        "level": 2,
                        "text": "理塘县",
                        "value": 513334
                    },
                    {
                        "id": 513335,
                        "name": "巴塘县",
                        "pid": 513300,
                        "level": 2,
                        "text": "巴塘县",
                        "value": 513335
                    },
                    {
                        "id": 513336,
                        "name": "乡城县",
                        "pid": 513300,
                        "level": 2,
                        "text": "乡城县",
                        "value": 513336
                    },
                    {
                        "id": 513337,
                        "name": "稻城县",
                        "pid": 513300,
                        "level": 2,
                        "text": "稻城县",
                        "value": 513337
                    },
                    {
                        "id": 513338,
                        "name": "得荣县",
                        "pid": 513300,
                        "level": 2,
                        "text": "得荣县",
                        "value": 513338
                    }
                ],
                "text": "甘孜藏族自治州",
                "value": 513300
            },
            {
                "id": 513400,
                "name": "凉山彝族自治州",
                "pid": 510000,
                "level": 1,
                "children": [
                    {
                        "id": 513401,
                        "name": "西昌市",
                        "pid": 513400,
                        "level": 2,
                        "text": "西昌市",
                        "value": 513401
                    },
                    {
                        "id": 513422,
                        "name": "木里藏族自治县",
                        "pid": 513400,
                        "level": 2,
                        "text": "木里藏族自治县",
                        "value": 513422
                    },
                    {
                        "id": 513423,
                        "name": "盐源县",
                        "pid": 513400,
                        "level": 2,
                        "text": "盐源县",
                        "value": 513423
                    },
                    {
                        "id": 513424,
                        "name": "德昌县",
                        "pid": 513400,
                        "level": 2,
                        "text": "德昌县",
                        "value": 513424
                    },
                    {
                        "id": 513425,
                        "name": "会理县",
                        "pid": 513400,
                        "level": 2,
                        "text": "会理县",
                        "value": 513425
                    },
                    {
                        "id": 513426,
                        "name": "会东县",
                        "pid": 513400,
                        "level": 2,
                        "text": "会东县",
                        "value": 513426
                    },
                    {
                        "id": 513427,
                        "name": "宁南县",
                        "pid": 513400,
                        "level": 2,
                        "text": "宁南县",
                        "value": 513427
                    },
                    {
                        "id": 513428,
                        "name": "普格县",
                        "pid": 513400,
                        "level": 2,
                        "text": "普格县",
                        "value": 513428
                    },
                    {
                        "id": 513429,
                        "name": "布拖县",
                        "pid": 513400,
                        "level": 2,
                        "text": "布拖县",
                        "value": 513429
                    },
                    {
                        "id": 513430,
                        "name": "金阳县",
                        "pid": 513400,
                        "level": 2,
                        "text": "金阳县",
                        "value": 513430
                    },
                    {
                        "id": 513431,
                        "name": "昭觉县",
                        "pid": 513400,
                        "level": 2,
                        "text": "昭觉县",
                        "value": 513431
                    },
                    {
                        "id": 513432,
                        "name": "喜德县",
                        "pid": 513400,
                        "level": 2,
                        "text": "喜德县",
                        "value": 513432
                    },
                    {
                        "id": 513433,
                        "name": "冕宁县",
                        "pid": 513400,
                        "level": 2,
                        "text": "冕宁县",
                        "value": 513433
                    },
                    {
                        "id": 513434,
                        "name": "越西县",
                        "pid": 513400,
                        "level": 2,
                        "text": "越西县",
                        "value": 513434
                    },
                    {
                        "id": 513435,
                        "name": "甘洛县",
                        "pid": 513400,
                        "level": 2,
                        "text": "甘洛县",
                        "value": 513435
                    },
                    {
                        "id": 513436,
                        "name": "美姑县",
                        "pid": 513400,
                        "level": 2,
                        "text": "美姑县",
                        "value": 513436
                    },
                    {
                        "id": 513437,
                        "name": "雷波县",
                        "pid": 513400,
                        "level": 2,
                        "text": "雷波县",
                        "value": 513437
                    }
                ],
                "text": "凉山彝族自治州",
                "value": 513400
            }
        ],
        "text": "四川省",
        "value": 510000
    },
    {
        "id": 520000,
        "name": "贵州省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 520100,
                "name": "贵阳市",
                "pid": 520000,
                "level": 1,
                "children": [
                    {
                        "id": 520101,
                        "name": "市辖区",
                        "pid": 520100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 520101
                    },
                    {
                        "id": 520102,
                        "name": "南明区",
                        "pid": 520100,
                        "level": 2,
                        "text": "南明区",
                        "value": 520102
                    },
                    {
                        "id": 520103,
                        "name": "云岩区",
                        "pid": 520100,
                        "level": 2,
                        "text": "云岩区",
                        "value": 520103
                    },
                    {
                        "id": 520111,
                        "name": "花溪区",
                        "pid": 520100,
                        "level": 2,
                        "text": "花溪区",
                        "value": 520111
                    },
                    {
                        "id": 520112,
                        "name": "乌当区",
                        "pid": 520100,
                        "level": 2,
                        "text": "乌当区",
                        "value": 520112
                    },
                    {
                        "id": 520113,
                        "name": "白云区",
                        "pid": 520100,
                        "level": 2,
                        "text": "白云区",
                        "value": 520113
                    },
                    {
                        "id": 520115,
                        "name": "观山湖区",
                        "pid": 520100,
                        "level": 2,
                        "text": "观山湖区",
                        "value": 520115
                    },
                    {
                        "id": 520121,
                        "name": "开阳县",
                        "pid": 520100,
                        "level": 2,
                        "text": "开阳县",
                        "value": 520121
                    },
                    {
                        "id": 520122,
                        "name": "息烽县",
                        "pid": 520100,
                        "level": 2,
                        "text": "息烽县",
                        "value": 520122
                    },
                    {
                        "id": 520123,
                        "name": "修文县",
                        "pid": 520100,
                        "level": 2,
                        "text": "修文县",
                        "value": 520123
                    },
                    {
                        "id": 520181,
                        "name": "清镇市",
                        "pid": 520100,
                        "level": 2,
                        "text": "清镇市",
                        "value": 520181
                    }
                ],
                "text": "贵阳市",
                "value": 520100
            },
            {
                "id": 520200,
                "name": "六盘水市",
                "pid": 520000,
                "level": 1,
                "children": [
                    {
                        "id": 520201,
                        "name": "钟山区",
                        "pid": 520200,
                        "level": 2,
                        "text": "钟山区",
                        "value": 520201
                    },
                    {
                        "id": 520203,
                        "name": "六枝特区",
                        "pid": 520200,
                        "level": 2,
                        "text": "六枝特区",
                        "value": 520203
                    },
                    {
                        "id": 520221,
                        "name": "水城县",
                        "pid": 520200,
                        "level": 2,
                        "text": "水城县",
                        "value": 520221
                    },
                    {
                        "id": 520222,
                        "name": "盘县",
                        "pid": 520200,
                        "level": 2,
                        "text": "盘县",
                        "value": 520222
                    }
                ],
                "text": "六盘水市",
                "value": 520200
            },
            {
                "id": 520300,
                "name": "遵义市",
                "pid": 520000,
                "level": 1,
                "children": [
                    {
                        "id": 520301,
                        "name": "市辖区",
                        "pid": 520300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 520301
                    },
                    {
                        "id": 520302,
                        "name": "红花岗区",
                        "pid": 520300,
                        "level": 2,
                        "text": "红花岗区",
                        "value": 520302
                    },
                    {
                        "id": 520303,
                        "name": "汇川区",
                        "pid": 520300,
                        "level": 2,
                        "text": "汇川区",
                        "value": 520303
                    },
                    {
                        "id": 520304,
                        "name": "播州区",
                        "pid": 520300,
                        "level": 2,
                        "text": "播州区",
                        "value": 520304
                    },
                    {
                        "id": 520322,
                        "name": "桐梓县",
                        "pid": 520300,
                        "level": 2,
                        "text": "桐梓县",
                        "value": 520322
                    },
                    {
                        "id": 520323,
                        "name": "绥阳县",
                        "pid": 520300,
                        "level": 2,
                        "text": "绥阳县",
                        "value": 520323
                    },
                    {
                        "id": 520324,
                        "name": "正安县",
                        "pid": 520300,
                        "level": 2,
                        "text": "正安县",
                        "value": 520324
                    },
                    {
                        "id": 520325,
                        "name": "道真仡佬族苗族自治县",
                        "pid": 520300,
                        "level": 2,
                        "text": "道真仡佬族苗族自治县",
                        "value": 520325
                    },
                    {
                        "id": 520326,
                        "name": "务川仡佬族苗族自治县",
                        "pid": 520300,
                        "level": 2,
                        "text": "务川仡佬族苗族自治县",
                        "value": 520326
                    },
                    {
                        "id": 520327,
                        "name": "凤冈县",
                        "pid": 520300,
                        "level": 2,
                        "text": "凤冈县",
                        "value": 520327
                    },
                    {
                        "id": 520328,
                        "name": "湄潭县",
                        "pid": 520300,
                        "level": 2,
                        "text": "湄潭县",
                        "value": 520328
                    },
                    {
                        "id": 520329,
                        "name": "余庆县",
                        "pid": 520300,
                        "level": 2,
                        "text": "余庆县",
                        "value": 520329
                    },
                    {
                        "id": 520330,
                        "name": "习水县",
                        "pid": 520300,
                        "level": 2,
                        "text": "习水县",
                        "value": 520330
                    },
                    {
                        "id": 520381,
                        "name": "赤水市",
                        "pid": 520300,
                        "level": 2,
                        "text": "赤水市",
                        "value": 520381
                    },
                    {
                        "id": 520382,
                        "name": "仁怀市",
                        "pid": 520300,
                        "level": 2,
                        "text": "仁怀市",
                        "value": 520382
                    }
                ],
                "text": "遵义市",
                "value": 520300
            },
            {
                "id": 520400,
                "name": "安顺市",
                "pid": 520000,
                "level": 1,
                "children": [
                    {
                        "id": 520401,
                        "name": "市辖区",
                        "pid": 520400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 520401
                    },
                    {
                        "id": 520402,
                        "name": "西秀区",
                        "pid": 520400,
                        "level": 2,
                        "text": "西秀区",
                        "value": 520402
                    },
                    {
                        "id": 520403,
                        "name": "平坝区",
                        "pid": 520400,
                        "level": 2,
                        "text": "平坝区",
                        "value": 520403
                    },
                    {
                        "id": 520422,
                        "name": "普定县",
                        "pid": 520400,
                        "level": 2,
                        "text": "普定县",
                        "value": 520422
                    },
                    {
                        "id": 520423,
                        "name": "镇宁布依族苗族自治县",
                        "pid": 520400,
                        "level": 2,
                        "text": "镇宁布依族苗族自治县",
                        "value": 520423
                    },
                    {
                        "id": 520424,
                        "name": "关岭布依族苗族自治县",
                        "pid": 520400,
                        "level": 2,
                        "text": "关岭布依族苗族自治县",
                        "value": 520424
                    },
                    {
                        "id": 520425,
                        "name": "紫云苗族布依族自治县",
                        "pid": 520400,
                        "level": 2,
                        "text": "紫云苗族布依族自治县",
                        "value": 520425
                    }
                ],
                "text": "安顺市",
                "value": 520400
            },
            {
                "id": 520500,
                "name": "毕节市",
                "pid": 520000,
                "level": 1,
                "children": [
                    {
                        "id": 520501,
                        "name": "市辖区",
                        "pid": 520500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 520501
                    },
                    {
                        "id": 520502,
                        "name": "七星关区",
                        "pid": 520500,
                        "level": 2,
                        "text": "七星关区",
                        "value": 520502
                    },
                    {
                        "id": 520521,
                        "name": "大方县",
                        "pid": 520500,
                        "level": 2,
                        "text": "大方县",
                        "value": 520521
                    },
                    {
                        "id": 520522,
                        "name": "黔西县",
                        "pid": 520500,
                        "level": 2,
                        "text": "黔西县",
                        "value": 520522
                    },
                    {
                        "id": 520523,
                        "name": "金沙县",
                        "pid": 520500,
                        "level": 2,
                        "text": "金沙县",
                        "value": 520523
                    },
                    {
                        "id": 520524,
                        "name": "织金县",
                        "pid": 520500,
                        "level": 2,
                        "text": "织金县",
                        "value": 520524
                    },
                    {
                        "id": 520525,
                        "name": "纳雍县",
                        "pid": 520500,
                        "level": 2,
                        "text": "纳雍县",
                        "value": 520525
                    },
                    {
                        "id": 520526,
                        "name": "威宁彝族回族苗族自治县",
                        "pid": 520500,
                        "level": 2,
                        "text": "威宁彝族回族苗族自治县",
                        "value": 520526
                    },
                    {
                        "id": 520527,
                        "name": "赫章县",
                        "pid": 520500,
                        "level": 2,
                        "text": "赫章县",
                        "value": 520527
                    }
                ],
                "text": "毕节市",
                "value": 520500
            },
            {
                "id": 520600,
                "name": "铜仁市",
                "pid": 520000,
                "level": 1,
                "children": [
                    {
                        "id": 520601,
                        "name": "市辖区",
                        "pid": 520600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 520601
                    },
                    {
                        "id": 520602,
                        "name": "碧江区",
                        "pid": 520600,
                        "level": 2,
                        "text": "碧江区",
                        "value": 520602
                    },
                    {
                        "id": 520603,
                        "name": "万山区",
                        "pid": 520600,
                        "level": 2,
                        "text": "万山区",
                        "value": 520603
                    },
                    {
                        "id": 520621,
                        "name": "江口县",
                        "pid": 520600,
                        "level": 2,
                        "text": "江口县",
                        "value": 520621
                    },
                    {
                        "id": 520622,
                        "name": "玉屏侗族自治县",
                        "pid": 520600,
                        "level": 2,
                        "text": "玉屏侗族自治县",
                        "value": 520622
                    },
                    {
                        "id": 520623,
                        "name": "石阡县",
                        "pid": 520600,
                        "level": 2,
                        "text": "石阡县",
                        "value": 520623
                    },
                    {
                        "id": 520624,
                        "name": "思南县",
                        "pid": 520600,
                        "level": 2,
                        "text": "思南县",
                        "value": 520624
                    },
                    {
                        "id": 520625,
                        "name": "印江土家族苗族自治县",
                        "pid": 520600,
                        "level": 2,
                        "text": "印江土家族苗族自治县",
                        "value": 520625
                    },
                    {
                        "id": 520626,
                        "name": "德江县",
                        "pid": 520600,
                        "level": 2,
                        "text": "德江县",
                        "value": 520626
                    },
                    {
                        "id": 520627,
                        "name": "沿河土家族自治县",
                        "pid": 520600,
                        "level": 2,
                        "text": "沿河土家族自治县",
                        "value": 520627
                    },
                    {
                        "id": 520628,
                        "name": "松桃苗族自治县",
                        "pid": 520600,
                        "level": 2,
                        "text": "松桃苗族自治县",
                        "value": 520628
                    }
                ],
                "text": "铜仁市",
                "value": 520600
            },
            {
                "id": 522300,
                "name": "黔西南布依族苗族自治州",
                "pid": 520000,
                "level": 1,
                "children": [
                    {
                        "id": 522301,
                        "name": "兴义市",
                        "pid": 522300,
                        "level": 2,
                        "text": "兴义市",
                        "value": 522301
                    },
                    {
                        "id": 522322,
                        "name": "兴仁县",
                        "pid": 522300,
                        "level": 2,
                        "text": "兴仁县",
                        "value": 522322
                    },
                    {
                        "id": 522323,
                        "name": "普安县",
                        "pid": 522300,
                        "level": 2,
                        "text": "普安县",
                        "value": 522323
                    },
                    {
                        "id": 522324,
                        "name": "晴隆县",
                        "pid": 522300,
                        "level": 2,
                        "text": "晴隆县",
                        "value": 522324
                    },
                    {
                        "id": 522325,
                        "name": "贞丰县",
                        "pid": 522300,
                        "level": 2,
                        "text": "贞丰县",
                        "value": 522325
                    },
                    {
                        "id": 522326,
                        "name": "望谟县",
                        "pid": 522300,
                        "level": 2,
                        "text": "望谟县",
                        "value": 522326
                    },
                    {
                        "id": 522327,
                        "name": "册亨县",
                        "pid": 522300,
                        "level": 2,
                        "text": "册亨县",
                        "value": 522327
                    },
                    {
                        "id": 522328,
                        "name": "安龙县",
                        "pid": 522300,
                        "level": 2,
                        "text": "安龙县",
                        "value": 522328
                    }
                ],
                "text": "黔西南布依族苗族自治州",
                "value": 522300
            },
            {
                "id": 522600,
                "name": "黔东南苗族侗族自治州",
                "pid": 520000,
                "level": 1,
                "children": [
                    {
                        "id": 522601,
                        "name": "凯里市",
                        "pid": 522600,
                        "level": 2,
                        "text": "凯里市",
                        "value": 522601
                    },
                    {
                        "id": 522622,
                        "name": "黄平县",
                        "pid": 522600,
                        "level": 2,
                        "text": "黄平县",
                        "value": 522622
                    },
                    {
                        "id": 522623,
                        "name": "施秉县",
                        "pid": 522600,
                        "level": 2,
                        "text": "施秉县",
                        "value": 522623
                    },
                    {
                        "id": 522624,
                        "name": "三穗县",
                        "pid": 522600,
                        "level": 2,
                        "text": "三穗县",
                        "value": 522624
                    },
                    {
                        "id": 522625,
                        "name": "镇远县",
                        "pid": 522600,
                        "level": 2,
                        "text": "镇远县",
                        "value": 522625
                    },
                    {
                        "id": 522626,
                        "name": "岑巩县",
                        "pid": 522600,
                        "level": 2,
                        "text": "岑巩县",
                        "value": 522626
                    },
                    {
                        "id": 522627,
                        "name": "天柱县",
                        "pid": 522600,
                        "level": 2,
                        "text": "天柱县",
                        "value": 522627
                    },
                    {
                        "id": 522628,
                        "name": "锦屏县",
                        "pid": 522600,
                        "level": 2,
                        "text": "锦屏县",
                        "value": 522628
                    },
                    {
                        "id": 522629,
                        "name": "剑河县",
                        "pid": 522600,
                        "level": 2,
                        "text": "剑河县",
                        "value": 522629
                    },
                    {
                        "id": 522630,
                        "name": "台江县",
                        "pid": 522600,
                        "level": 2,
                        "text": "台江县",
                        "value": 522630
                    },
                    {
                        "id": 522631,
                        "name": "黎平县",
                        "pid": 522600,
                        "level": 2,
                        "text": "黎平县",
                        "value": 522631
                    },
                    {
                        "id": 522632,
                        "name": "榕江县",
                        "pid": 522600,
                        "level": 2,
                        "text": "榕江县",
                        "value": 522632
                    },
                    {
                        "id": 522633,
                        "name": "从江县",
                        "pid": 522600,
                        "level": 2,
                        "text": "从江县",
                        "value": 522633
                    },
                    {
                        "id": 522634,
                        "name": "雷山县",
                        "pid": 522600,
                        "level": 2,
                        "text": "雷山县",
                        "value": 522634
                    },
                    {
                        "id": 522635,
                        "name": "麻江县",
                        "pid": 522600,
                        "level": 2,
                        "text": "麻江县",
                        "value": 522635
                    },
                    {
                        "id": 522636,
                        "name": "丹寨县",
                        "pid": 522600,
                        "level": 2,
                        "text": "丹寨县",
                        "value": 522636
                    }
                ],
                "text": "黔东南苗族侗族自治州",
                "value": 522600
            },
            {
                "id": 522700,
                "name": "黔南布依族苗族自治州",
                "pid": 520000,
                "level": 1,
                "children": [
                    {
                        "id": 522701,
                        "name": "都匀市",
                        "pid": 522700,
                        "level": 2,
                        "text": "都匀市",
                        "value": 522701
                    },
                    {
                        "id": 522702,
                        "name": "福泉市",
                        "pid": 522700,
                        "level": 2,
                        "text": "福泉市",
                        "value": 522702
                    },
                    {
                        "id": 522722,
                        "name": "荔波县",
                        "pid": 522700,
                        "level": 2,
                        "text": "荔波县",
                        "value": 522722
                    },
                    {
                        "id": 522723,
                        "name": "贵定县",
                        "pid": 522700,
                        "level": 2,
                        "text": "贵定县",
                        "value": 522723
                    },
                    {
                        "id": 522725,
                        "name": "瓮安县",
                        "pid": 522700,
                        "level": 2,
                        "text": "瓮安县",
                        "value": 522725
                    },
                    {
                        "id": 522726,
                        "name": "独山县",
                        "pid": 522700,
                        "level": 2,
                        "text": "独山县",
                        "value": 522726
                    },
                    {
                        "id": 522727,
                        "name": "平塘县",
                        "pid": 522700,
                        "level": 2,
                        "text": "平塘县",
                        "value": 522727
                    },
                    {
                        "id": 522728,
                        "name": "罗甸县",
                        "pid": 522700,
                        "level": 2,
                        "text": "罗甸县",
                        "value": 522728
                    },
                    {
                        "id": 522729,
                        "name": "长顺县",
                        "pid": 522700,
                        "level": 2,
                        "text": "长顺县",
                        "value": 522729
                    },
                    {
                        "id": 522730,
                        "name": "龙里县",
                        "pid": 522700,
                        "level": 2,
                        "text": "龙里县",
                        "value": 522730
                    },
                    {
                        "id": 522731,
                        "name": "惠水县",
                        "pid": 522700,
                        "level": 2,
                        "text": "惠水县",
                        "value": 522731
                    },
                    {
                        "id": 522732,
                        "name": "三都水族自治县",
                        "pid": 522700,
                        "level": 2,
                        "text": "三都水族自治县",
                        "value": 522732
                    }
                ],
                "text": "黔南布依族苗族自治州",
                "value": 522700
            }
        ],
        "text": "贵州省",
        "value": 520000
    },
    {
        "id": 530000,
        "name": "云南省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 530100,
                "name": "昆明市",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 530101,
                        "name": "市辖区",
                        "pid": 530100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 530101
                    },
                    {
                        "id": 530102,
                        "name": "五华区",
                        "pid": 530100,
                        "level": 2,
                        "text": "五华区",
                        "value": 530102
                    },
                    {
                        "id": 530103,
                        "name": "盘龙区",
                        "pid": 530100,
                        "level": 2,
                        "text": "盘龙区",
                        "value": 530103
                    },
                    {
                        "id": 530111,
                        "name": "官渡区",
                        "pid": 530100,
                        "level": 2,
                        "text": "官渡区",
                        "value": 530111
                    },
                    {
                        "id": 530112,
                        "name": "西山区",
                        "pid": 530100,
                        "level": 2,
                        "text": "西山区",
                        "value": 530112
                    },
                    {
                        "id": 530113,
                        "name": "东川区",
                        "pid": 530100,
                        "level": 2,
                        "text": "东川区",
                        "value": 530113
                    },
                    {
                        "id": 530114,
                        "name": "呈贡区",
                        "pid": 530100,
                        "level": 2,
                        "text": "呈贡区",
                        "value": 530114
                    },
                    {
                        "id": 530122,
                        "name": "晋宁县",
                        "pid": 530100,
                        "level": 2,
                        "text": "晋宁县",
                        "value": 530122
                    },
                    {
                        "id": 530124,
                        "name": "富民县",
                        "pid": 530100,
                        "level": 2,
                        "text": "富民县",
                        "value": 530124
                    },
                    {
                        "id": 530125,
                        "name": "宜良县",
                        "pid": 530100,
                        "level": 2,
                        "text": "宜良县",
                        "value": 530125
                    },
                    {
                        "id": 530126,
                        "name": "石林彝族自治县",
                        "pid": 530100,
                        "level": 2,
                        "text": "石林彝族自治县",
                        "value": 530126
                    },
                    {
                        "id": 530127,
                        "name": "嵩明县",
                        "pid": 530100,
                        "level": 2,
                        "text": "嵩明县",
                        "value": 530127
                    },
                    {
                        "id": 530128,
                        "name": "禄劝彝族苗族自治县",
                        "pid": 530100,
                        "level": 2,
                        "text": "禄劝彝族苗族自治县",
                        "value": 530128
                    },
                    {
                        "id": 530129,
                        "name": "寻甸回族彝族自治县",
                        "pid": 530100,
                        "level": 2,
                        "text": "寻甸回族彝族自治县",
                        "value": 530129
                    },
                    {
                        "id": 530181,
                        "name": "安宁市",
                        "pid": 530100,
                        "level": 2,
                        "text": "安宁市",
                        "value": 530181
                    }
                ],
                "text": "昆明市",
                "value": 530100
            },
            {
                "id": 530300,
                "name": "曲靖市",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 530301,
                        "name": "市辖区",
                        "pid": 530300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 530301
                    },
                    {
                        "id": 530302,
                        "name": "麒麟区",
                        "pid": 530300,
                        "level": 2,
                        "text": "麒麟区",
                        "value": 530302
                    },
                    {
                        "id": 530303,
                        "name": "沾益区",
                        "pid": 530300,
                        "level": 2,
                        "text": "沾益区",
                        "value": 530303
                    },
                    {
                        "id": 530321,
                        "name": "马龙县",
                        "pid": 530300,
                        "level": 2,
                        "text": "马龙县",
                        "value": 530321
                    },
                    {
                        "id": 530322,
                        "name": "陆良县",
                        "pid": 530300,
                        "level": 2,
                        "text": "陆良县",
                        "value": 530322
                    },
                    {
                        "id": 530323,
                        "name": "师宗县",
                        "pid": 530300,
                        "level": 2,
                        "text": "师宗县",
                        "value": 530323
                    },
                    {
                        "id": 530324,
                        "name": "罗平县",
                        "pid": 530300,
                        "level": 2,
                        "text": "罗平县",
                        "value": 530324
                    },
                    {
                        "id": 530325,
                        "name": "富源县",
                        "pid": 530300,
                        "level": 2,
                        "text": "富源县",
                        "value": 530325
                    },
                    {
                        "id": 530326,
                        "name": "会泽县",
                        "pid": 530300,
                        "level": 2,
                        "text": "会泽县",
                        "value": 530326
                    },
                    {
                        "id": 530381,
                        "name": "宣威市",
                        "pid": 530300,
                        "level": 2,
                        "text": "宣威市",
                        "value": 530381
                    }
                ],
                "text": "曲靖市",
                "value": 530300
            },
            {
                "id": 530400,
                "name": "玉溪市",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 530401,
                        "name": "市辖区",
                        "pid": 530400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 530401
                    },
                    {
                        "id": 530402,
                        "name": "红塔区",
                        "pid": 530400,
                        "level": 2,
                        "text": "红塔区",
                        "value": 530402
                    },
                    {
                        "id": 530403,
                        "name": "江川区",
                        "pid": 530400,
                        "level": 2,
                        "text": "江川区",
                        "value": 530403
                    },
                    {
                        "id": 530422,
                        "name": "澄江县",
                        "pid": 530400,
                        "level": 2,
                        "text": "澄江县",
                        "value": 530422
                    },
                    {
                        "id": 530423,
                        "name": "通海县",
                        "pid": 530400,
                        "level": 2,
                        "text": "通海县",
                        "value": 530423
                    },
                    {
                        "id": 530424,
                        "name": "华宁县",
                        "pid": 530400,
                        "level": 2,
                        "text": "华宁县",
                        "value": 530424
                    },
                    {
                        "id": 530425,
                        "name": "易门县",
                        "pid": 530400,
                        "level": 2,
                        "text": "易门县",
                        "value": 530425
                    },
                    {
                        "id": 530426,
                        "name": "峨山彝族自治县",
                        "pid": 530400,
                        "level": 2,
                        "text": "峨山彝族自治县",
                        "value": 530426
                    },
                    {
                        "id": 530427,
                        "name": "新平彝族傣族自治县",
                        "pid": 530400,
                        "level": 2,
                        "text": "新平彝族傣族自治县",
                        "value": 530427
                    },
                    {
                        "id": 530428,
                        "name": "元江哈尼族彝族傣族自治县",
                        "pid": 530400,
                        "level": 2,
                        "text": "元江哈尼族彝族傣族自治县",
                        "value": 530428
                    }
                ],
                "text": "玉溪市",
                "value": 530400
            },
            {
                "id": 530500,
                "name": "保山市",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 530501,
                        "name": "市辖区",
                        "pid": 530500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 530501
                    },
                    {
                        "id": 530502,
                        "name": "隆阳区",
                        "pid": 530500,
                        "level": 2,
                        "text": "隆阳区",
                        "value": 530502
                    },
                    {
                        "id": 530521,
                        "name": "施甸县",
                        "pid": 530500,
                        "level": 2,
                        "text": "施甸县",
                        "value": 530521
                    },
                    {
                        "id": 530523,
                        "name": "龙陵县",
                        "pid": 530500,
                        "level": 2,
                        "text": "龙陵县",
                        "value": 530523
                    },
                    {
                        "id": 530524,
                        "name": "昌宁县",
                        "pid": 530500,
                        "level": 2,
                        "text": "昌宁县",
                        "value": 530524
                    },
                    {
                        "id": 530581,
                        "name": "腾冲市",
                        "pid": 530500,
                        "level": 2,
                        "text": "腾冲市",
                        "value": 530581
                    }
                ],
                "text": "保山市",
                "value": 530500
            },
            {
                "id": 530600,
                "name": "昭通市",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 530601,
                        "name": "市辖区",
                        "pid": 530600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 530601
                    },
                    {
                        "id": 530602,
                        "name": "昭阳区",
                        "pid": 530600,
                        "level": 2,
                        "text": "昭阳区",
                        "value": 530602
                    },
                    {
                        "id": 530621,
                        "name": "鲁甸县",
                        "pid": 530600,
                        "level": 2,
                        "text": "鲁甸县",
                        "value": 530621
                    },
                    {
                        "id": 530622,
                        "name": "巧家县",
                        "pid": 530600,
                        "level": 2,
                        "text": "巧家县",
                        "value": 530622
                    },
                    {
                        "id": 530623,
                        "name": "盐津县",
                        "pid": 530600,
                        "level": 2,
                        "text": "盐津县",
                        "value": 530623
                    },
                    {
                        "id": 530624,
                        "name": "大关县",
                        "pid": 530600,
                        "level": 2,
                        "text": "大关县",
                        "value": 530624
                    },
                    {
                        "id": 530625,
                        "name": "永善县",
                        "pid": 530600,
                        "level": 2,
                        "text": "永善县",
                        "value": 530625
                    },
                    {
                        "id": 530626,
                        "name": "绥江县",
                        "pid": 530600,
                        "level": 2,
                        "text": "绥江县",
                        "value": 530626
                    },
                    {
                        "id": 530627,
                        "name": "镇雄县",
                        "pid": 530600,
                        "level": 2,
                        "text": "镇雄县",
                        "value": 530627
                    },
                    {
                        "id": 530628,
                        "name": "彝良县",
                        "pid": 530600,
                        "level": 2,
                        "text": "彝良县",
                        "value": 530628
                    },
                    {
                        "id": 530629,
                        "name": "威信县",
                        "pid": 530600,
                        "level": 2,
                        "text": "威信县",
                        "value": 530629
                    },
                    {
                        "id": 530630,
                        "name": "水富县",
                        "pid": 530600,
                        "level": 2,
                        "text": "水富县",
                        "value": 530630
                    }
                ],
                "text": "昭通市",
                "value": 530600
            },
            {
                "id": 530700,
                "name": "丽江市",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 530701,
                        "name": "市辖区",
                        "pid": 530700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 530701
                    },
                    {
                        "id": 530702,
                        "name": "古城区",
                        "pid": 530700,
                        "level": 2,
                        "text": "古城区",
                        "value": 530702
                    },
                    {
                        "id": 530721,
                        "name": "玉龙纳西族自治县",
                        "pid": 530700,
                        "level": 2,
                        "text": "玉龙纳西族自治县",
                        "value": 530721
                    },
                    {
                        "id": 530722,
                        "name": "永胜县",
                        "pid": 530700,
                        "level": 2,
                        "text": "永胜县",
                        "value": 530722
                    },
                    {
                        "id": 530723,
                        "name": "华坪县",
                        "pid": 530700,
                        "level": 2,
                        "text": "华坪县",
                        "value": 530723
                    },
                    {
                        "id": 530724,
                        "name": "宁蒗彝族自治县",
                        "pid": 530700,
                        "level": 2,
                        "text": "宁蒗彝族自治县",
                        "value": 530724
                    }
                ],
                "text": "丽江市",
                "value": 530700
            },
            {
                "id": 530800,
                "name": "普洱市",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 530801,
                        "name": "市辖区",
                        "pid": 530800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 530801
                    },
                    {
                        "id": 530802,
                        "name": "思茅区",
                        "pid": 530800,
                        "level": 2,
                        "text": "思茅区",
                        "value": 530802
                    },
                    {
                        "id": 530821,
                        "name": "宁洱哈尼族彝族自治县",
                        "pid": 530800,
                        "level": 2,
                        "text": "宁洱哈尼族彝族自治县",
                        "value": 530821
                    },
                    {
                        "id": 530822,
                        "name": "墨江哈尼族自治县",
                        "pid": 530800,
                        "level": 2,
                        "text": "墨江哈尼族自治县",
                        "value": 530822
                    },
                    {
                        "id": 530823,
                        "name": "景东彝族自治县",
                        "pid": 530800,
                        "level": 2,
                        "text": "景东彝族自治县",
                        "value": 530823
                    },
                    {
                        "id": 530824,
                        "name": "景谷傣族彝族自治县",
                        "pid": 530800,
                        "level": 2,
                        "text": "景谷傣族彝族自治县",
                        "value": 530824
                    },
                    {
                        "id": 530825,
                        "name": "镇沅彝族哈尼族拉祜族自治县",
                        "pid": 530800,
                        "level": 2,
                        "text": "镇沅彝族哈尼族拉祜族自治县",
                        "value": 530825
                    },
                    {
                        "id": 530826,
                        "name": "江城哈尼族彝族自治县",
                        "pid": 530800,
                        "level": 2,
                        "text": "江城哈尼族彝族自治县",
                        "value": 530826
                    },
                    {
                        "id": 530827,
                        "name": "孟连傣族拉祜族佤族自治县",
                        "pid": 530800,
                        "level": 2,
                        "text": "孟连傣族拉祜族佤族自治县",
                        "value": 530827
                    },
                    {
                        "id": 530828,
                        "name": "澜沧拉祜族自治县",
                        "pid": 530800,
                        "level": 2,
                        "text": "澜沧拉祜族自治县",
                        "value": 530828
                    },
                    {
                        "id": 530829,
                        "name": "西盟佤族自治县",
                        "pid": 530800,
                        "level": 2,
                        "text": "西盟佤族自治县",
                        "value": 530829
                    }
                ],
                "text": "普洱市",
                "value": 530800
            },
            {
                "id": 530900,
                "name": "临沧市",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 530901,
                        "name": "市辖区",
                        "pid": 530900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 530901
                    },
                    {
                        "id": 530902,
                        "name": "临翔区",
                        "pid": 530900,
                        "level": 2,
                        "text": "临翔区",
                        "value": 530902
                    },
                    {
                        "id": 530921,
                        "name": "凤庆县",
                        "pid": 530900,
                        "level": 2,
                        "text": "凤庆县",
                        "value": 530921
                    },
                    {
                        "id": 530922,
                        "name": "云县",
                        "pid": 530900,
                        "level": 2,
                        "text": "云县",
                        "value": 530922
                    },
                    {
                        "id": 530923,
                        "name": "永德县",
                        "pid": 530900,
                        "level": 2,
                        "text": "永德县",
                        "value": 530923
                    },
                    {
                        "id": 530924,
                        "name": "镇康县",
                        "pid": 530900,
                        "level": 2,
                        "text": "镇康县",
                        "value": 530924
                    },
                    {
                        "id": 530925,
                        "name": "双江拉祜族佤族布朗族傣族自治县",
                        "pid": 530900,
                        "level": 2,
                        "text": "双江拉祜族佤族布朗族傣族自治县",
                        "value": 530925
                    },
                    {
                        "id": 530926,
                        "name": "耿马傣族佤族自治县",
                        "pid": 530900,
                        "level": 2,
                        "text": "耿马傣族佤族自治县",
                        "value": 530926
                    },
                    {
                        "id": 530927,
                        "name": "沧源佤族自治县",
                        "pid": 530900,
                        "level": 2,
                        "text": "沧源佤族自治县",
                        "value": 530927
                    }
                ],
                "text": "临沧市",
                "value": 530900
            },
            {
                "id": 532300,
                "name": "楚雄彝族自治州",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 532301,
                        "name": "楚雄市",
                        "pid": 532300,
                        "level": 2,
                        "text": "楚雄市",
                        "value": 532301
                    },
                    {
                        "id": 532322,
                        "name": "双柏县",
                        "pid": 532300,
                        "level": 2,
                        "text": "双柏县",
                        "value": 532322
                    },
                    {
                        "id": 532323,
                        "name": "牟定县",
                        "pid": 532300,
                        "level": 2,
                        "text": "牟定县",
                        "value": 532323
                    },
                    {
                        "id": 532324,
                        "name": "南华县",
                        "pid": 532300,
                        "level": 2,
                        "text": "南华县",
                        "value": 532324
                    },
                    {
                        "id": 532325,
                        "name": "姚安县",
                        "pid": 532300,
                        "level": 2,
                        "text": "姚安县",
                        "value": 532325
                    },
                    {
                        "id": 532326,
                        "name": "大姚县",
                        "pid": 532300,
                        "level": 2,
                        "text": "大姚县",
                        "value": 532326
                    },
                    {
                        "id": 532327,
                        "name": "永仁县",
                        "pid": 532300,
                        "level": 2,
                        "text": "永仁县",
                        "value": 532327
                    },
                    {
                        "id": 532328,
                        "name": "元谋县",
                        "pid": 532300,
                        "level": 2,
                        "text": "元谋县",
                        "value": 532328
                    },
                    {
                        "id": 532329,
                        "name": "武定县",
                        "pid": 532300,
                        "level": 2,
                        "text": "武定县",
                        "value": 532329
                    },
                    {
                        "id": 532331,
                        "name": "禄丰县",
                        "pid": 532300,
                        "level": 2,
                        "text": "禄丰县",
                        "value": 532331
                    }
                ],
                "text": "楚雄彝族自治州",
                "value": 532300
            },
            {
                "id": 532500,
                "name": "红河哈尼族彝族自治州",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 532501,
                        "name": "个旧市",
                        "pid": 532500,
                        "level": 2,
                        "text": "个旧市",
                        "value": 532501
                    },
                    {
                        "id": 532502,
                        "name": "开远市",
                        "pid": 532500,
                        "level": 2,
                        "text": "开远市",
                        "value": 532502
                    },
                    {
                        "id": 532503,
                        "name": "蒙自市",
                        "pid": 532500,
                        "level": 2,
                        "text": "蒙自市",
                        "value": 532503
                    },
                    {
                        "id": 532504,
                        "name": "弥勒市",
                        "pid": 532500,
                        "level": 2,
                        "text": "弥勒市",
                        "value": 532504
                    },
                    {
                        "id": 532523,
                        "name": "屏边苗族自治县",
                        "pid": 532500,
                        "level": 2,
                        "text": "屏边苗族自治县",
                        "value": 532523
                    },
                    {
                        "id": 532524,
                        "name": "建水县",
                        "pid": 532500,
                        "level": 2,
                        "text": "建水县",
                        "value": 532524
                    },
                    {
                        "id": 532525,
                        "name": "石屏县",
                        "pid": 532500,
                        "level": 2,
                        "text": "石屏县",
                        "value": 532525
                    },
                    {
                        "id": 532527,
                        "name": "泸西县",
                        "pid": 532500,
                        "level": 2,
                        "text": "泸西县",
                        "value": 532527
                    },
                    {
                        "id": 532528,
                        "name": "元阳县",
                        "pid": 532500,
                        "level": 2,
                        "text": "元阳县",
                        "value": 532528
                    },
                    {
                        "id": 532529,
                        "name": "红河县",
                        "pid": 532500,
                        "level": 2,
                        "text": "红河县",
                        "value": 532529
                    },
                    {
                        "id": 532530,
                        "name": "金平苗族瑶族傣族自治县",
                        "pid": 532500,
                        "level": 2,
                        "text": "金平苗族瑶族傣族自治县",
                        "value": 532530
                    },
                    {
                        "id": 532531,
                        "name": "绿春县",
                        "pid": 532500,
                        "level": 2,
                        "text": "绿春县",
                        "value": 532531
                    },
                    {
                        "id": 532532,
                        "name": "河口瑶族自治县",
                        "pid": 532500,
                        "level": 2,
                        "text": "河口瑶族自治县",
                        "value": 532532
                    }
                ],
                "text": "红河哈尼族彝族自治州",
                "value": 532500
            },
            {
                "id": 532600,
                "name": "文山壮族苗族自治州",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 532601,
                        "name": "文山市",
                        "pid": 532600,
                        "level": 2,
                        "text": "文山市",
                        "value": 532601
                    },
                    {
                        "id": 532622,
                        "name": "砚山县",
                        "pid": 532600,
                        "level": 2,
                        "text": "砚山县",
                        "value": 532622
                    },
                    {
                        "id": 532623,
                        "name": "西畴县",
                        "pid": 532600,
                        "level": 2,
                        "text": "西畴县",
                        "value": 532623
                    },
                    {
                        "id": 532624,
                        "name": "麻栗坡县",
                        "pid": 532600,
                        "level": 2,
                        "text": "麻栗坡县",
                        "value": 532624
                    },
                    {
                        "id": 532625,
                        "name": "马关县",
                        "pid": 532600,
                        "level": 2,
                        "text": "马关县",
                        "value": 532625
                    },
                    {
                        "id": 532626,
                        "name": "丘北县",
                        "pid": 532600,
                        "level": 2,
                        "text": "丘北县",
                        "value": 532626
                    },
                    {
                        "id": 532627,
                        "name": "广南县",
                        "pid": 532600,
                        "level": 2,
                        "text": "广南县",
                        "value": 532627
                    },
                    {
                        "id": 532628,
                        "name": "富宁县",
                        "pid": 532600,
                        "level": 2,
                        "text": "富宁县",
                        "value": 532628
                    }
                ],
                "text": "文山壮族苗族自治州",
                "value": 532600
            },
            {
                "id": 532800,
                "name": "西双版纳傣族自治州",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 532801,
                        "name": "景洪市",
                        "pid": 532800,
                        "level": 2,
                        "text": "景洪市",
                        "value": 532801
                    },
                    {
                        "id": 532822,
                        "name": "勐海县",
                        "pid": 532800,
                        "level": 2,
                        "text": "勐海县",
                        "value": 532822
                    },
                    {
                        "id": 532823,
                        "name": "勐腊县",
                        "pid": 532800,
                        "level": 2,
                        "text": "勐腊县",
                        "value": 532823
                    }
                ],
                "text": "西双版纳傣族自治州",
                "value": 532800
            },
            {
                "id": 532900,
                "name": "大理白族自治州",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 532901,
                        "name": "大理市",
                        "pid": 532900,
                        "level": 2,
                        "text": "大理市",
                        "value": 532901
                    },
                    {
                        "id": 532922,
                        "name": "漾濞彝族自治县",
                        "pid": 532900,
                        "level": 2,
                        "text": "漾濞彝族自治县",
                        "value": 532922
                    },
                    {
                        "id": 532923,
                        "name": "祥云县",
                        "pid": 532900,
                        "level": 2,
                        "text": "祥云县",
                        "value": 532923
                    },
                    {
                        "id": 532924,
                        "name": "宾川县",
                        "pid": 532900,
                        "level": 2,
                        "text": "宾川县",
                        "value": 532924
                    },
                    {
                        "id": 532925,
                        "name": "弥渡县",
                        "pid": 532900,
                        "level": 2,
                        "text": "弥渡县",
                        "value": 532925
                    },
                    {
                        "id": 532926,
                        "name": "南涧彝族自治县",
                        "pid": 532900,
                        "level": 2,
                        "text": "南涧彝族自治县",
                        "value": 532926
                    },
                    {
                        "id": 532927,
                        "name": "巍山彝族回族自治县",
                        "pid": 532900,
                        "level": 2,
                        "text": "巍山彝族回族自治县",
                        "value": 532927
                    },
                    {
                        "id": 532928,
                        "name": "永平县",
                        "pid": 532900,
                        "level": 2,
                        "text": "永平县",
                        "value": 532928
                    },
                    {
                        "id": 532929,
                        "name": "云龙县",
                        "pid": 532900,
                        "level": 2,
                        "text": "云龙县",
                        "value": 532929
                    },
                    {
                        "id": 532930,
                        "name": "洱源县",
                        "pid": 532900,
                        "level": 2,
                        "text": "洱源县",
                        "value": 532930
                    },
                    {
                        "id": 532931,
                        "name": "剑川县",
                        "pid": 532900,
                        "level": 2,
                        "text": "剑川县",
                        "value": 532931
                    },
                    {
                        "id": 532932,
                        "name": "鹤庆县",
                        "pid": 532900,
                        "level": 2,
                        "text": "鹤庆县",
                        "value": 532932
                    }
                ],
                "text": "大理白族自治州",
                "value": 532900
            },
            {
                "id": 533100,
                "name": "德宏傣族景颇族自治州",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 533102,
                        "name": "瑞丽市",
                        "pid": 533100,
                        "level": 2,
                        "text": "瑞丽市",
                        "value": 533102
                    },
                    {
                        "id": 533103,
                        "name": "芒市",
                        "pid": 533100,
                        "level": 2,
                        "text": "芒市",
                        "value": 533103
                    },
                    {
                        "id": 533122,
                        "name": "梁河县",
                        "pid": 533100,
                        "level": 2,
                        "text": "梁河县",
                        "value": 533122
                    },
                    {
                        "id": 533123,
                        "name": "盈江县",
                        "pid": 533100,
                        "level": 2,
                        "text": "盈江县",
                        "value": 533123
                    },
                    {
                        "id": 533124,
                        "name": "陇川县",
                        "pid": 533100,
                        "level": 2,
                        "text": "陇川县",
                        "value": 533124
                    }
                ],
                "text": "德宏傣族景颇族自治州",
                "value": 533100
            },
            {
                "id": 533300,
                "name": "怒江傈僳族自治州",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 533301,
                        "name": "泸水市",
                        "pid": 533300,
                        "level": 2,
                        "text": "泸水市",
                        "value": 533301
                    },
                    {
                        "id": 533323,
                        "name": "福贡县",
                        "pid": 533300,
                        "level": 2,
                        "text": "福贡县",
                        "value": 533323
                    },
                    {
                        "id": 533324,
                        "name": "贡山独龙族怒族自治县",
                        "pid": 533300,
                        "level": 2,
                        "text": "贡山独龙族怒族自治县",
                        "value": 533324
                    },
                    {
                        "id": 533325,
                        "name": "兰坪白族普米族自治县",
                        "pid": 533300,
                        "level": 2,
                        "text": "兰坪白族普米族自治县",
                        "value": 533325
                    }
                ],
                "text": "怒江傈僳族自治州",
                "value": 533300
            },
            {
                "id": 533400,
                "name": "迪庆藏族自治州",
                "pid": 530000,
                "level": 1,
                "children": [
                    {
                        "id": 533401,
                        "name": "香格里拉市",
                        "pid": 533400,
                        "level": 2,
                        "text": "香格里拉市",
                        "value": 533401
                    },
                    {
                        "id": 533422,
                        "name": "德钦县",
                        "pid": 533400,
                        "level": 2,
                        "text": "德钦县",
                        "value": 533422
                    },
                    {
                        "id": 533423,
                        "name": "维西傈僳族自治县",
                        "pid": 533400,
                        "level": 2,
                        "text": "维西傈僳族自治县",
                        "value": 533423
                    }
                ],
                "text": "迪庆藏族自治州",
                "value": 533400
            }
        ],
        "text": "云南省",
        "value": 530000
    },
    {
        "id": 540000,
        "name": "西藏自治区",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 540100,
                "name": "拉萨市",
                "pid": 540000,
                "level": 1,
                "children": [
                    {
                        "id": 540101,
                        "name": "市辖区",
                        "pid": 540100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 540101
                    },
                    {
                        "id": 540102,
                        "name": "城关区",
                        "pid": 540100,
                        "level": 2,
                        "text": "城关区",
                        "value": 540102
                    },
                    {
                        "id": 540103,
                        "name": "堆龙德庆区",
                        "pid": 540100,
                        "level": 2,
                        "text": "堆龙德庆区",
                        "value": 540103
                    },
                    {
                        "id": 540121,
                        "name": "林周县",
                        "pid": 540100,
                        "level": 2,
                        "text": "林周县",
                        "value": 540121
                    },
                    {
                        "id": 540122,
                        "name": "当雄县",
                        "pid": 540100,
                        "level": 2,
                        "text": "当雄县",
                        "value": 540122
                    },
                    {
                        "id": 540123,
                        "name": "尼木县",
                        "pid": 540100,
                        "level": 2,
                        "text": "尼木县",
                        "value": 540123
                    },
                    {
                        "id": 540124,
                        "name": "曲水县",
                        "pid": 540100,
                        "level": 2,
                        "text": "曲水县",
                        "value": 540124
                    },
                    {
                        "id": 540126,
                        "name": "达孜县",
                        "pid": 540100,
                        "level": 2,
                        "text": "达孜县",
                        "value": 540126
                    },
                    {
                        "id": 540127,
                        "name": "墨竹工卡县",
                        "pid": 540100,
                        "level": 2,
                        "text": "墨竹工卡县",
                        "value": 540127
                    }
                ],
                "text": "拉萨市",
                "value": 540100
            },
            {
                "id": 540200,
                "name": "日喀则市",
                "pid": 540000,
                "level": 1,
                "children": [
                    {
                        "id": 540202,
                        "name": "桑珠孜区",
                        "pid": 540200,
                        "level": 2,
                        "text": "桑珠孜区",
                        "value": 540202
                    },
                    {
                        "id": 540221,
                        "name": "南木林县",
                        "pid": 540200,
                        "level": 2,
                        "text": "南木林县",
                        "value": 540221
                    },
                    {
                        "id": 540222,
                        "name": "江孜县",
                        "pid": 540200,
                        "level": 2,
                        "text": "江孜县",
                        "value": 540222
                    },
                    {
                        "id": 540223,
                        "name": "定日县",
                        "pid": 540200,
                        "level": 2,
                        "text": "定日县",
                        "value": 540223
                    },
                    {
                        "id": 540224,
                        "name": "萨迦县",
                        "pid": 540200,
                        "level": 2,
                        "text": "萨迦县",
                        "value": 540224
                    },
                    {
                        "id": 540225,
                        "name": "拉孜县",
                        "pid": 540200,
                        "level": 2,
                        "text": "拉孜县",
                        "value": 540225
                    },
                    {
                        "id": 540226,
                        "name": "昂仁县",
                        "pid": 540200,
                        "level": 2,
                        "text": "昂仁县",
                        "value": 540226
                    },
                    {
                        "id": 540227,
                        "name": "谢通门县",
                        "pid": 540200,
                        "level": 2,
                        "text": "谢通门县",
                        "value": 540227
                    },
                    {
                        "id": 540228,
                        "name": "白朗县",
                        "pid": 540200,
                        "level": 2,
                        "text": "白朗县",
                        "value": 540228
                    },
                    {
                        "id": 540229,
                        "name": "仁布县",
                        "pid": 540200,
                        "level": 2,
                        "text": "仁布县",
                        "value": 540229
                    },
                    {
                        "id": 540230,
                        "name": "康马县",
                        "pid": 540200,
                        "level": 2,
                        "text": "康马县",
                        "value": 540230
                    },
                    {
                        "id": 540231,
                        "name": "定结县",
                        "pid": 540200,
                        "level": 2,
                        "text": "定结县",
                        "value": 540231
                    },
                    {
                        "id": 540232,
                        "name": "仲巴县",
                        "pid": 540200,
                        "level": 2,
                        "text": "仲巴县",
                        "value": 540232
                    },
                    {
                        "id": 540233,
                        "name": "亚东县",
                        "pid": 540200,
                        "level": 2,
                        "text": "亚东县",
                        "value": 540233
                    },
                    {
                        "id": 540234,
                        "name": "吉隆县",
                        "pid": 540200,
                        "level": 2,
                        "text": "吉隆县",
                        "value": 540234
                    },
                    {
                        "id": 540235,
                        "name": "聂拉木县",
                        "pid": 540200,
                        "level": 2,
                        "text": "聂拉木县",
                        "value": 540235
                    },
                    {
                        "id": 540236,
                        "name": "萨嘎县",
                        "pid": 540200,
                        "level": 2,
                        "text": "萨嘎县",
                        "value": 540236
                    },
                    {
                        "id": 540237,
                        "name": "岗巴县",
                        "pid": 540200,
                        "level": 2,
                        "text": "岗巴县",
                        "value": 540237
                    }
                ],
                "text": "日喀则市",
                "value": 540200
            },
            {
                "id": 540300,
                "name": "昌都市",
                "pid": 540000,
                "level": 1,
                "children": [
                    {
                        "id": 540302,
                        "name": "卡若区",
                        "pid": 540300,
                        "level": 2,
                        "text": "卡若区",
                        "value": 540302
                    },
                    {
                        "id": 540321,
                        "name": "江达县",
                        "pid": 540300,
                        "level": 2,
                        "text": "江达县",
                        "value": 540321
                    },
                    {
                        "id": 540322,
                        "name": "贡觉县",
                        "pid": 540300,
                        "level": 2,
                        "text": "贡觉县",
                        "value": 540322
                    },
                    {
                        "id": 540323,
                        "name": "类乌齐县",
                        "pid": 540300,
                        "level": 2,
                        "text": "类乌齐县",
                        "value": 540323
                    },
                    {
                        "id": 540324,
                        "name": "丁青县",
                        "pid": 540300,
                        "level": 2,
                        "text": "丁青县",
                        "value": 540324
                    },
                    {
                        "id": 540325,
                        "name": "察雅县",
                        "pid": 540300,
                        "level": 2,
                        "text": "察雅县",
                        "value": 540325
                    },
                    {
                        "id": 540326,
                        "name": "八宿县",
                        "pid": 540300,
                        "level": 2,
                        "text": "八宿县",
                        "value": 540326
                    },
                    {
                        "id": 540327,
                        "name": "左贡县",
                        "pid": 540300,
                        "level": 2,
                        "text": "左贡县",
                        "value": 540327
                    },
                    {
                        "id": 540328,
                        "name": "芒康县",
                        "pid": 540300,
                        "level": 2,
                        "text": "芒康县",
                        "value": 540328
                    },
                    {
                        "id": 540329,
                        "name": "洛隆县",
                        "pid": 540300,
                        "level": 2,
                        "text": "洛隆县",
                        "value": 540329
                    },
                    {
                        "id": 540330,
                        "name": "边坝县",
                        "pid": 540300,
                        "level": 2,
                        "text": "边坝县",
                        "value": 540330
                    }
                ],
                "text": "昌都市",
                "value": 540300
            },
            {
                "id": 540400,
                "name": "林芝市",
                "pid": 540000,
                "level": 1,
                "children": [
                    {
                        "id": 540402,
                        "name": "巴宜区",
                        "pid": 540400,
                        "level": 2,
                        "text": "巴宜区",
                        "value": 540402
                    },
                    {
                        "id": 540421,
                        "name": "工布江达县",
                        "pid": 540400,
                        "level": 2,
                        "text": "工布江达县",
                        "value": 540421
                    },
                    {
                        "id": 540422,
                        "name": "米林县",
                        "pid": 540400,
                        "level": 2,
                        "text": "米林县",
                        "value": 540422
                    },
                    {
                        "id": 540423,
                        "name": "墨脱县",
                        "pid": 540400,
                        "level": 2,
                        "text": "墨脱县",
                        "value": 540423
                    },
                    {
                        "id": 540424,
                        "name": "波密县",
                        "pid": 540400,
                        "level": 2,
                        "text": "波密县",
                        "value": 540424
                    },
                    {
                        "id": 540425,
                        "name": "察隅县",
                        "pid": 540400,
                        "level": 2,
                        "text": "察隅县",
                        "value": 540425
                    },
                    {
                        "id": 540426,
                        "name": "朗县",
                        "pid": 540400,
                        "level": 2,
                        "text": "朗县",
                        "value": 540426
                    }
                ],
                "text": "林芝市",
                "value": 540400
            },
            {
                "id": 540500,
                "name": "山南市",
                "pid": 540000,
                "level": 1,
                "children": [
                    {
                        "id": 540501,
                        "name": "市辖区",
                        "pid": 540500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 540501
                    },
                    {
                        "id": 540502,
                        "name": "乃东区",
                        "pid": 540500,
                        "level": 2,
                        "text": "乃东区",
                        "value": 540502
                    },
                    {
                        "id": 540521,
                        "name": "扎囊县",
                        "pid": 540500,
                        "level": 2,
                        "text": "扎囊县",
                        "value": 540521
                    },
                    {
                        "id": 540522,
                        "name": "贡嘎县",
                        "pid": 540500,
                        "level": 2,
                        "text": "贡嘎县",
                        "value": 540522
                    },
                    {
                        "id": 540523,
                        "name": "桑日县",
                        "pid": 540500,
                        "level": 2,
                        "text": "桑日县",
                        "value": 540523
                    },
                    {
                        "id": 540524,
                        "name": "琼结县",
                        "pid": 540500,
                        "level": 2,
                        "text": "琼结县",
                        "value": 540524
                    },
                    {
                        "id": 540525,
                        "name": "曲松县",
                        "pid": 540500,
                        "level": 2,
                        "text": "曲松县",
                        "value": 540525
                    },
                    {
                        "id": 540526,
                        "name": "措美县",
                        "pid": 540500,
                        "level": 2,
                        "text": "措美县",
                        "value": 540526
                    },
                    {
                        "id": 540527,
                        "name": "洛扎县",
                        "pid": 540500,
                        "level": 2,
                        "text": "洛扎县",
                        "value": 540527
                    },
                    {
                        "id": 540528,
                        "name": "加查县",
                        "pid": 540500,
                        "level": 2,
                        "text": "加查县",
                        "value": 540528
                    },
                    {
                        "id": 540529,
                        "name": "隆子县",
                        "pid": 540500,
                        "level": 2,
                        "text": "隆子县",
                        "value": 540529
                    },
                    {
                        "id": 540530,
                        "name": "错那县",
                        "pid": 540500,
                        "level": 2,
                        "text": "错那县",
                        "value": 540530
                    },
                    {
                        "id": 540531,
                        "name": "浪卡子县",
                        "pid": 540500,
                        "level": 2,
                        "text": "浪卡子县",
                        "value": 540531
                    }
                ],
                "text": "山南市",
                "value": 540500
            },
            {
                "id": 542400,
                "name": "那曲地区",
                "pid": 540000,
                "level": 1,
                "children": [
                    {
                        "id": 542421,
                        "name": "那曲县",
                        "pid": 542400,
                        "level": 2,
                        "text": "那曲县",
                        "value": 542421
                    },
                    {
                        "id": 542422,
                        "name": "嘉黎县",
                        "pid": 542400,
                        "level": 2,
                        "text": "嘉黎县",
                        "value": 542422
                    },
                    {
                        "id": 542423,
                        "name": "比如县",
                        "pid": 542400,
                        "level": 2,
                        "text": "比如县",
                        "value": 542423
                    },
                    {
                        "id": 542424,
                        "name": "聂荣县",
                        "pid": 542400,
                        "level": 2,
                        "text": "聂荣县",
                        "value": 542424
                    },
                    {
                        "id": 542425,
                        "name": "安多县",
                        "pid": 542400,
                        "level": 2,
                        "text": "安多县",
                        "value": 542425
                    },
                    {
                        "id": 542426,
                        "name": "申扎县",
                        "pid": 542400,
                        "level": 2,
                        "text": "申扎县",
                        "value": 542426
                    },
                    {
                        "id": 542427,
                        "name": "索县",
                        "pid": 542400,
                        "level": 2,
                        "text": "索县",
                        "value": 542427
                    },
                    {
                        "id": 542428,
                        "name": "班戈县",
                        "pid": 542400,
                        "level": 2,
                        "text": "班戈县",
                        "value": 542428
                    },
                    {
                        "id": 542429,
                        "name": "巴青县",
                        "pid": 542400,
                        "level": 2,
                        "text": "巴青县",
                        "value": 542429
                    },
                    {
                        "id": 542430,
                        "name": "尼玛县",
                        "pid": 542400,
                        "level": 2,
                        "text": "尼玛县",
                        "value": 542430
                    },
                    {
                        "id": 542431,
                        "name": "双湖县",
                        "pid": 542400,
                        "level": 2,
                        "text": "双湖县",
                        "value": 542431
                    }
                ],
                "text": "那曲地区",
                "value": 542400
            },
            {
                "id": 542500,
                "name": "阿里地区",
                "pid": 540000,
                "level": 1,
                "children": [
                    {
                        "id": 542521,
                        "name": "普兰县",
                        "pid": 542500,
                        "level": 2,
                        "text": "普兰县",
                        "value": 542521
                    },
                    {
                        "id": 542522,
                        "name": "札达县",
                        "pid": 542500,
                        "level": 2,
                        "text": "札达县",
                        "value": 542522
                    },
                    {
                        "id": 542523,
                        "name": "噶尔县",
                        "pid": 542500,
                        "level": 2,
                        "text": "噶尔县",
                        "value": 542523
                    },
                    {
                        "id": 542524,
                        "name": "日土县",
                        "pid": 542500,
                        "level": 2,
                        "text": "日土县",
                        "value": 542524
                    },
                    {
                        "id": 542525,
                        "name": "革吉县",
                        "pid": 542500,
                        "level": 2,
                        "text": "革吉县",
                        "value": 542525
                    },
                    {
                        "id": 542526,
                        "name": "改则县",
                        "pid": 542500,
                        "level": 2,
                        "text": "改则县",
                        "value": 542526
                    },
                    {
                        "id": 542527,
                        "name": "措勤县",
                        "pid": 542500,
                        "level": 2,
                        "text": "措勤县",
                        "value": 542527
                    }
                ],
                "text": "阿里地区",
                "value": 542500
            }
        ],
        "text": "西藏自治区",
        "value": 540000
    },
    {
        "id": 610000,
        "name": "陕西省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 610100,
                "name": "西安市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 610101,
                        "name": "市辖区",
                        "pid": 610100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 610101
                    },
                    {
                        "id": 610102,
                        "name": "新城区",
                        "pid": 610100,
                        "level": 2,
                        "text": "新城区",
                        "value": 610102
                    },
                    {
                        "id": 610103,
                        "name": "碑林区",
                        "pid": 610100,
                        "level": 2,
                        "text": "碑林区",
                        "value": 610103
                    },
                    {
                        "id": 610104,
                        "name": "莲湖区",
                        "pid": 610100,
                        "level": 2,
                        "text": "莲湖区",
                        "value": 610104
                    },
                    {
                        "id": 610111,
                        "name": "灞桥区",
                        "pid": 610100,
                        "level": 2,
                        "text": "灞桥区",
                        "value": 610111
                    },
                    {
                        "id": 610112,
                        "name": "未央区",
                        "pid": 610100,
                        "level": 2,
                        "text": "未央区",
                        "value": 610112
                    },
                    {
                        "id": 610113,
                        "name": "雁塔区",
                        "pid": 610100,
                        "level": 2,
                        "text": "雁塔区",
                        "value": 610113
                    },
                    {
                        "id": 610114,
                        "name": "阎良区",
                        "pid": 610100,
                        "level": 2,
                        "text": "阎良区",
                        "value": 610114
                    },
                    {
                        "id": 610115,
                        "name": "临潼区",
                        "pid": 610100,
                        "level": 2,
                        "text": "临潼区",
                        "value": 610115
                    },
                    {
                        "id": 610116,
                        "name": "长安区",
                        "pid": 610100,
                        "level": 2,
                        "text": "长安区",
                        "value": 610116
                    },
                    {
                        "id": 610117,
                        "name": "高陵区",
                        "pid": 610100,
                        "level": 2,
                        "text": "高陵区",
                        "value": 610117
                    },
                    {
                        "id": 610122,
                        "name": "蓝田县",
                        "pid": 610100,
                        "level": 2,
                        "text": "蓝田县",
                        "value": 610122
                    },
                    {
                        "id": 610124,
                        "name": "周至县",
                        "pid": 610100,
                        "level": 2,
                        "text": "周至县",
                        "value": 610124
                    },
                    {
                        "id": 610125,
                        "name": "户县",
                        "pid": 610100,
                        "level": 2,
                        "text": "户县",
                        "value": 610125
                    }
                ],
                "text": "西安市",
                "value": 610100
            },
            {
                "id": 610200,
                "name": "铜川市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 610201,
                        "name": "市辖区",
                        "pid": 610200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 610201
                    },
                    {
                        "id": 610202,
                        "name": "王益区",
                        "pid": 610200,
                        "level": 2,
                        "text": "王益区",
                        "value": 610202
                    },
                    {
                        "id": 610203,
                        "name": "印台区",
                        "pid": 610200,
                        "level": 2,
                        "text": "印台区",
                        "value": 610203
                    },
                    {
                        "id": 610204,
                        "name": "耀州区",
                        "pid": 610200,
                        "level": 2,
                        "text": "耀州区",
                        "value": 610204
                    },
                    {
                        "id": 610222,
                        "name": "宜君县",
                        "pid": 610200,
                        "level": 2,
                        "text": "宜君县",
                        "value": 610222
                    }
                ],
                "text": "铜川市",
                "value": 610200
            },
            {
                "id": 610300,
                "name": "宝鸡市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 610301,
                        "name": "市辖区",
                        "pid": 610300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 610301
                    },
                    {
                        "id": 610302,
                        "name": "渭滨区",
                        "pid": 610300,
                        "level": 2,
                        "text": "渭滨区",
                        "value": 610302
                    },
                    {
                        "id": 610303,
                        "name": "金台区",
                        "pid": 610300,
                        "level": 2,
                        "text": "金台区",
                        "value": 610303
                    },
                    {
                        "id": 610304,
                        "name": "陈仓区",
                        "pid": 610300,
                        "level": 2,
                        "text": "陈仓区",
                        "value": 610304
                    },
                    {
                        "id": 610322,
                        "name": "凤翔县",
                        "pid": 610300,
                        "level": 2,
                        "text": "凤翔县",
                        "value": 610322
                    },
                    {
                        "id": 610323,
                        "name": "岐山县",
                        "pid": 610300,
                        "level": 2,
                        "text": "岐山县",
                        "value": 610323
                    },
                    {
                        "id": 610324,
                        "name": "扶风县",
                        "pid": 610300,
                        "level": 2,
                        "text": "扶风县",
                        "value": 610324
                    },
                    {
                        "id": 610326,
                        "name": "眉县",
                        "pid": 610300,
                        "level": 2,
                        "text": "眉县",
                        "value": 610326
                    },
                    {
                        "id": 610327,
                        "name": "陇县",
                        "pid": 610300,
                        "level": 2,
                        "text": "陇县",
                        "value": 610327
                    },
                    {
                        "id": 610328,
                        "name": "千阳县",
                        "pid": 610300,
                        "level": 2,
                        "text": "千阳县",
                        "value": 610328
                    },
                    {
                        "id": 610329,
                        "name": "麟游县",
                        "pid": 610300,
                        "level": 2,
                        "text": "麟游县",
                        "value": 610329
                    },
                    {
                        "id": 610330,
                        "name": "凤县",
                        "pid": 610300,
                        "level": 2,
                        "text": "凤县",
                        "value": 610330
                    },
                    {
                        "id": 610331,
                        "name": "太白县",
                        "pid": 610300,
                        "level": 2,
                        "text": "太白县",
                        "value": 610331
                    }
                ],
                "text": "宝鸡市",
                "value": 610300
            },
            {
                "id": 610400,
                "name": "咸阳市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 610401,
                        "name": "市辖区",
                        "pid": 610400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 610401
                    },
                    {
                        "id": 610402,
                        "name": "秦都区",
                        "pid": 610400,
                        "level": 2,
                        "text": "秦都区",
                        "value": 610402
                    },
                    {
                        "id": 610403,
                        "name": "杨陵区",
                        "pid": 610400,
                        "level": 2,
                        "text": "杨陵区",
                        "value": 610403
                    },
                    {
                        "id": 610404,
                        "name": "渭城区",
                        "pid": 610400,
                        "level": 2,
                        "text": "渭城区",
                        "value": 610404
                    },
                    {
                        "id": 610422,
                        "name": "三原县",
                        "pid": 610400,
                        "level": 2,
                        "text": "三原县",
                        "value": 610422
                    },
                    {
                        "id": 610423,
                        "name": "泾阳县",
                        "pid": 610400,
                        "level": 2,
                        "text": "泾阳县",
                        "value": 610423
                    },
                    {
                        "id": 610424,
                        "name": "乾县",
                        "pid": 610400,
                        "level": 2,
                        "text": "乾县",
                        "value": 610424
                    },
                    {
                        "id": 610425,
                        "name": "礼泉县",
                        "pid": 610400,
                        "level": 2,
                        "text": "礼泉县",
                        "value": 610425
                    },
                    {
                        "id": 610426,
                        "name": "永寿县",
                        "pid": 610400,
                        "level": 2,
                        "text": "永寿县",
                        "value": 610426
                    },
                    {
                        "id": 610427,
                        "name": "彬县",
                        "pid": 610400,
                        "level": 2,
                        "text": "彬县",
                        "value": 610427
                    },
                    {
                        "id": 610428,
                        "name": "长武县",
                        "pid": 610400,
                        "level": 2,
                        "text": "长武县",
                        "value": 610428
                    },
                    {
                        "id": 610429,
                        "name": "旬邑县",
                        "pid": 610400,
                        "level": 2,
                        "text": "旬邑县",
                        "value": 610429
                    },
                    {
                        "id": 610430,
                        "name": "淳化县",
                        "pid": 610400,
                        "level": 2,
                        "text": "淳化县",
                        "value": 610430
                    },
                    {
                        "id": 610431,
                        "name": "武功县",
                        "pid": 610400,
                        "level": 2,
                        "text": "武功县",
                        "value": 610431
                    },
                    {
                        "id": 610481,
                        "name": "兴平市",
                        "pid": 610400,
                        "level": 2,
                        "text": "兴平市",
                        "value": 610481
                    }
                ],
                "text": "咸阳市",
                "value": 610400
            },
            {
                "id": 610500,
                "name": "渭南市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 610501,
                        "name": "市辖区",
                        "pid": 610500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 610501
                    },
                    {
                        "id": 610502,
                        "name": "临渭区",
                        "pid": 610500,
                        "level": 2,
                        "text": "临渭区",
                        "value": 610502
                    },
                    {
                        "id": 610503,
                        "name": "华州区",
                        "pid": 610500,
                        "level": 2,
                        "text": "华州区",
                        "value": 610503
                    },
                    {
                        "id": 610522,
                        "name": "潼关县",
                        "pid": 610500,
                        "level": 2,
                        "text": "潼关县",
                        "value": 610522
                    },
                    {
                        "id": 610523,
                        "name": "大荔县",
                        "pid": 610500,
                        "level": 2,
                        "text": "大荔县",
                        "value": 610523
                    },
                    {
                        "id": 610524,
                        "name": "合阳县",
                        "pid": 610500,
                        "level": 2,
                        "text": "合阳县",
                        "value": 610524
                    },
                    {
                        "id": 610525,
                        "name": "澄城县",
                        "pid": 610500,
                        "level": 2,
                        "text": "澄城县",
                        "value": 610525
                    },
                    {
                        "id": 610526,
                        "name": "蒲城县",
                        "pid": 610500,
                        "level": 2,
                        "text": "蒲城县",
                        "value": 610526
                    },
                    {
                        "id": 610527,
                        "name": "白水县",
                        "pid": 610500,
                        "level": 2,
                        "text": "白水县",
                        "value": 610527
                    },
                    {
                        "id": 610528,
                        "name": "富平县",
                        "pid": 610500,
                        "level": 2,
                        "text": "富平县",
                        "value": 610528
                    },
                    {
                        "id": 610581,
                        "name": "韩城市",
                        "pid": 610500,
                        "level": 2,
                        "text": "韩城市",
                        "value": 610581
                    },
                    {
                        "id": 610582,
                        "name": "华阴市",
                        "pid": 610500,
                        "level": 2,
                        "text": "华阴市",
                        "value": 610582
                    }
                ],
                "text": "渭南市",
                "value": 610500
            },
            {
                "id": 610600,
                "name": "延安市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 610601,
                        "name": "市辖区",
                        "pid": 610600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 610601
                    },
                    {
                        "id": 610602,
                        "name": "宝塔区",
                        "pid": 610600,
                        "level": 2,
                        "text": "宝塔区",
                        "value": 610602
                    },
                    {
                        "id": 610603,
                        "name": "安塞区",
                        "pid": 610600,
                        "level": 2,
                        "text": "安塞区",
                        "value": 610603
                    },
                    {
                        "id": 610621,
                        "name": "延长县",
                        "pid": 610600,
                        "level": 2,
                        "text": "延长县",
                        "value": 610621
                    },
                    {
                        "id": 610622,
                        "name": "延川县",
                        "pid": 610600,
                        "level": 2,
                        "text": "延川县",
                        "value": 610622
                    },
                    {
                        "id": 610623,
                        "name": "子长县",
                        "pid": 610600,
                        "level": 2,
                        "text": "子长县",
                        "value": 610623
                    },
                    {
                        "id": 610625,
                        "name": "志丹县",
                        "pid": 610600,
                        "level": 2,
                        "text": "志丹县",
                        "value": 610625
                    },
                    {
                        "id": 610626,
                        "name": "吴起县",
                        "pid": 610600,
                        "level": 2,
                        "text": "吴起县",
                        "value": 610626
                    },
                    {
                        "id": 610627,
                        "name": "甘泉县",
                        "pid": 610600,
                        "level": 2,
                        "text": "甘泉县",
                        "value": 610627
                    },
                    {
                        "id": 610628,
                        "name": "富县",
                        "pid": 610600,
                        "level": 2,
                        "text": "富县",
                        "value": 610628
                    },
                    {
                        "id": 610629,
                        "name": "洛川县",
                        "pid": 610600,
                        "level": 2,
                        "text": "洛川县",
                        "value": 610629
                    },
                    {
                        "id": 610630,
                        "name": "宜川县",
                        "pid": 610600,
                        "level": 2,
                        "text": "宜川县",
                        "value": 610630
                    },
                    {
                        "id": 610631,
                        "name": "黄龙县",
                        "pid": 610600,
                        "level": 2,
                        "text": "黄龙县",
                        "value": 610631
                    },
                    {
                        "id": 610632,
                        "name": "黄陵县",
                        "pid": 610600,
                        "level": 2,
                        "text": "黄陵县",
                        "value": 610632
                    }
                ],
                "text": "延安市",
                "value": 610600
            },
            {
                "id": 610700,
                "name": "汉中市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 610701,
                        "name": "市辖区",
                        "pid": 610700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 610701
                    },
                    {
                        "id": 610702,
                        "name": "汉台区",
                        "pid": 610700,
                        "level": 2,
                        "text": "汉台区",
                        "value": 610702
                    },
                    {
                        "id": 610721,
                        "name": "南郑县",
                        "pid": 610700,
                        "level": 2,
                        "text": "南郑县",
                        "value": 610721
                    },
                    {
                        "id": 610722,
                        "name": "城固县",
                        "pid": 610700,
                        "level": 2,
                        "text": "城固县",
                        "value": 610722
                    },
                    {
                        "id": 610723,
                        "name": "洋县",
                        "pid": 610700,
                        "level": 2,
                        "text": "洋县",
                        "value": 610723
                    },
                    {
                        "id": 610724,
                        "name": "西乡县",
                        "pid": 610700,
                        "level": 2,
                        "text": "西乡县",
                        "value": 610724
                    },
                    {
                        "id": 610725,
                        "name": "勉县",
                        "pid": 610700,
                        "level": 2,
                        "text": "勉县",
                        "value": 610725
                    },
                    {
                        "id": 610726,
                        "name": "宁强县",
                        "pid": 610700,
                        "level": 2,
                        "text": "宁强县",
                        "value": 610726
                    },
                    {
                        "id": 610727,
                        "name": "略阳县",
                        "pid": 610700,
                        "level": 2,
                        "text": "略阳县",
                        "value": 610727
                    },
                    {
                        "id": 610728,
                        "name": "镇巴县",
                        "pid": 610700,
                        "level": 2,
                        "text": "镇巴县",
                        "value": 610728
                    },
                    {
                        "id": 610729,
                        "name": "留坝县",
                        "pid": 610700,
                        "level": 2,
                        "text": "留坝县",
                        "value": 610729
                    },
                    {
                        "id": 610730,
                        "name": "佛坪县",
                        "pid": 610700,
                        "level": 2,
                        "text": "佛坪县",
                        "value": 610730
                    }
                ],
                "text": "汉中市",
                "value": 610700
            },
            {
                "id": 610800,
                "name": "榆林市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 610801,
                        "name": "市辖区",
                        "pid": 610800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 610801
                    },
                    {
                        "id": 610802,
                        "name": "榆阳区",
                        "pid": 610800,
                        "level": 2,
                        "text": "榆阳区",
                        "value": 610802
                    },
                    {
                        "id": 610803,
                        "name": "横山区",
                        "pid": 610800,
                        "level": 2,
                        "text": "横山区",
                        "value": 610803
                    },
                    {
                        "id": 610821,
                        "name": "神木县",
                        "pid": 610800,
                        "level": 2,
                        "text": "神木县",
                        "value": 610821
                    },
                    {
                        "id": 610822,
                        "name": "府谷县",
                        "pid": 610800,
                        "level": 2,
                        "text": "府谷县",
                        "value": 610822
                    },
                    {
                        "id": 610824,
                        "name": "靖边县",
                        "pid": 610800,
                        "level": 2,
                        "text": "靖边县",
                        "value": 610824
                    },
                    {
                        "id": 610825,
                        "name": "定边县",
                        "pid": 610800,
                        "level": 2,
                        "text": "定边县",
                        "value": 610825
                    },
                    {
                        "id": 610826,
                        "name": "绥德县",
                        "pid": 610800,
                        "level": 2,
                        "text": "绥德县",
                        "value": 610826
                    },
                    {
                        "id": 610827,
                        "name": "米脂县",
                        "pid": 610800,
                        "level": 2,
                        "text": "米脂县",
                        "value": 610827
                    },
                    {
                        "id": 610828,
                        "name": "佳县",
                        "pid": 610800,
                        "level": 2,
                        "text": "佳县",
                        "value": 610828
                    },
                    {
                        "id": 610829,
                        "name": "吴堡县",
                        "pid": 610800,
                        "level": 2,
                        "text": "吴堡县",
                        "value": 610829
                    },
                    {
                        "id": 610830,
                        "name": "清涧县",
                        "pid": 610800,
                        "level": 2,
                        "text": "清涧县",
                        "value": 610830
                    },
                    {
                        "id": 610831,
                        "name": "子洲县",
                        "pid": 610800,
                        "level": 2,
                        "text": "子洲县",
                        "value": 610831
                    }
                ],
                "text": "榆林市",
                "value": 610800
            },
            {
                "id": 610900,
                "name": "安康市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 610901,
                        "name": "市辖区",
                        "pid": 610900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 610901
                    },
                    {
                        "id": 610902,
                        "name": "汉滨区",
                        "pid": 610900,
                        "level": 2,
                        "text": "汉滨区",
                        "value": 610902
                    },
                    {
                        "id": 610921,
                        "name": "汉阴县",
                        "pid": 610900,
                        "level": 2,
                        "text": "汉阴县",
                        "value": 610921
                    },
                    {
                        "id": 610922,
                        "name": "石泉县",
                        "pid": 610900,
                        "level": 2,
                        "text": "石泉县",
                        "value": 610922
                    },
                    {
                        "id": 610923,
                        "name": "宁陕县",
                        "pid": 610900,
                        "level": 2,
                        "text": "宁陕县",
                        "value": 610923
                    },
                    {
                        "id": 610924,
                        "name": "紫阳县",
                        "pid": 610900,
                        "level": 2,
                        "text": "紫阳县",
                        "value": 610924
                    },
                    {
                        "id": 610925,
                        "name": "岚皋县",
                        "pid": 610900,
                        "level": 2,
                        "text": "岚皋县",
                        "value": 610925
                    },
                    {
                        "id": 610926,
                        "name": "平利县",
                        "pid": 610900,
                        "level": 2,
                        "text": "平利县",
                        "value": 610926
                    },
                    {
                        "id": 610927,
                        "name": "镇坪县",
                        "pid": 610900,
                        "level": 2,
                        "text": "镇坪县",
                        "value": 610927
                    },
                    {
                        "id": 610928,
                        "name": "旬阳县",
                        "pid": 610900,
                        "level": 2,
                        "text": "旬阳县",
                        "value": 610928
                    },
                    {
                        "id": 610929,
                        "name": "白河县",
                        "pid": 610900,
                        "level": 2,
                        "text": "白河县",
                        "value": 610929
                    }
                ],
                "text": "安康市",
                "value": 610900
            },
            {
                "id": 611000,
                "name": "商洛市",
                "pid": 610000,
                "level": 1,
                "children": [
                    {
                        "id": 611001,
                        "name": "市辖区",
                        "pid": 611000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 611001
                    },
                    {
                        "id": 611002,
                        "name": "商州区",
                        "pid": 611000,
                        "level": 2,
                        "text": "商州区",
                        "value": 611002
                    },
                    {
                        "id": 611021,
                        "name": "洛南县",
                        "pid": 611000,
                        "level": 2,
                        "text": "洛南县",
                        "value": 611021
                    },
                    {
                        "id": 611022,
                        "name": "丹凤县",
                        "pid": 611000,
                        "level": 2,
                        "text": "丹凤县",
                        "value": 611022
                    },
                    {
                        "id": 611023,
                        "name": "商南县",
                        "pid": 611000,
                        "level": 2,
                        "text": "商南县",
                        "value": 611023
                    },
                    {
                        "id": 611024,
                        "name": "山阳县",
                        "pid": 611000,
                        "level": 2,
                        "text": "山阳县",
                        "value": 611024
                    },
                    {
                        "id": 611025,
                        "name": "镇安县",
                        "pid": 611000,
                        "level": 2,
                        "text": "镇安县",
                        "value": 611025
                    },
                    {
                        "id": 611026,
                        "name": "柞水县",
                        "pid": 611000,
                        "level": 2,
                        "text": "柞水县",
                        "value": 611026
                    }
                ],
                "text": "商洛市",
                "value": 611000
            }
        ],
        "text": "陕西省",
        "value": 610000
    },
    {
        "id": 620000,
        "name": "甘肃省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 620100,
                "name": "兰州市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 620101,
                        "name": "市辖区",
                        "pid": 620100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 620101
                    },
                    {
                        "id": 620102,
                        "name": "城关区",
                        "pid": 620100,
                        "level": 2,
                        "text": "城关区",
                        "value": 620102
                    },
                    {
                        "id": 620103,
                        "name": "七里河区",
                        "pid": 620100,
                        "level": 2,
                        "text": "七里河区",
                        "value": 620103
                    },
                    {
                        "id": 620104,
                        "name": "西固区",
                        "pid": 620100,
                        "level": 2,
                        "text": "西固区",
                        "value": 620104
                    },
                    {
                        "id": 620105,
                        "name": "安宁区",
                        "pid": 620100,
                        "level": 2,
                        "text": "安宁区",
                        "value": 620105
                    },
                    {
                        "id": 620111,
                        "name": "红古区",
                        "pid": 620100,
                        "level": 2,
                        "text": "红古区",
                        "value": 620111
                    },
                    {
                        "id": 620121,
                        "name": "永登县",
                        "pid": 620100,
                        "level": 2,
                        "text": "永登县",
                        "value": 620121
                    },
                    {
                        "id": 620122,
                        "name": "皋兰县",
                        "pid": 620100,
                        "level": 2,
                        "text": "皋兰县",
                        "value": 620122
                    },
                    {
                        "id": 620123,
                        "name": "榆中县",
                        "pid": 620100,
                        "level": 2,
                        "text": "榆中县",
                        "value": 620123
                    }
                ],
                "text": "兰州市",
                "value": 620100
            },
            {
                "id": 620200,
                "name": "嘉峪关市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 620201,
                        "name": "市辖区",
                        "pid": 620200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 620201
                    }
                ],
                "text": "嘉峪关市",
                "value": 620200
            },
            {
                "id": 620300,
                "name": "金昌市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 620301,
                        "name": "市辖区",
                        "pid": 620300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 620301
                    },
                    {
                        "id": 620302,
                        "name": "金川区",
                        "pid": 620300,
                        "level": 2,
                        "text": "金川区",
                        "value": 620302
                    },
                    {
                        "id": 620321,
                        "name": "永昌县",
                        "pid": 620300,
                        "level": 2,
                        "text": "永昌县",
                        "value": 620321
                    }
                ],
                "text": "金昌市",
                "value": 620300
            },
            {
                "id": 620400,
                "name": "白银市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 620401,
                        "name": "市辖区",
                        "pid": 620400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 620401
                    },
                    {
                        "id": 620402,
                        "name": "白银区",
                        "pid": 620400,
                        "level": 2,
                        "text": "白银区",
                        "value": 620402
                    },
                    {
                        "id": 620403,
                        "name": "平川区",
                        "pid": 620400,
                        "level": 2,
                        "text": "平川区",
                        "value": 620403
                    },
                    {
                        "id": 620421,
                        "name": "靖远县",
                        "pid": 620400,
                        "level": 2,
                        "text": "靖远县",
                        "value": 620421
                    },
                    {
                        "id": 620422,
                        "name": "会宁县",
                        "pid": 620400,
                        "level": 2,
                        "text": "会宁县",
                        "value": 620422
                    },
                    {
                        "id": 620423,
                        "name": "景泰县",
                        "pid": 620400,
                        "level": 2,
                        "text": "景泰县",
                        "value": 620423
                    }
                ],
                "text": "白银市",
                "value": 620400
            },
            {
                "id": 620500,
                "name": "天水市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 620501,
                        "name": "市辖区",
                        "pid": 620500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 620501
                    },
                    {
                        "id": 620502,
                        "name": "秦州区",
                        "pid": 620500,
                        "level": 2,
                        "text": "秦州区",
                        "value": 620502
                    },
                    {
                        "id": 620503,
                        "name": "麦积区",
                        "pid": 620500,
                        "level": 2,
                        "text": "麦积区",
                        "value": 620503
                    },
                    {
                        "id": 620521,
                        "name": "清水县",
                        "pid": 620500,
                        "level": 2,
                        "text": "清水县",
                        "value": 620521
                    },
                    {
                        "id": 620522,
                        "name": "秦安县",
                        "pid": 620500,
                        "level": 2,
                        "text": "秦安县",
                        "value": 620522
                    },
                    {
                        "id": 620523,
                        "name": "甘谷县",
                        "pid": 620500,
                        "level": 2,
                        "text": "甘谷县",
                        "value": 620523
                    },
                    {
                        "id": 620524,
                        "name": "武山县",
                        "pid": 620500,
                        "level": 2,
                        "text": "武山县",
                        "value": 620524
                    },
                    {
                        "id": 620525,
                        "name": "张家川回族自治县",
                        "pid": 620500,
                        "level": 2,
                        "text": "张家川回族自治县",
                        "value": 620525
                    }
                ],
                "text": "天水市",
                "value": 620500
            },
            {
                "id": 620600,
                "name": "武威市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 620601,
                        "name": "市辖区",
                        "pid": 620600,
                        "level": 2,
                        "text": "市辖区",
                        "value": 620601
                    },
                    {
                        "id": 620602,
                        "name": "凉州区",
                        "pid": 620600,
                        "level": 2,
                        "text": "凉州区",
                        "value": 620602
                    },
                    {
                        "id": 620621,
                        "name": "民勤县",
                        "pid": 620600,
                        "level": 2,
                        "text": "民勤县",
                        "value": 620621
                    },
                    {
                        "id": 620622,
                        "name": "古浪县",
                        "pid": 620600,
                        "level": 2,
                        "text": "古浪县",
                        "value": 620622
                    },
                    {
                        "id": 620623,
                        "name": "天祝藏族自治县",
                        "pid": 620600,
                        "level": 2,
                        "text": "天祝藏族自治县",
                        "value": 620623
                    }
                ],
                "text": "武威市",
                "value": 620600
            },
            {
                "id": 620700,
                "name": "张掖市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 620701,
                        "name": "市辖区",
                        "pid": 620700,
                        "level": 2,
                        "text": "市辖区",
                        "value": 620701
                    },
                    {
                        "id": 620702,
                        "name": "甘州区",
                        "pid": 620700,
                        "level": 2,
                        "text": "甘州区",
                        "value": 620702
                    },
                    {
                        "id": 620721,
                        "name": "肃南裕固族自治县",
                        "pid": 620700,
                        "level": 2,
                        "text": "肃南裕固族自治县",
                        "value": 620721
                    },
                    {
                        "id": 620722,
                        "name": "民乐县",
                        "pid": 620700,
                        "level": 2,
                        "text": "民乐县",
                        "value": 620722
                    },
                    {
                        "id": 620723,
                        "name": "临泽县",
                        "pid": 620700,
                        "level": 2,
                        "text": "临泽县",
                        "value": 620723
                    },
                    {
                        "id": 620724,
                        "name": "高台县",
                        "pid": 620700,
                        "level": 2,
                        "text": "高台县",
                        "value": 620724
                    },
                    {
                        "id": 620725,
                        "name": "山丹县",
                        "pid": 620700,
                        "level": 2,
                        "text": "山丹县",
                        "value": 620725
                    }
                ],
                "text": "张掖市",
                "value": 620700
            },
            {
                "id": 620800,
                "name": "平凉市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 620801,
                        "name": "市辖区",
                        "pid": 620800,
                        "level": 2,
                        "text": "市辖区",
                        "value": 620801
                    },
                    {
                        "id": 620802,
                        "name": "崆峒区",
                        "pid": 620800,
                        "level": 2,
                        "text": "崆峒区",
                        "value": 620802
                    },
                    {
                        "id": 620821,
                        "name": "泾川县",
                        "pid": 620800,
                        "level": 2,
                        "text": "泾川县",
                        "value": 620821
                    },
                    {
                        "id": 620822,
                        "name": "灵台县",
                        "pid": 620800,
                        "level": 2,
                        "text": "灵台县",
                        "value": 620822
                    },
                    {
                        "id": 620823,
                        "name": "崇信县",
                        "pid": 620800,
                        "level": 2,
                        "text": "崇信县",
                        "value": 620823
                    },
                    {
                        "id": 620824,
                        "name": "华亭县",
                        "pid": 620800,
                        "level": 2,
                        "text": "华亭县",
                        "value": 620824
                    },
                    {
                        "id": 620825,
                        "name": "庄浪县",
                        "pid": 620800,
                        "level": 2,
                        "text": "庄浪县",
                        "value": 620825
                    },
                    {
                        "id": 620826,
                        "name": "静宁县",
                        "pid": 620800,
                        "level": 2,
                        "text": "静宁县",
                        "value": 620826
                    }
                ],
                "text": "平凉市",
                "value": 620800
            },
            {
                "id": 620900,
                "name": "酒泉市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 620901,
                        "name": "市辖区",
                        "pid": 620900,
                        "level": 2,
                        "text": "市辖区",
                        "value": 620901
                    },
                    {
                        "id": 620902,
                        "name": "肃州区",
                        "pid": 620900,
                        "level": 2,
                        "text": "肃州区",
                        "value": 620902
                    },
                    {
                        "id": 620921,
                        "name": "金塔县",
                        "pid": 620900,
                        "level": 2,
                        "text": "金塔县",
                        "value": 620921
                    },
                    {
                        "id": 620922,
                        "name": "瓜州县",
                        "pid": 620900,
                        "level": 2,
                        "text": "瓜州县",
                        "value": 620922
                    },
                    {
                        "id": 620923,
                        "name": "肃北蒙古族自治县",
                        "pid": 620900,
                        "level": 2,
                        "text": "肃北蒙古族自治县",
                        "value": 620923
                    },
                    {
                        "id": 620924,
                        "name": "阿克塞哈萨克族自治县",
                        "pid": 620900,
                        "level": 2,
                        "text": "阿克塞哈萨克族自治县",
                        "value": 620924
                    },
                    {
                        "id": 620981,
                        "name": "玉门市",
                        "pid": 620900,
                        "level": 2,
                        "text": "玉门市",
                        "value": 620981
                    },
                    {
                        "id": 620982,
                        "name": "敦煌市",
                        "pid": 620900,
                        "level": 2,
                        "text": "敦煌市",
                        "value": 620982
                    }
                ],
                "text": "酒泉市",
                "value": 620900
            },
            {
                "id": 621000,
                "name": "庆阳市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 621001,
                        "name": "市辖区",
                        "pid": 621000,
                        "level": 2,
                        "text": "市辖区",
                        "value": 621001
                    },
                    {
                        "id": 621002,
                        "name": "西峰区",
                        "pid": 621000,
                        "level": 2,
                        "text": "西峰区",
                        "value": 621002
                    },
                    {
                        "id": 621021,
                        "name": "庆城县",
                        "pid": 621000,
                        "level": 2,
                        "text": "庆城县",
                        "value": 621021
                    },
                    {
                        "id": 621022,
                        "name": "环县",
                        "pid": 621000,
                        "level": 2,
                        "text": "环县",
                        "value": 621022
                    },
                    {
                        "id": 621023,
                        "name": "华池县",
                        "pid": 621000,
                        "level": 2,
                        "text": "华池县",
                        "value": 621023
                    },
                    {
                        "id": 621024,
                        "name": "合水县",
                        "pid": 621000,
                        "level": 2,
                        "text": "合水县",
                        "value": 621024
                    },
                    {
                        "id": 621025,
                        "name": "正宁县",
                        "pid": 621000,
                        "level": 2,
                        "text": "正宁县",
                        "value": 621025
                    },
                    {
                        "id": 621026,
                        "name": "宁县",
                        "pid": 621000,
                        "level": 2,
                        "text": "宁县",
                        "value": 621026
                    },
                    {
                        "id": 621027,
                        "name": "镇原县",
                        "pid": 621000,
                        "level": 2,
                        "text": "镇原县",
                        "value": 621027
                    }
                ],
                "text": "庆阳市",
                "value": 621000
            },
            {
                "id": 621100,
                "name": "定西市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 621101,
                        "name": "市辖区",
                        "pid": 621100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 621101
                    },
                    {
                        "id": 621102,
                        "name": "安定区",
                        "pid": 621100,
                        "level": 2,
                        "text": "安定区",
                        "value": 621102
                    },
                    {
                        "id": 621121,
                        "name": "通渭县",
                        "pid": 621100,
                        "level": 2,
                        "text": "通渭县",
                        "value": 621121
                    },
                    {
                        "id": 621122,
                        "name": "陇西县",
                        "pid": 621100,
                        "level": 2,
                        "text": "陇西县",
                        "value": 621122
                    },
                    {
                        "id": 621123,
                        "name": "渭源县",
                        "pid": 621100,
                        "level": 2,
                        "text": "渭源县",
                        "value": 621123
                    },
                    {
                        "id": 621124,
                        "name": "临洮县",
                        "pid": 621100,
                        "level": 2,
                        "text": "临洮县",
                        "value": 621124
                    },
                    {
                        "id": 621125,
                        "name": "漳县",
                        "pid": 621100,
                        "level": 2,
                        "text": "漳县",
                        "value": 621125
                    },
                    {
                        "id": 621126,
                        "name": "岷县",
                        "pid": 621100,
                        "level": 2,
                        "text": "岷县",
                        "value": 621126
                    }
                ],
                "text": "定西市",
                "value": 621100
            },
            {
                "id": 621200,
                "name": "陇南市",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 621201,
                        "name": "市辖区",
                        "pid": 621200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 621201
                    },
                    {
                        "id": 621202,
                        "name": "武都区",
                        "pid": 621200,
                        "level": 2,
                        "text": "武都区",
                        "value": 621202
                    },
                    {
                        "id": 621221,
                        "name": "成县",
                        "pid": 621200,
                        "level": 2,
                        "text": "成县",
                        "value": 621221
                    },
                    {
                        "id": 621222,
                        "name": "文县",
                        "pid": 621200,
                        "level": 2,
                        "text": "文县",
                        "value": 621222
                    },
                    {
                        "id": 621223,
                        "name": "宕昌县",
                        "pid": 621200,
                        "level": 2,
                        "text": "宕昌县",
                        "value": 621223
                    },
                    {
                        "id": 621224,
                        "name": "康县",
                        "pid": 621200,
                        "level": 2,
                        "text": "康县",
                        "value": 621224
                    },
                    {
                        "id": 621225,
                        "name": "西和县",
                        "pid": 621200,
                        "level": 2,
                        "text": "西和县",
                        "value": 621225
                    },
                    {
                        "id": 621226,
                        "name": "礼县",
                        "pid": 621200,
                        "level": 2,
                        "text": "礼县",
                        "value": 621226
                    },
                    {
                        "id": 621227,
                        "name": "徽县",
                        "pid": 621200,
                        "level": 2,
                        "text": "徽县",
                        "value": 621227
                    },
                    {
                        "id": 621228,
                        "name": "两当县",
                        "pid": 621200,
                        "level": 2,
                        "text": "两当县",
                        "value": 621228
                    }
                ],
                "text": "陇南市",
                "value": 621200
            },
            {
                "id": 622900,
                "name": "临夏回族自治州",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 622901,
                        "name": "临夏市",
                        "pid": 622900,
                        "level": 2,
                        "text": "临夏市",
                        "value": 622901
                    },
                    {
                        "id": 622921,
                        "name": "临夏县",
                        "pid": 622900,
                        "level": 2,
                        "text": "临夏县",
                        "value": 622921
                    },
                    {
                        "id": 622922,
                        "name": "康乐县",
                        "pid": 622900,
                        "level": 2,
                        "text": "康乐县",
                        "value": 622922
                    },
                    {
                        "id": 622923,
                        "name": "永靖县",
                        "pid": 622900,
                        "level": 2,
                        "text": "永靖县",
                        "value": 622923
                    },
                    {
                        "id": 622924,
                        "name": "广河县",
                        "pid": 622900,
                        "level": 2,
                        "text": "广河县",
                        "value": 622924
                    },
                    {
                        "id": 622925,
                        "name": "和政县",
                        "pid": 622900,
                        "level": 2,
                        "text": "和政县",
                        "value": 622925
                    },
                    {
                        "id": 622926,
                        "name": "东乡族自治县",
                        "pid": 622900,
                        "level": 2,
                        "text": "东乡族自治县",
                        "value": 622926
                    },
                    {
                        "id": 622927,
                        "name": "积石山保安族东乡族撒拉族自治县",
                        "pid": 622900,
                        "level": 2,
                        "text": "积石山保安族东乡族撒拉族自治县",
                        "value": 622927
                    }
                ],
                "text": "临夏回族自治州",
                "value": 622900
            },
            {
                "id": 623000,
                "name": "甘南藏族自治州",
                "pid": 620000,
                "level": 1,
                "children": [
                    {
                        "id": 623001,
                        "name": "合作市",
                        "pid": 623000,
                        "level": 2,
                        "text": "合作市",
                        "value": 623001
                    },
                    {
                        "id": 623021,
                        "name": "临潭县",
                        "pid": 623000,
                        "level": 2,
                        "text": "临潭县",
                        "value": 623021
                    },
                    {
                        "id": 623022,
                        "name": "卓尼县",
                        "pid": 623000,
                        "level": 2,
                        "text": "卓尼县",
                        "value": 623022
                    },
                    {
                        "id": 623023,
                        "name": "舟曲县",
                        "pid": 623000,
                        "level": 2,
                        "text": "舟曲县",
                        "value": 623023
                    },
                    {
                        "id": 623024,
                        "name": "迭部县",
                        "pid": 623000,
                        "level": 2,
                        "text": "迭部县",
                        "value": 623024
                    },
                    {
                        "id": 623025,
                        "name": "玛曲县",
                        "pid": 623000,
                        "level": 2,
                        "text": "玛曲县",
                        "value": 623025
                    },
                    {
                        "id": 623026,
                        "name": "碌曲县",
                        "pid": 623000,
                        "level": 2,
                        "text": "碌曲县",
                        "value": 623026
                    },
                    {
                        "id": 623027,
                        "name": "夏河县",
                        "pid": 623000,
                        "level": 2,
                        "text": "夏河县",
                        "value": 623027
                    }
                ],
                "text": "甘南藏族自治州",
                "value": 623000
            }
        ],
        "text": "甘肃省",
        "value": 620000
    },
    {
        "id": 630000,
        "name": "青海省",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 630100,
                "name": "西宁市",
                "pid": 630000,
                "level": 1,
                "children": [
                    {
                        "id": 630101,
                        "name": "市辖区",
                        "pid": 630100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 630101
                    },
                    {
                        "id": 630102,
                        "name": "城东区",
                        "pid": 630100,
                        "level": 2,
                        "text": "城东区",
                        "value": 630102
                    },
                    {
                        "id": 630103,
                        "name": "城中区",
                        "pid": 630100,
                        "level": 2,
                        "text": "城中区",
                        "value": 630103
                    },
                    {
                        "id": 630104,
                        "name": "城西区",
                        "pid": 630100,
                        "level": 2,
                        "text": "城西区",
                        "value": 630104
                    },
                    {
                        "id": 630105,
                        "name": "城北区",
                        "pid": 630100,
                        "level": 2,
                        "text": "城北区",
                        "value": 630105
                    },
                    {
                        "id": 630121,
                        "name": "大通回族土族自治县",
                        "pid": 630100,
                        "level": 2,
                        "text": "大通回族土族自治县",
                        "value": 630121
                    },
                    {
                        "id": 630122,
                        "name": "湟中县",
                        "pid": 630100,
                        "level": 2,
                        "text": "湟中县",
                        "value": 630122
                    },
                    {
                        "id": 630123,
                        "name": "湟源县",
                        "pid": 630100,
                        "level": 2,
                        "text": "湟源县",
                        "value": 630123
                    }
                ],
                "text": "西宁市",
                "value": 630100
            },
            {
                "id": 630200,
                "name": "海东市",
                "pid": 630000,
                "level": 1,
                "children": [
                    {
                        "id": 630202,
                        "name": "乐都区",
                        "pid": 630200,
                        "level": 2,
                        "text": "乐都区",
                        "value": 630202
                    },
                    {
                        "id": 630203,
                        "name": "平安区",
                        "pid": 630200,
                        "level": 2,
                        "text": "平安区",
                        "value": 630203
                    },
                    {
                        "id": 630222,
                        "name": "民和回族土族自治县",
                        "pid": 630200,
                        "level": 2,
                        "text": "民和回族土族自治县",
                        "value": 630222
                    },
                    {
                        "id": 630223,
                        "name": "互助土族自治县",
                        "pid": 630200,
                        "level": 2,
                        "text": "互助土族自治县",
                        "value": 630223
                    },
                    {
                        "id": 630224,
                        "name": "化隆回族自治县",
                        "pid": 630200,
                        "level": 2,
                        "text": "化隆回族自治县",
                        "value": 630224
                    },
                    {
                        "id": 630225,
                        "name": "循化撒拉族自治县",
                        "pid": 630200,
                        "level": 2,
                        "text": "循化撒拉族自治县",
                        "value": 630225
                    }
                ],
                "text": "海东市",
                "value": 630200
            },
            {
                "id": 632200,
                "name": "海北藏族自治州",
                "pid": 630000,
                "level": 1,
                "children": [
                    {
                        "id": 632221,
                        "name": "门源回族自治县",
                        "pid": 632200,
                        "level": 2,
                        "text": "门源回族自治县",
                        "value": 632221
                    },
                    {
                        "id": 632222,
                        "name": "祁连县",
                        "pid": 632200,
                        "level": 2,
                        "text": "祁连县",
                        "value": 632222
                    },
                    {
                        "id": 632223,
                        "name": "海晏县",
                        "pid": 632200,
                        "level": 2,
                        "text": "海晏县",
                        "value": 632223
                    },
                    {
                        "id": 632224,
                        "name": "刚察县",
                        "pid": 632200,
                        "level": 2,
                        "text": "刚察县",
                        "value": 632224
                    }
                ],
                "text": "海北藏族自治州",
                "value": 632200
            },
            {
                "id": 632300,
                "name": "黄南藏族自治州",
                "pid": 630000,
                "level": 1,
                "children": [
                    {
                        "id": 632321,
                        "name": "同仁县",
                        "pid": 632300,
                        "level": 2,
                        "text": "同仁县",
                        "value": 632321
                    },
                    {
                        "id": 632322,
                        "name": "尖扎县",
                        "pid": 632300,
                        "level": 2,
                        "text": "尖扎县",
                        "value": 632322
                    },
                    {
                        "id": 632323,
                        "name": "泽库县",
                        "pid": 632300,
                        "level": 2,
                        "text": "泽库县",
                        "value": 632323
                    },
                    {
                        "id": 632324,
                        "name": "河南蒙古族自治县",
                        "pid": 632300,
                        "level": 2,
                        "text": "河南蒙古族自治县",
                        "value": 632324
                    }
                ],
                "text": "黄南藏族自治州",
                "value": 632300
            },
            {
                "id": 632500,
                "name": "海南藏族自治州",
                "pid": 630000,
                "level": 1,
                "children": [
                    {
                        "id": 632521,
                        "name": "共和县",
                        "pid": 632500,
                        "level": 2,
                        "text": "共和县",
                        "value": 632521
                    },
                    {
                        "id": 632522,
                        "name": "同德县",
                        "pid": 632500,
                        "level": 2,
                        "text": "同德县",
                        "value": 632522
                    },
                    {
                        "id": 632523,
                        "name": "贵德县",
                        "pid": 632500,
                        "level": 2,
                        "text": "贵德县",
                        "value": 632523
                    },
                    {
                        "id": 632524,
                        "name": "兴海县",
                        "pid": 632500,
                        "level": 2,
                        "text": "兴海县",
                        "value": 632524
                    },
                    {
                        "id": 632525,
                        "name": "贵南县",
                        "pid": 632500,
                        "level": 2,
                        "text": "贵南县",
                        "value": 632525
                    }
                ],
                "text": "海南藏族自治州",
                "value": 632500
            },
            {
                "id": 632600,
                "name": "果洛藏族自治州",
                "pid": 630000,
                "level": 1,
                "children": [
                    {
                        "id": 632621,
                        "name": "玛沁县",
                        "pid": 632600,
                        "level": 2,
                        "text": "玛沁县",
                        "value": 632621
                    },
                    {
                        "id": 632622,
                        "name": "班玛县",
                        "pid": 632600,
                        "level": 2,
                        "text": "班玛县",
                        "value": 632622
                    },
                    {
                        "id": 632623,
                        "name": "甘德县",
                        "pid": 632600,
                        "level": 2,
                        "text": "甘德县",
                        "value": 632623
                    },
                    {
                        "id": 632624,
                        "name": "达日县",
                        "pid": 632600,
                        "level": 2,
                        "text": "达日县",
                        "value": 632624
                    },
                    {
                        "id": 632625,
                        "name": "久治县",
                        "pid": 632600,
                        "level": 2,
                        "text": "久治县",
                        "value": 632625
                    },
                    {
                        "id": 632626,
                        "name": "玛多县",
                        "pid": 632600,
                        "level": 2,
                        "text": "玛多县",
                        "value": 632626
                    }
                ],
                "text": "果洛藏族自治州",
                "value": 632600
            },
            {
                "id": 632700,
                "name": "玉树藏族自治州",
                "pid": 630000,
                "level": 1,
                "children": [
                    {
                        "id": 632701,
                        "name": "玉树市",
                        "pid": 632700,
                        "level": 2,
                        "text": "玉树市",
                        "value": 632701
                    },
                    {
                        "id": 632722,
                        "name": "杂多县",
                        "pid": 632700,
                        "level": 2,
                        "text": "杂多县",
                        "value": 632722
                    },
                    {
                        "id": 632723,
                        "name": "称多县",
                        "pid": 632700,
                        "level": 2,
                        "text": "称多县",
                        "value": 632723
                    },
                    {
                        "id": 632724,
                        "name": "治多县",
                        "pid": 632700,
                        "level": 2,
                        "text": "治多县",
                        "value": 632724
                    },
                    {
                        "id": 632725,
                        "name": "囊谦县",
                        "pid": 632700,
                        "level": 2,
                        "text": "囊谦县",
                        "value": 632725
                    },
                    {
                        "id": 632726,
                        "name": "曲麻莱县",
                        "pid": 632700,
                        "level": 2,
                        "text": "曲麻莱县",
                        "value": 632726
                    }
                ],
                "text": "玉树藏族自治州",
                "value": 632700
            },
            {
                "id": 632800,
                "name": "海西蒙古族藏族自治州",
                "pid": 630000,
                "level": 1,
                "children": [
                    {
                        "id": 632801,
                        "name": "格尔木市",
                        "pid": 632800,
                        "level": 2,
                        "text": "格尔木市",
                        "value": 632801
                    },
                    {
                        "id": 632802,
                        "name": "德令哈市",
                        "pid": 632800,
                        "level": 2,
                        "text": "德令哈市",
                        "value": 632802
                    },
                    {
                        "id": 632821,
                        "name": "乌兰县",
                        "pid": 632800,
                        "level": 2,
                        "text": "乌兰县",
                        "value": 632821
                    },
                    {
                        "id": 632822,
                        "name": "都兰县",
                        "pid": 632800,
                        "level": 2,
                        "text": "都兰县",
                        "value": 632822
                    },
                    {
                        "id": 632823,
                        "name": "天峻县",
                        "pid": 632800,
                        "level": 2,
                        "text": "天峻县",
                        "value": 632823
                    }
                ],
                "text": "海西蒙古族藏族自治州",
                "value": 632800
            }
        ],
        "text": "青海省",
        "value": 630000
    },
    {
        "id": 640000,
        "name": "宁夏回族自治区",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 640100,
                "name": "银川市",
                "pid": 640000,
                "level": 1,
                "children": [
                    {
                        "id": 640101,
                        "name": "市辖区",
                        "pid": 640100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 640101
                    },
                    {
                        "id": 640104,
                        "name": "兴庆区",
                        "pid": 640100,
                        "level": 2,
                        "text": "兴庆区",
                        "value": 640104
                    },
                    {
                        "id": 640105,
                        "name": "西夏区",
                        "pid": 640100,
                        "level": 2,
                        "text": "西夏区",
                        "value": 640105
                    },
                    {
                        "id": 640106,
                        "name": "金凤区",
                        "pid": 640100,
                        "level": 2,
                        "text": "金凤区",
                        "value": 640106
                    },
                    {
                        "id": 640121,
                        "name": "永宁县",
                        "pid": 640100,
                        "level": 2,
                        "text": "永宁县",
                        "value": 640121
                    },
                    {
                        "id": 640122,
                        "name": "贺兰县",
                        "pid": 640100,
                        "level": 2,
                        "text": "贺兰县",
                        "value": 640122
                    },
                    {
                        "id": 640181,
                        "name": "灵武市",
                        "pid": 640100,
                        "level": 2,
                        "text": "灵武市",
                        "value": 640181
                    }
                ],
                "text": "银川市",
                "value": 640100
            },
            {
                "id": 640200,
                "name": "石嘴山市",
                "pid": 640000,
                "level": 1,
                "children": [
                    {
                        "id": 640201,
                        "name": "市辖区",
                        "pid": 640200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 640201
                    },
                    {
                        "id": 640202,
                        "name": "大武口区",
                        "pid": 640200,
                        "level": 2,
                        "text": "大武口区",
                        "value": 640202
                    },
                    {
                        "id": 640205,
                        "name": "惠农区",
                        "pid": 640200,
                        "level": 2,
                        "text": "惠农区",
                        "value": 640205
                    },
                    {
                        "id": 640221,
                        "name": "平罗县",
                        "pid": 640200,
                        "level": 2,
                        "text": "平罗县",
                        "value": 640221
                    }
                ],
                "text": "石嘴山市",
                "value": 640200
            },
            {
                "id": 640300,
                "name": "吴忠市",
                "pid": 640000,
                "level": 1,
                "children": [
                    {
                        "id": 640301,
                        "name": "市辖区",
                        "pid": 640300,
                        "level": 2,
                        "text": "市辖区",
                        "value": 640301
                    },
                    {
                        "id": 640302,
                        "name": "利通区",
                        "pid": 640300,
                        "level": 2,
                        "text": "利通区",
                        "value": 640302
                    },
                    {
                        "id": 640303,
                        "name": "红寺堡区",
                        "pid": 640300,
                        "level": 2,
                        "text": "红寺堡区",
                        "value": 640303
                    },
                    {
                        "id": 640323,
                        "name": "盐池县",
                        "pid": 640300,
                        "level": 2,
                        "text": "盐池县",
                        "value": 640323
                    },
                    {
                        "id": 640324,
                        "name": "同心县",
                        "pid": 640300,
                        "level": 2,
                        "text": "同心县",
                        "value": 640324
                    },
                    {
                        "id": 640381,
                        "name": "青铜峡市",
                        "pid": 640300,
                        "level": 2,
                        "text": "青铜峡市",
                        "value": 640381
                    }
                ],
                "text": "吴忠市",
                "value": 640300
            },
            {
                "id": 640400,
                "name": "固原市",
                "pid": 640000,
                "level": 1,
                "children": [
                    {
                        "id": 640401,
                        "name": "市辖区",
                        "pid": 640400,
                        "level": 2,
                        "text": "市辖区",
                        "value": 640401
                    },
                    {
                        "id": 640402,
                        "name": "原州区",
                        "pid": 640400,
                        "level": 2,
                        "text": "原州区",
                        "value": 640402
                    },
                    {
                        "id": 640422,
                        "name": "西吉县",
                        "pid": 640400,
                        "level": 2,
                        "text": "西吉县",
                        "value": 640422
                    },
                    {
                        "id": 640423,
                        "name": "隆德县",
                        "pid": 640400,
                        "level": 2,
                        "text": "隆德县",
                        "value": 640423
                    },
                    {
                        "id": 640424,
                        "name": "泾源县",
                        "pid": 640400,
                        "level": 2,
                        "text": "泾源县",
                        "value": 640424
                    },
                    {
                        "id": 640425,
                        "name": "彭阳县",
                        "pid": 640400,
                        "level": 2,
                        "text": "彭阳县",
                        "value": 640425
                    }
                ],
                "text": "固原市",
                "value": 640400
            },
            {
                "id": 640500,
                "name": "中卫市",
                "pid": 640000,
                "level": 1,
                "children": [
                    {
                        "id": 640501,
                        "name": "市辖区",
                        "pid": 640500,
                        "level": 2,
                        "text": "市辖区",
                        "value": 640501
                    },
                    {
                        "id": 640502,
                        "name": "沙坡头区",
                        "pid": 640500,
                        "level": 2,
                        "text": "沙坡头区",
                        "value": 640502
                    },
                    {
                        "id": 640521,
                        "name": "中宁县",
                        "pid": 640500,
                        "level": 2,
                        "text": "中宁县",
                        "value": 640521
                    },
                    {
                        "id": 640522,
                        "name": "海原县",
                        "pid": 640500,
                        "level": 2,
                        "text": "海原县",
                        "value": 640522
                    }
                ],
                "text": "中卫市",
                "value": 640500
            }
        ],
        "text": "宁夏回族自治区",
        "value": 640000
    },
    {
        "id": 650000,
        "name": "新疆维吾尔自治区",
        "pid": 0,
        "level": 0,
        "children": [
            {
                "id": 650100,
                "name": "乌鲁木齐市",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 650101,
                        "name": "市辖区",
                        "pid": 650100,
                        "level": 2,
                        "text": "市辖区",
                        "value": 650101
                    },
                    {
                        "id": 650102,
                        "name": "天山区",
                        "pid": 650100,
                        "level": 2,
                        "text": "天山区",
                        "value": 650102
                    },
                    {
                        "id": 650103,
                        "name": "沙依巴克区",
                        "pid": 650100,
                        "level": 2,
                        "text": "沙依巴克区",
                        "value": 650103
                    },
                    {
                        "id": 650104,
                        "name": "新市区",
                        "pid": 650100,
                        "level": 2,
                        "text": "新市区",
                        "value": 650104
                    },
                    {
                        "id": 650105,
                        "name": "水磨沟区",
                        "pid": 650100,
                        "level": 2,
                        "text": "水磨沟区",
                        "value": 650105
                    },
                    {
                        "id": 650106,
                        "name": "头屯河区",
                        "pid": 650100,
                        "level": 2,
                        "text": "头屯河区",
                        "value": 650106
                    },
                    {
                        "id": 650107,
                        "name": "达坂城区",
                        "pid": 650100,
                        "level": 2,
                        "text": "达坂城区",
                        "value": 650107
                    },
                    {
                        "id": 650109,
                        "name": "米东区",
                        "pid": 650100,
                        "level": 2,
                        "text": "米东区",
                        "value": 650109
                    },
                    {
                        "id": 650121,
                        "name": "乌鲁木齐县",
                        "pid": 650100,
                        "level": 2,
                        "text": "乌鲁木齐县",
                        "value": 650121
                    }
                ],
                "text": "乌鲁木齐市",
                "value": 650100
            },
            {
                "id": 650200,
                "name": "克拉玛依市",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 650201,
                        "name": "市辖区",
                        "pid": 650200,
                        "level": 2,
                        "text": "市辖区",
                        "value": 650201
                    },
                    {
                        "id": 650202,
                        "name": "独山子区",
                        "pid": 650200,
                        "level": 2,
                        "text": "独山子区",
                        "value": 650202
                    },
                    {
                        "id": 650203,
                        "name": "克拉玛依区",
                        "pid": 650200,
                        "level": 2,
                        "text": "克拉玛依区",
                        "value": 650203
                    },
                    {
                        "id": 650204,
                        "name": "白碱滩区",
                        "pid": 650200,
                        "level": 2,
                        "text": "白碱滩区",
                        "value": 650204
                    },
                    {
                        "id": 650205,
                        "name": "乌尔禾区",
                        "pid": 650200,
                        "level": 2,
                        "text": "乌尔禾区",
                        "value": 650205
                    }
                ],
                "text": "克拉玛依市",
                "value": 650200
            },
            {
                "id": 650400,
                "name": "吐鲁番市",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 650402,
                        "name": "高昌区",
                        "pid": 650400,
                        "level": 2,
                        "text": "高昌区",
                        "value": 650402
                    },
                    {
                        "id": 650421,
                        "name": "鄯善县",
                        "pid": 650400,
                        "level": 2,
                        "text": "鄯善县",
                        "value": 650421
                    },
                    {
                        "id": 650422,
                        "name": "托克逊县",
                        "pid": 650400,
                        "level": 2,
                        "text": "托克逊县",
                        "value": 650422
                    }
                ],
                "text": "吐鲁番市",
                "value": 650400
            },
            {
                "id": 650500,
                "name": "哈密市",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 650502,
                        "name": "伊州区",
                        "pid": 650500,
                        "level": 2,
                        "text": "伊州区",
                        "value": 650502
                    },
                    {
                        "id": 650521,
                        "name": "巴里坤哈萨克自治县",
                        "pid": 650500,
                        "level": 2,
                        "text": "巴里坤哈萨克自治县",
                        "value": 650521
                    },
                    {
                        "id": 650522,
                        "name": "伊吾县",
                        "pid": 650500,
                        "level": 2,
                        "text": "伊吾县",
                        "value": 650522
                    }
                ],
                "text": "哈密市",
                "value": 650500
            },
            {
                "id": 652300,
                "name": "昌吉回族自治州",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 652301,
                        "name": "昌吉市",
                        "pid": 652300,
                        "level": 2,
                        "text": "昌吉市",
                        "value": 652301
                    },
                    {
                        "id": 652302,
                        "name": "阜康市",
                        "pid": 652300,
                        "level": 2,
                        "text": "阜康市",
                        "value": 652302
                    },
                    {
                        "id": 652323,
                        "name": "呼图壁县",
                        "pid": 652300,
                        "level": 2,
                        "text": "呼图壁县",
                        "value": 652323
                    },
                    {
                        "id": 652324,
                        "name": "玛纳斯县",
                        "pid": 652300,
                        "level": 2,
                        "text": "玛纳斯县",
                        "value": 652324
                    },
                    {
                        "id": 652325,
                        "name": "奇台县",
                        "pid": 652300,
                        "level": 2,
                        "text": "奇台县",
                        "value": 652325
                    },
                    {
                        "id": 652327,
                        "name": "吉木萨尔县",
                        "pid": 652300,
                        "level": 2,
                        "text": "吉木萨尔县",
                        "value": 652327
                    },
                    {
                        "id": 652328,
                        "name": "木垒哈萨克自治县",
                        "pid": 652300,
                        "level": 2,
                        "text": "木垒哈萨克自治县",
                        "value": 652328
                    }
                ],
                "text": "昌吉回族自治州",
                "value": 652300
            },
            {
                "id": 652700,
                "name": "博尔塔拉蒙古自治州",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 652701,
                        "name": "博乐市",
                        "pid": 652700,
                        "level": 2,
                        "text": "博乐市",
                        "value": 652701
                    },
                    {
                        "id": 652702,
                        "name": "阿拉山口市",
                        "pid": 652700,
                        "level": 2,
                        "text": "阿拉山口市",
                        "value": 652702
                    },
                    {
                        "id": 652722,
                        "name": "精河县",
                        "pid": 652700,
                        "level": 2,
                        "text": "精河县",
                        "value": 652722
                    },
                    {
                        "id": 652723,
                        "name": "温泉县",
                        "pid": 652700,
                        "level": 2,
                        "text": "温泉县",
                        "value": 652723
                    }
                ],
                "text": "博尔塔拉蒙古自治州",
                "value": 652700
            },
            {
                "id": 652800,
                "name": "巴音郭楞蒙古自治州",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 652801,
                        "name": "库尔勒市",
                        "pid": 652800,
                        "level": 2,
                        "text": "库尔勒市",
                        "value": 652801
                    },
                    {
                        "id": 652822,
                        "name": "轮台县",
                        "pid": 652800,
                        "level": 2,
                        "text": "轮台县",
                        "value": 652822
                    },
                    {
                        "id": 652823,
                        "name": "尉犁县",
                        "pid": 652800,
                        "level": 2,
                        "text": "尉犁县",
                        "value": 652823
                    },
                    {
                        "id": 652824,
                        "name": "若羌县",
                        "pid": 652800,
                        "level": 2,
                        "text": "若羌县",
                        "value": 652824
                    },
                    {
                        "id": 652825,
                        "name": "且末县",
                        "pid": 652800,
                        "level": 2,
                        "text": "且末县",
                        "value": 652825
                    },
                    {
                        "id": 652826,
                        "name": "焉耆回族自治县",
                        "pid": 652800,
                        "level": 2,
                        "text": "焉耆回族自治县",
                        "value": 652826
                    },
                    {
                        "id": 652827,
                        "name": "和静县",
                        "pid": 652800,
                        "level": 2,
                        "text": "和静县",
                        "value": 652827
                    },
                    {
                        "id": 652828,
                        "name": "和硕县",
                        "pid": 652800,
                        "level": 2,
                        "text": "和硕县",
                        "value": 652828
                    },
                    {
                        "id": 652829,
                        "name": "博湖县",
                        "pid": 652800,
                        "level": 2,
                        "text": "博湖县",
                        "value": 652829
                    }
                ],
                "text": "巴音郭楞蒙古自治州",
                "value": 652800
            },
            {
                "id": 652900,
                "name": "阿克苏地区",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 652901,
                        "name": "阿克苏市",
                        "pid": 652900,
                        "level": 2,
                        "text": "阿克苏市",
                        "value": 652901
                    },
                    {
                        "id": 652922,
                        "name": "温宿县",
                        "pid": 652900,
                        "level": 2,
                        "text": "温宿县",
                        "value": 652922
                    },
                    {
                        "id": 652923,
                        "name": "库车县",
                        "pid": 652900,
                        "level": 2,
                        "text": "库车县",
                        "value": 652923
                    },
                    {
                        "id": 652924,
                        "name": "沙雅县",
                        "pid": 652900,
                        "level": 2,
                        "text": "沙雅县",
                        "value": 652924
                    },
                    {
                        "id": 652925,
                        "name": "新和县",
                        "pid": 652900,
                        "level": 2,
                        "text": "新和县",
                        "value": 652925
                    },
                    {
                        "id": 652926,
                        "name": "拜城县",
                        "pid": 652900,
                        "level": 2,
                        "text": "拜城县",
                        "value": 652926
                    },
                    {
                        "id": 652927,
                        "name": "乌什县",
                        "pid": 652900,
                        "level": 2,
                        "text": "乌什县",
                        "value": 652927
                    },
                    {
                        "id": 652928,
                        "name": "阿瓦提县",
                        "pid": 652900,
                        "level": 2,
                        "text": "阿瓦提县",
                        "value": 652928
                    },
                    {
                        "id": 652929,
                        "name": "柯坪县",
                        "pid": 652900,
                        "level": 2,
                        "text": "柯坪县",
                        "value": 652929
                    }
                ],
                "text": "阿克苏地区",
                "value": 652900
            },
            {
                "id": 653000,
                "name": "克孜勒苏柯尔克孜自治州",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 653001,
                        "name": "阿图什市",
                        "pid": 653000,
                        "level": 2,
                        "text": "阿图什市",
                        "value": 653001
                    },
                    {
                        "id": 653022,
                        "name": "阿克陶县",
                        "pid": 653000,
                        "level": 2,
                        "text": "阿克陶县",
                        "value": 653022
                    },
                    {
                        "id": 653023,
                        "name": "阿合奇县",
                        "pid": 653000,
                        "level": 2,
                        "text": "阿合奇县",
                        "value": 653023
                    },
                    {
                        "id": 653024,
                        "name": "乌恰县",
                        "pid": 653000,
                        "level": 2,
                        "text": "乌恰县",
                        "value": 653024
                    }
                ],
                "text": "克孜勒苏柯尔克孜自治州",
                "value": 653000
            },
            {
                "id": 653100,
                "name": "喀什地区",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 653101,
                        "name": "喀什市",
                        "pid": 653100,
                        "level": 2,
                        "text": "喀什市",
                        "value": 653101
                    },
                    {
                        "id": 653121,
                        "name": "疏附县",
                        "pid": 653100,
                        "level": 2,
                        "text": "疏附县",
                        "value": 653121
                    },
                    {
                        "id": 653122,
                        "name": "疏勒县",
                        "pid": 653100,
                        "level": 2,
                        "text": "疏勒县",
                        "value": 653122
                    },
                    {
                        "id": 653123,
                        "name": "英吉沙县",
                        "pid": 653100,
                        "level": 2,
                        "text": "英吉沙县",
                        "value": 653123
                    },
                    {
                        "id": 653124,
                        "name": "泽普县",
                        "pid": 653100,
                        "level": 2,
                        "text": "泽普县",
                        "value": 653124
                    },
                    {
                        "id": 653125,
                        "name": "莎车县",
                        "pid": 653100,
                        "level": 2,
                        "text": "莎车县",
                        "value": 653125
                    },
                    {
                        "id": 653126,
                        "name": "叶城县",
                        "pid": 653100,
                        "level": 2,
                        "text": "叶城县",
                        "value": 653126
                    },
                    {
                        "id": 653127,
                        "name": "麦盖提县",
                        "pid": 653100,
                        "level": 2,
                        "text": "麦盖提县",
                        "value": 653127
                    },
                    {
                        "id": 653128,
                        "name": "岳普湖县",
                        "pid": 653100,
                        "level": 2,
                        "text": "岳普湖县",
                        "value": 653128
                    },
                    {
                        "id": 653129,
                        "name": "伽师县",
                        "pid": 653100,
                        "level": 2,
                        "text": "伽师县",
                        "value": 653129
                    },
                    {
                        "id": 653130,
                        "name": "巴楚县",
                        "pid": 653100,
                        "level": 2,
                        "text": "巴楚县",
                        "value": 653130
                    },
                    {
                        "id": 653131,
                        "name": "塔什库尔干塔吉克自治县",
                        "pid": 653100,
                        "level": 2,
                        "text": "塔什库尔干塔吉克自治县",
                        "value": 653131
                    }
                ],
                "text": "喀什地区",
                "value": 653100
            },
            {
                "id": 653200,
                "name": "和田地区",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 653201,
                        "name": "和田市",
                        "pid": 653200,
                        "level": 2,
                        "text": "和田市",
                        "value": 653201
                    },
                    {
                        "id": 653221,
                        "name": "和田县",
                        "pid": 653200,
                        "level": 2,
                        "text": "和田县",
                        "value": 653221
                    },
                    {
                        "id": 653222,
                        "name": "墨玉县",
                        "pid": 653200,
                        "level": 2,
                        "text": "墨玉县",
                        "value": 653222
                    },
                    {
                        "id": 653223,
                        "name": "皮山县",
                        "pid": 653200,
                        "level": 2,
                        "text": "皮山县",
                        "value": 653223
                    },
                    {
                        "id": 653224,
                        "name": "洛浦县",
                        "pid": 653200,
                        "level": 2,
                        "text": "洛浦县",
                        "value": 653224
                    },
                    {
                        "id": 653225,
                        "name": "策勒县",
                        "pid": 653200,
                        "level": 2,
                        "text": "策勒县",
                        "value": 653225
                    },
                    {
                        "id": 653226,
                        "name": "于田县",
                        "pid": 653200,
                        "level": 2,
                        "text": "于田县",
                        "value": 653226
                    },
                    {
                        "id": 653227,
                        "name": "民丰县",
                        "pid": 653200,
                        "level": 2,
                        "text": "民丰县",
                        "value": 653227
                    }
                ],
                "text": "和田地区",
                "value": 653200
            },
            {
                "id": 654000,
                "name": "伊犁哈萨克自治州",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 654002,
                        "name": "伊宁市",
                        "pid": 654000,
                        "level": 2,
                        "text": "伊宁市",
                        "value": 654002
                    },
                    {
                        "id": 654003,
                        "name": "奎屯市",
                        "pid": 654000,
                        "level": 2,
                        "text": "奎屯市",
                        "value": 654003
                    },
                    {
                        "id": 654004,
                        "name": "霍尔果斯市",
                        "pid": 654000,
                        "level": 2,
                        "text": "霍尔果斯市",
                        "value": 654004
                    },
                    {
                        "id": 654021,
                        "name": "伊宁县",
                        "pid": 654000,
                        "level": 2,
                        "text": "伊宁县",
                        "value": 654021
                    },
                    {
                        "id": 654022,
                        "name": "察布查尔锡伯自治县",
                        "pid": 654000,
                        "level": 2,
                        "text": "察布查尔锡伯自治县",
                        "value": 654022
                    },
                    {
                        "id": 654023,
                        "name": "霍城县",
                        "pid": 654000,
                        "level": 2,
                        "text": "霍城县",
                        "value": 654023
                    },
                    {
                        "id": 654024,
                        "name": "巩留县",
                        "pid": 654000,
                        "level": 2,
                        "text": "巩留县",
                        "value": 654024
                    },
                    {
                        "id": 654025,
                        "name": "新源县",
                        "pid": 654000,
                        "level": 2,
                        "text": "新源县",
                        "value": 654025
                    },
                    {
                        "id": 654026,
                        "name": "昭苏县",
                        "pid": 654000,
                        "level": 2,
                        "text": "昭苏县",
                        "value": 654026
                    },
                    {
                        "id": 654027,
                        "name": "特克斯县",
                        "pid": 654000,
                        "level": 2,
                        "text": "特克斯县",
                        "value": 654027
                    },
                    {
                        "id": 654028,
                        "name": "尼勒克县",
                        "pid": 654000,
                        "level": 2,
                        "text": "尼勒克县",
                        "value": 654028
                    }
                ],
                "text": "伊犁哈萨克自治州",
                "value": 654000
            },
            {
                "id": 654200,
                "name": "塔城地区",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 654201,
                        "name": "塔城市",
                        "pid": 654200,
                        "level": 2,
                        "text": "塔城市",
                        "value": 654201
                    },
                    {
                        "id": 654202,
                        "name": "乌苏市",
                        "pid": 654200,
                        "level": 2,
                        "text": "乌苏市",
                        "value": 654202
                    },
                    {
                        "id": 654221,
                        "name": "额敏县",
                        "pid": 654200,
                        "level": 2,
                        "text": "额敏县",
                        "value": 654221
                    },
                    {
                        "id": 654223,
                        "name": "沙湾县",
                        "pid": 654200,
                        "level": 2,
                        "text": "沙湾县",
                        "value": 654223
                    },
                    {
                        "id": 654224,
                        "name": "托里县",
                        "pid": 654200,
                        "level": 2,
                        "text": "托里县",
                        "value": 654224
                    },
                    {
                        "id": 654225,
                        "name": "裕民县",
                        "pid": 654200,
                        "level": 2,
                        "text": "裕民县",
                        "value": 654225
                    },
                    {
                        "id": 654226,
                        "name": "和布克赛尔蒙古自治县",
                        "pid": 654200,
                        "level": 2,
                        "text": "和布克赛尔蒙古自治县",
                        "value": 654226
                    }
                ],
                "text": "塔城地区",
                "value": 654200
            },
            {
                "id": 654300,
                "name": "阿勒泰地区",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 654301,
                        "name": "阿勒泰市",
                        "pid": 654300,
                        "level": 2,
                        "text": "阿勒泰市",
                        "value": 654301
                    },
                    {
                        "id": 654321,
                        "name": "布尔津县",
                        "pid": 654300,
                        "level": 2,
                        "text": "布尔津县",
                        "value": 654321
                    },
                    {
                        "id": 654322,
                        "name": "富蕴县",
                        "pid": 654300,
                        "level": 2,
                        "text": "富蕴县",
                        "value": 654322
                    },
                    {
                        "id": 654323,
                        "name": "福海县",
                        "pid": 654300,
                        "level": 2,
                        "text": "福海县",
                        "value": 654323
                    },
                    {
                        "id": 654324,
                        "name": "哈巴河县",
                        "pid": 654300,
                        "level": 2,
                        "text": "哈巴河县",
                        "value": 654324
                    },
                    {
                        "id": 654325,
                        "name": "青河县",
                        "pid": 654300,
                        "level": 2,
                        "text": "青河县",
                        "value": 654325
                    },
                    {
                        "id": 654326,
                        "name": "吉木乃县",
                        "pid": 654300,
                        "level": 2,
                        "text": "吉木乃县",
                        "value": 654326
                    }
                ],
                "text": "阿勒泰地区",
                "value": 654300
            },
            {
                "id": 659000,
                "name": "自治区直辖县级行政区划",
                "pid": 650000,
                "level": 1,
                "children": [
                    {
                        "id": 659001,
                        "name": "石河子市",
                        "pid": 659000,
                        "level": 2,
                        "text": "石河子市",
                        "value": 659001
                    },
                    {
                        "id": 659002,
                        "name": "阿拉尔市",
                        "pid": 659000,
                        "level": 2,
                        "text": "阿拉尔市",
                        "value": 659002
                    },
                    {
                        "id": 659003,
                        "name": "图木舒克市",
                        "pid": 659000,
                        "level": 2,
                        "text": "图木舒克市",
                        "value": 659003
                    },
                    {
                        "id": 659004,
                        "name": "五家渠市",
                        "pid": 659000,
                        "level": 2,
                        "text": "五家渠市",
                        "value": 659004
                    },
                    {
                        "id": 659006,
                        "name": "铁门关市",
                        "pid": 659000,
                        "level": 2,
                        "text": "铁门关市",
                        "value": 659006
                    }
                ],
                "text": "自治区直辖县级行政区划",
                "value": 659000
            }
        ],
        "text": "新疆维吾尔自治区",
        "value": 650000
    },
    {
        "id": 710000,
        "name": "台湾省",
        "pid": 0,
        "level": 0,
        "text": "台湾省",
        "value": 710000
    },
    {
        "id": 810000,
        "name": "香港特别行政区",
        "pid": 0,
        "level": 0,
        "text": "香港特别行政区",
        "value": 810000
    },
    {
        "id": 820000,
        "name": "澳门特别行政区",
        "pid": 0,
        "level": 0,
        "text": "澳门特别行政区",
        "value": 820000
    }
]
export default areas;